{"id":3646,"date":"2018-12-01T21:34:51","date_gmt":"2018-12-01T21:34:51","guid":{"rendered":"https:\/\/wavegp.com\/?p=3646"},"modified":"2020-11-22T21:40:09","modified_gmt":"2020-11-22T21:40:09","slug":"wave-financial-year-end-market-update","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-year-end-market-update\/","title":{"rendered":"Wave Financial Year End Market Update"},"content":{"rendered":"\n<p>2018 was a challenging year for cryptoasset prices and in Q4 we witnessed the acceleration of market declines, followed finally by a rally the last week of December.<\/p>\n\n\n\n<p><strong><em>DISCLAIMER:&nbsp;<\/em><\/strong><\/p>\n\n\n\n<p><em>This informational piece is intended to inform Wave Financial’s audience of the current status of the crypto industry. Nothing in this material should be interpreted as an offer or recommendation to buy, sell or hold any security or other financial product.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Wave Financial, LLC is a registered investment adviser, registered with the state of California. Registration with the SEC or state authority does not imply a certain level of skill or training. Additional information including important disclosures about Wave Financial, LLC also is available on the SEC’s website at&nbsp;<\/em><a href=\"http:\/\/www.adviserinfo.sec.gov\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>www.adviserinfo.sec.gov<\/em><\/a><em>. Or, learn more information about Wavemaker Financial at&nbsp;<\/em><a href=\"https:\/\/wavegp.com\/\"><em>www.wavegp.com<\/em><\/a><em>.&nbsp;<\/em><\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h3><strong>I. Market Update&nbsp;<\/strong><\/h3>\n\n\n\n<p><strong>Cryptoasset Prices(1)&nbsp;<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/uploads-ssl.webflow.com\/5ccc76413871f9dbdcc7b74e\/5ccc76413871f98d08c7b908_Screen%20Shot%202019-03-19%20at%209.22.02%20AM.png\" alt=\"\"\/><\/figure>\n\n\n\n<p>2018 was a challenging year for cryptoasset prices and in Q4 we witnessed the acceleration of market declines, followed finally by a rally the last week of December. In sum, the price of Bitcoin (a leading indicator for cryptoasset prices) has declined by 72.9% in 2018.&nbsp;<\/p>\n\n\n\n<h4><strong>Is This The Bottom?&nbsp;<\/strong><\/h4>\n\n\n\n<p>We are not traders and therefore, predictions of near-term market price movements are not our strength.&nbsp;<\/p>\n\n\n\n<p>From a fundamental standpoint, we expect to see the market bottom when a substantial amount of pain has begun to impact businesses across the industry. This pain has certainly begun but may continue through 2019.&nbsp;<\/p>\n\n\n\n<p>As we have stated before, treasury management has become a major issue in the crypto industry. In 2018, many crypto companies became speculators. Having received the vast majority of their financing in Ether (ETH), they abstained from liquidating ETH in order to manage their operational costs (which are paid in fiat). After the 12-month price of ETH declined 81.9% in 2018, many of these companies (who believed they were holding tens of millions of USD-equivalent in capital) have burned through their runway. Many are&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/20\/icos-are-not-liquidating-their-eth-treasuries-despite-price-declines-yet\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">still holding ETH<\/a>&nbsp;in their treasuries, and if the ETH sell-off returns (the price of ETH has rallied over 50% in January), they may be forced to liquidate which could trigger a spiral of further price declines.&nbsp;<\/p>\n\n\n\n<p>We have seen a tightening of the belt across the board, as companies reduce headcount to survive a prolonged crypto winter. Substantial layoffs in the industry have affected even some of the largest players. A leading dApp by usage, SteemIt,&nbsp;<a href=\"https:\/\/techcrunch.com\/2018\/11\/28\/steemit-a-decentralized-sharing-system-lays-of-70-of-staff\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">laid off 70% of their workforce in November 2018.<\/a>&nbsp;Industry giants like Consensys and Galaxy Digital, both of which expanded rapidly to capitalize on the rising prices in 2017<a href=\"https:\/\/wavegp.com\/media\/wave-financial-year-end-market-update#\">&nbsp;have not been immune to layoffs,<\/a>&nbsp;with Consensys expected to cut&nbsp;<a href=\"https:\/\/www.coindesk.com\/consensys-confirms-layoffs-projecting-13-of-staff-at-startups-to-be-cut\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">13% of its workforce.<\/a>&nbsp;<\/p>\n\n\n\n<p>In Asia, large exchanges and miners have also been impacted. Bitmain, who in June&nbsp;<a href=\"https:\/\/www.ccn.com\/bitmain-raises-400-million-pre-ipo-funding-round-now-valued-at-12-billion-report\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">raised $400M in Pre-IPO financing at an estimated $12 billion valuation<\/a>, is reportedly l<a href=\"https:\/\/www.newsbtc.com\/2018\/12\/26\/investor-bitmain-firing-80-workforce-is-bad-for-bitcoin-cash-and-litecoin\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">aying off over 80% of its workforce<\/a>. Huobi Group, one of the largest exchanges in China, is&nbsp;<a href=\"https:\/\/twitter.com\/DoveyWan\/status\/1078346204625416195\" rel=\"nofollow noopener\" target=\"_blank\">“optimizing staff”<\/a>&nbsp;as it cuts workers to manage cash flow.&nbsp;<\/p>\n\n\n\n<p>We expect to see a continuation of this downsizing trend, which (given the reflexive nature of markets) could lead to further near term price declines.&nbsp;<em>In sum, we expect “crypto winter” to get worse before it gets better.&nbsp;<\/em><\/p>\n\n\n\n<p>In spite of this, we remain undeterred by price declines. We understand that market prices are important short-term indicators of market sentiment, risk, and a proxy for new investment into the space; however, as an early-stage venture investor with a long-term view on the industry and at least a 3-5 year time horizon.&nbsp;<\/p>\n\n\n\n<p>As such, this update will primarily focus on the fundamentals.&nbsp;<\/p>\n\n\n\n<p>Finally, in spite of price declines, 2018 was a year of great innovation in the industry. A few major challenges that blocked mass crypto adoption were tackled head-on by a number of existing market leaders and new entrants.&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h3><strong>II. Fundamental Improvements to Functionality in 2018&nbsp;<\/strong><\/h3>\n\n\n\n<p>In crypto, we often joke that the industry moves so fast that days can feel like weeks, weeks like months and months like years in other industries. Looking back at the beginning of 2018 feels like looking back nearly a decade.&nbsp;<\/p>\n\n\n\n<p>At the start of 2018, there were still two major challenges that needed to be solved at the infrastructure layer:&nbsp;<strong>scalability and volatility.&nbsp;<\/strong><\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Scalability&nbsp;<\/strong><\/h4>\n\n\n\n<p>There has been a great deal of writing about the scalability problem facing leading cryptoassets [<a href=\"https:\/\/hackernoon.com\/blockchains-dont-scale-not-today-at-least-but-there-s-hope-2cb43946551a\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">see here for a review that has informed us on the subject<\/a>]. In short, scalability refers to the limit to the number of transactions that a network can process and is measured in transactions per second (tps).&nbsp;<\/p>\n\n\n\n<p>As of writing, Bitcoin and Ethereum max at around 7 tps and 15 tps, respectively. To put this in context individuals often cite the Visa network’s ability to process 45,000 tps as a benchmark. This is many orders of magnitude greater than that of the Ethereum and Bitcoin protocols. For further context, a simple dApp built on Ethereum, called Crypto Kitties, n<a href=\"https:\/\/media.consensys.net\/the-inside-story-of-the-cryptokitties-congestion-crisis-499b35d119cc\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">early grinded the Ethereum network to a halt<\/a>, at the end of 2017.&nbsp;<\/p>\n\n\n\n<p>You can understand why this is a major problem:&nbsp;<em>without scalability, these networks cannot function<\/em><strong>.&nbsp;<\/strong><\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Delays to the Ethereum Scalability Roadmap&nbsp;<\/strong><\/h4>\n\n\n\n<p>Leading Ethereum developers like Vitalik Buterin have been promising scalability solutions since mid-2017, but they have yet to deliver. This may partially explain the drastic decline in ETH prices from all-time highs this year: investors are losing faith in the Ethereum community’s ability to deliver on its development roadmap.&nbsp;<\/p>\n\n\n\n<p>ETH scalability proposals include both:&nbsp;<\/p>\n\n\n\n<p>1. Layer 1 \/ On-chain Solutions:&nbsp;<br>&nbsp;&nbsp;a.&nbsp;<a href=\"https:\/\/blockgeeks.com\/guides\/ethereum-casper\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Casper:<\/a>&nbsp;a shift in Ethereum’s consensus mechanism from Proof of Work to Proof of Stake&nbsp;<br>&nbsp;&nbsp;&nbsp;b.&nbsp;<a href=\"https:\/\/blockonomi.com\/sharding\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Sharding:<\/a>&nbsp;essentially divides the underlying database into smaller pieces or shards&nbsp;<br>&nbsp;&nbsp;&nbsp;c. Combined these are known as “Shasper”, but most recently named&nbsp;<a href=\"https:\/\/ethereumworldnews.com\/ethereum-developer-serenity-is-moving-really-fast-sharding-by-2020\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Serenity<\/a>&nbsp;<\/p>\n\n\n\n<p>2. Layer 2 \/ Off-chain Solutions:&nbsp;<\/p>\n\n\n\n<p>&nbsp;&nbsp;a.&nbsp;<a href=\"https:\/\/medium.com\/@argongroup\/ethereum-plasma-explained-608720d3c60e\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Plasma:&nbsp;<\/a>allows for off-chain transactions while still relying on the underlying security of the Ethereum blockchain&nbsp;<\/p>\n\n\n\n<p>&nbsp;&nbsp;&nbsp;b. State Channels: transactions happen off-chain, but the history or “state” of these transactions can periodically be sent on-chain for security and verification purposes. Two dApps currently leading the development of Ethereum state channels are&nbsp;<a href=\"https:\/\/funfair.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Funfair<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/spankchain.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">SpankChain<\/a>&nbsp;(as we have seen historically, vice remains a technological bellwether)&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<p>The initial Casper release date was scheduled for mid-2018 but has since been pushed back to 2019-2021 (a very broad range). For a deeper understanding of the changes to the Ethereum development roadmap, you can read&nbsp;<a href=\"https:\/\/www.mangoresearch.co\/ethereum-roadmap-update\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/medium.com\/rocket-pool\/ethereum-2-0-whos-building-it-54a735442e\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.&nbsp;<\/p>\n\n\n\n<p>At DevCon Prague, in November 2018, Ethereum’s leading developer, Vitalik Buterin, announced a new path towards scaling Ethereum called it Ethereum 2.0 \/ Serenity, but he has yet to release a clear timeline for development.&nbsp;<\/p>\n\n\n\n<p>However, in the face of mounting price declines and competition, the Ethereum community is finally shipping a major protocol update via a hard fork:&nbsp;<a href=\"https:\/\/www.newsbtc.com\/2019\/01\/03\/ethereum-surges-85-in-18-days-as-constantinople-hard-fork-approaches\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Constantinople<\/a>. Constantinople makes a few changes that drive scalability and prepare the Ethereum network for Casper and Sharding. With the hard fork scheduled for January 15, 2019, Constantinople offers promising updates for the future of Ethereum and as a result, the price of ETH has&nbsp;<a href=\"https:\/\/www.newsbtc.com\/2019\/01\/03\/ethereum-surges-85-in-18-days-as-constantinople-hard-fork-approaches\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">surged over 50% from its 12 month lows<\/a>.&nbsp;<em>Note: since writing this letter, the Constantinople hard fork has been&nbsp;<\/em><a href=\"https:\/\/www.coindesk.com\/ethereums-constantinople-upgrade-faces-delay-due-to-security-vulnerability\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>delayed until the end of February&nbsp;<\/em><\/a><em>due to the discovery of a security vulnerability.&nbsp;<\/em><\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Competitive, Scalable Smart Contract Platforms Launch in 2018&nbsp;<\/strong><\/h4>\n\n\n\n<p>While Ethereum was plagued by continued delays and uncertainty on its development roadmap, a number of competitive smart contract platforms with improved on-chain scalability went live in 2018. There were four smart contract platforms that launched a main net in 2018. These platforms use various new consensus mechanisms to solve on-chain scaling issues.&nbsp;<\/p>\n\n\n\n<ol><li>Tezos &#8211; went live in September 2018. Like Ethereum, Tezos is a smart contract platform created by the&nbsp;<a href=\"https:\/\/tezos.foundation\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Tezos Foundation<\/a>&nbsp;and founder<a href=\"https:\/\/decryptmedia.com\/2018\/11\/01\/tezos-arthur-breitman-interview-blockchain\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Arthur Breitman<\/a>. Tezos offers a new consensus algorithm called&nbsp;<a href=\"https:\/\/medium.com\/tezos\/liquid-proof-of-stake-aec2f7ef1da7\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Liquid Proof of Stake or LPoS<\/a>. In LPoS, if a user owns 10,000 Tezos tokens (aka Tezzies or XTZ), he\/she can become a delegate (known as a “baker”).&nbsp;<br><br>The baker must stake at least 8.25% of the total tokens delegated at any time. Other users have the option to delegate their tokens to these “bakers” by voting without giving up custody of their assets. Tezos currently achieves scalability of 40 tps, which is faster than both BTC and ETH, but unlkely to drive real-world adoption. There are a number of scaling proposals in place to improve the Tezos protocol in 2019.&nbsp;<br>‍<\/li><li>EOS &#8211; EOS is a smart contract platform developed by&nbsp;<a href=\"https:\/\/block.one\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Block.One<\/a>&nbsp;and lead developer&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Daniel_Larimer\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Dan Larimer<\/a>&nbsp;(creator of Steem.it &amp; Bitshares) that relies on a consensus algorithm known as&nbsp;<a href=\"https:\/\/medium.com\/eosio\/dpos-bft-pipelined-byzantine-fault-tolerance-8a0634a270ba\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Delegated Proof of Stake or DPoS<\/a>. DPoS trades decentralization for scalability. The EOS network only has 21 block producers validating transactions at any one time. This reduction in the number of validating nodes increases the speed of the network. These 21 BPs are considered “delegates” because they are voted on by EOS token holders who must stake their tokens to vote. The top 100 block producers by votes are rewarded in EOS tokens based on a 1% annual inflation rate, with the top 21 block producers receiving the majority of these “block rewards”. Unlike Tezos delegators, voters in EOS are not entitled to any rewards earned by the block producers.&nbsp;<br>‍<\/li><li>The EOS mainnet launched in June 2018 and can currently scale between 3,000-4,000 tps. The launch was&nbsp;<a href=\"https:\/\/bravenewcoin.com\/insights\/lessons-learnt-and-questions-raised-from-the-eos-mainnet-launch\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">far from perfect<\/a>, but the platform has since accelerated its volume by attracting many new dApps. EOS is Ethereum’s 553,000. There remains controversy around the&nbsp;<a href=\"https:\/\/cryptoslate.com\/new-whiteblock-research-casts-doubt-on-eos-claims-says-eos-is-not-a-blockchain\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">functioning of EOS<\/a>, continued governance issues including a new&nbsp;<a href=\"https:\/\/cryptonomist.ch\/en\/2018\/09\/21\/eos-fork\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">EOS fork called Telos<\/a>, and the validity of its transaction volume.Tron &#8211; Tron launched its mainnet in May 2018 with a DPoS consensus algorithm similar to that of EOS. Tron is not taken very seriously by industry insiders, but in 2018 Tron&nbsp;<a href=\"https:\/\/www.engadget.com\/2018\/07\/25\/blockchain-company-tron-buys-bittorrent\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">acquired BitTorrent, the largest p2p filesharing service for an estimated $126M<\/a>, which placed it meaningfully on the map.<br><br>BitTorrent recently announced that it will&nbsp;<a href=\"https:\/\/oracletimes.com\/binance-launchpad-allows-the-monthly-launch-of-a-new-token-bittorrent-btt-fetch-ai-are-the-first-projects\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">launch its own BTT token in partnership with Binance in January 2019<\/a>. This token will be built on the Tron protocol.<br>‍<\/li><li>GoChain&nbsp;<strong>&#8211;&nbsp;<\/strong>An under-the-radar smart contract platform launched its mainnet in May 2018 with 1,300 transactions per second. GoChain’s consensus algorithm is called Proof of Reputation (PoR), which is a slight adjustment to Proof of Authority (PoA). Similar to DPoS, PoR sacrifices decentralization for scalability &#8211; GoChain will have a maximum of 50 nodes in its network and is focused on ensuring all nodes are based in different countries.&nbsp;<br><br>These are just a sample of new smart contract platforms that launched as competitors to Ethereum in 2018. There are many more that are expected to launch mainnets in 2019 (see below).&nbsp;<\/li><\/ol>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>The Lightning Network: Bitcoin’s Off-Chain Scaling Solution&nbsp;<\/strong><\/h4>\n\n\n\n<p>Meanwhile, 2018 was the year in which Bitcoin may have achieved meaningful scalability via a Layer 2 (Off-chain) solution known as the&nbsp;<a href=\"https:\/\/cointelegraph.com\/lightning-network-101\/what-is-lightning-network-and-how-it-works\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Lightning Network<\/a>&nbsp;(“LN”). Similar to Ethereum’s Plasma proposal, LN enables any two parties to create a direct payment channel with one another in order to transact almost instantaneously with near-zero transaction fees on the Bitcoin network. While LN improves scalability and reduces transaction costs, it is most suitable for smaller transactions as it sacrifices the security of the underlying Bitcoin blockchain.&nbsp;<\/p>\n\n\n\n<p>The big story of 2018 may very well be the growth of the Lightning Network (“LN”). Led by&nbsp;<a href=\"https:\/\/blockstream.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Blockstream<\/a>,&nbsp;<a href=\"https:\/\/lightning.engineering\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Lightning Labs<\/a>, and&nbsp;<a href=\"https:\/\/acinq.co\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">ACINQ<\/a>, LN l<a href=\"https:\/\/www.forbes.com\/sites\/ktorpey\/2018\/03\/15\/bitcoins-highly-anticipated-lightning-network-goes-live-as-startup-raises-2-5-million\/#682567a07eb0\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">aunched in March 2018.<\/a>&nbsp;Since its launch, there are now over 5,000 nodes and 12,000 payment channels on LN, representing nearly 6x growth since inception. In addition, the capacity of the LN recently surpassed 500 BTC or the equivalent of US$2M. Capacity can be expected to grow exponentially with the number of nodes and payment channels.&nbsp;<\/p>\n\n\n\n<p>The below graphic from Bitcoin Core developer, <a rel=\"noreferrer noopener nofollow\" href=\"https:\/\/twitter.com\/lopp\" target=\"_blank\">Jameson Lopp<\/a>, which displays the number of nodes in the LN at inception and today, sums up this exciting development: <\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"2016\" height=\"776\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f97f34c7b909_Screen-Shot-2019-03-19-at-9.42.30-AM.jpg\" alt=\"\" class=\"wp-image-3649\" srcset=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f97f34c7b909_Screen-Shot-2019-03-19-at-9.42.30-AM.jpg 2016w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f97f34c7b909_Screen-Shot-2019-03-19-at-9.42.30-AM-768x296.jpg 768w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f97f34c7b909_Screen-Shot-2019-03-19-at-9.42.30-AM-1536x591.jpg 1536w\" sizes=\"(max-width: 2016px) 100vw, 2016px\" \/><\/figure>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Volatility:&nbsp;<\/strong><\/h4>\n\n\n\n<p>If the first major hurdle to mass adoption of crypto is scalability, the next most important roadblock is volatility.&nbsp;<\/p>\n\n\n\n<p>In order for cryptoassets to be usable as a medium of exchange large price fluctuations need to be managed.&nbsp;<\/p>\n\n\n\n<p>Simply put, if I buy a pizza for $10 today, I want to know that the pizza won’t have cost me $100 tomorrow. Otherwise, I will have wasted serious purchasing power by spending that currency today. If the price of a currency is highly volatile, it will not be used.&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Enter Stablecoins&nbsp;<\/strong><\/h4>\n\n\n\n<p>The concept of a stablecoin is not new. The original stablecoin,&nbsp;<a href=\"https:\/\/cointelegraph.com\/tags\/tether\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Tether<\/a>&nbsp;(USDT), was&nbsp;<a href=\"https:\/\/www.coindesk.com\/brock-pierce-announces-dollar-backed-cryptocurrency-realcoin\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">launched in 2014<\/a>&nbsp;by Brock Pierce, Reeve Collins and Craig Sellars.&nbsp;<\/p>\n\n\n\n<p>Tether was the first fully fiat collateralized stablecoin, meaning each Tether was collateralized by US$1.00 held in reserves at Tether’s partner bank. Because of this, crypto investors could convert their Bitcoin and other cryptoassets into a stable asset without utilizing previously underdeveloped, limited, and costly crypto-fiat on and off ramps.&nbsp;<\/p>\n\n\n\n<p>As a result, Tether grew to become the largest stablecoin by market capitalization with nearly $3Bn worth of USDT in circulation at its peak. However, Tether has had a troubled history and many in the industry believe that it could be an outright scam. These doubters believe that the cash held in Tether’s reserve is far less than the amount represented by the USDT in circulation. Ironically, a recent&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2018-12-18\/crypto-mystery-clues-suggest-tether-has-the-billions-it-promised\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Bloomberg report<\/a>&nbsp;issued in December 2018, confirmed that Tether likely does have the reserves that it claims.&nbsp;<\/p>\n\n\n\n<p>These suspicions culminated in a scathing&nbsp;<a href=\"https:\/\/www.nytimes.com\/2017\/11\/21\/technology\/bitcoin-bitfinex-tether.html\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">New York Times report<\/a>&nbsp;at the end of 2017, which opened the door for many new stablecoin entrants in 2018. There are currently over 80 stablecoins in development and&nbsp;<a href=\"https:\/\/stablecoinindex.com\/projects\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Stablecoin Index<\/a>&nbsp;tracks all of the projects in the market.&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Asset-Backed Stablecoins&nbsp;<\/strong><\/h4>\n\n\n\n<p>The simplest solution to the volatility problem is to issue an asset backed cryptoasset that is secured at least 1:1 by some form of collateral. In most instances, the collateral backing the stablecoin is fiat currency like the US dollar. These fiat-collateralized stablecoins offer a similar solution to that of Tether.&nbsp;<\/p>\n\n\n\n<p>In 2018, a number of new fiat-collateralized stablecoins were launched to supplant Tether. By year end, the top four stable coins by market cap (excluding Tether) were:&nbsp;<\/p>\n\n\n\n<ol><li><a href=\"https:\/\/www.centre.io\/usdc\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">USDC<\/a>&nbsp;&#8211; Created via a joint venture between two of the largest players in crypto Coinbase and Goldman Sachs-owned Circle, USDC is an ERC-20 based token. Each USDC is backed 1:1 by a US dollar. With strong corporate support, USDC seems poised to be the clear leader in the stablecoin race. It is already listed on most major exchanges (including Binance, OKex) and available in most crypto wallets (Coinbase, Ledger, BitGo)&nbsp;<br>‍<\/li><li><a href=\"https:\/\/gemini.com\/dollar\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Gemini Dollar&nbsp;<\/a>(GUSD) &#8211; Also built as an ERC-20 token, Gemini dollar is issued by the Winklevoss-twin owned exchange, Gemini. Dollars are held in State Street Bank &amp; Trust Co. and audited regularly by&nbsp;<a href=\"https:\/\/www.bpmcpa.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">BPM LLP<\/a>. Each GUSD is backed 1:1 by a US dollar. In order to bootstrap adoption,&nbsp;<a href=\"https:\/\/www.coindesk.com\/stablecoin-crypto-price-war-paxos-gemini\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Gemini recently offered crypto traders 1 GUSD for $0.98<\/a>. In response, traders simply arbitraged the GUSD for PAX on a leading Chinese exchange, Huobi, which now holds a large percentage of the GUSD supply.&nbsp;<br>‍<\/li><li><a href=\"https:\/\/www.paxos.com\/standard\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Paxos Standard Token<\/a>&nbsp;(PAX) &#8211; Just as with GUSD and USDC, one PAX equals 1 US dollar. Each PAX is issued by a NY State regulated Trust company, Paxos. Paxos is currently listed on over 50 exchanges.&nbsp;<br>‍<\/li><li><a href=\"https:\/\/www.trusttoken.com\/terms-of-use\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">TrueUSD<\/a>&nbsp;(TUSD) &#8211; the first new entrant after Tether and second by market capitalization, TrueUSD had a head start on its competitors. TUSD’s assets are also held in an escrow account and directly exchangeable into USD via the Trust firm’s bank. The creator of TUSD, Trust Token never takes custody of the dollars themselves and markets itself as exchange agnostic, whereas GUSD and USDC are issued by exchanges themselves. Trust Token, intends to launch a number of other asset-backed tokens in 2019.&nbsp;<\/li><\/ol>\n\n\n\n<p>The fiat-collateralized stablecoin race will likely be a winner-take-all market. They are not significantly differentiated and will compete on the following:&nbsp;<\/p>\n\n\n\n<ol><li>Distribution (exchange listing, dApp adoption, wallet compatibility, other payment channels)&nbsp;<\/li><li>KYC\/AML requirements and compliance with regulation (USDC the most strict, followed by Gemini then PAX, and TUSD)<\/li><li>The integrity of the token issuer, auditor, and custodian&nbsp;<\/li><li>Interest payments and network fees&nbsp;<\/li><\/ol>\n\n\n\n<p>Fiat-collateralized stablecoins offer one solution to the volatility problem, but they are challenged because they are not decentralized, are susceptible (and even designed) for censorship, and exist at the whim of regulators.&nbsp;<\/p>\n\n\n\n<p>Thus other stablecoin solutions have been launched including&nbsp;<strong>algorithmic stablecoins&nbsp;<\/strong>like (Basis, ndau, and Saga), other&nbsp;<strong>asset-backed stablecoins&nbsp;<\/strong>like&nbsp;<a href=\"https:\/\/digix.global\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Digix<\/a>&nbsp;(backed by gold) and Synthetix (formerly Haven, backed by multiple currencies), and&nbsp;<strong>crypto-collateralized stablecoins&nbsp;<\/strong>like MakerDAO’s DAI (currently backed by ETH).&nbsp;<\/p>\n\n\n\n<h4>‍<\/h4>\n\n\n\n<h4><strong>Algorithmic Stablecoins&nbsp;<\/strong><\/h4>\n\n\n\n<p>We won’t dive too deep into algorithmic stablecoins in this letter except to say they are widely untested and have major potential flaws.&nbsp;<\/p>\n\n\n\n<p>Recently, the leading algorithmic stablecoin,&nbsp;<a href=\"https:\/\/wavegp.com\/media\/wave-financial-year-end-market-update#\">Basis<\/a>, which raised $133m from top VCs Bain &amp; Lightspeed Ventures in April 2018, issued a letter stating that it will wind down and return all remaining funds to investors.&nbsp;<\/p>\n\n\n\n<p>Other algorithmic stablecoins have experienced delayed launches (<a href=\"https:\/\/www.saga.org\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Saga<\/a>&nbsp;&amp;&nbsp;<a href=\"https:\/\/ndau.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">ndau<\/a>) or have moved to a hybrid model that will start with 1:1 fiat-collateralization (<a href=\"https:\/\/www.carbon.money\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Carbon<\/a>,&nbsp;<a href=\"https:\/\/www.ccn.com\/coinbase-billionaire-peter-thiel-back-new-reserve-stablecoin\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Reserve<\/a>).&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Fully Decentralized Stablecoin: MakerDAO DAI&nbsp;<\/strong><\/h4>\n\n\n\n<p>Two pillars of crypto are decentralization and censorship resistance. While fiat-collateralized stablecoins solve the problem of volatility, they do so by trading off these two features. Fiat-collateralized stablecoins, with their implicit restrictions, may only serve to perpetuate the financial exclusion of the bottom 2 billion global citizens who don’t have access to simple financial services like bank accounts.&nbsp;<\/p>\n\n\n\n<p><a href=\"https:\/\/medium.com\/cryptolinks\/maker-for-dummies-a-plain-english-explanation-of-the-dai-stablecoin-e4481d79b90\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">MakerDAO’s DAI&nbsp;<\/a>is a smart-contract based stablecoin that is a fully decentralized and lives entirely on the blockchain unmediated by the legal system or a trusted third party solution. In September 2018, Andreessen Horowitz’s crypto fund, a16z crypto,&nbsp;<a href=\"https:\/\/medium.com\/makerdao\/a16z-crypto-purchases-6-of-mkr-backing-stablecoin-vanguard-makerdao-ff410a692393\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">invested $15M into MakerDAO<\/a>.&nbsp;<\/p>\n\n\n\n<p>Like fiat-collateralized stablecoins, the goal of Maker is for its stablecoin DAI to stay pegged to US$1.00 in value. New DAI is minted when users open a collateralized debt position (“CDP”) on the Ethereum network. To open a CDP, one simply needs to login to Maker’s CDP portal and stake ETH as collateral to the smart contract. In the case of DAI, you need to stake 150% more ETH as collateral than the amount of DAI that you withdraw (ie: $150 worth of ETH for $100 worth of DAI). If the dollar value of your ETH collateral drops below this 150% threshold, then the CDP is wiped and a portion of the ETH collateral is claimed.&nbsp;<\/p>\n\n\n\n<p>As of writing there is currently $69M DAI in circulation with nearly 1.9M locked ETH across 5,700 CDPs. This represents over 1.5% of the total ETH in circulation..&nbsp;<\/p>\n\n\n\n<p><em>Notably, DAI has maintained its $1.00 peg in spite of a +80% decline in the price of ETH over 2018.&nbsp;<\/em><\/p>\n\n\n\n<p>DAI has scaling challenges of its own, as it would need users to stake all of the ETH in circulation at current ETH prices in order to build tens of billions worth of DAI.&nbsp;<\/p>\n\n\n\n<p>We believe this is why Maker is launching multi-collateral DAI in 2019. It may offer users the ability to lock other forms of collateral besides ETH. Because multi-collateral DAI may include fiat-collateralized stablecoins like USDC, GUSD, and TUSD, this decentralized stablecoin may become a “meta” asset-backed stablecoin that is decentralized and censorship-resistant. Through its multicollateral solution, it is possible that DAI could hack its way to the leading stablecoin position.&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>In Sum&nbsp;<\/strong><\/h4>\n\n\n\n<p>While 2018 saw a massive decline in cryptoasset prices, fundamental improvements to scalability and volatility continued to propel the industry forward. That said, there still remain many challenges that need to be addressed before mass adoption of crypto. These include continued growth in scalability, regulatory compliance, interoperability, institutional grade custody, and UX\/UI (broadly user experience).&nbsp;<\/p>\n\n\n\n<p>We expect that newly created ecosystem development and exchange funds will lead investment into these and other areas in 2019.&nbsp;<\/p>\n\n\n\n<h3><strong>III. Fundamental Predictions for 2019&nbsp;<\/strong><\/h3>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Further Unwinding the Legal\/Regulatory Hangover&nbsp;<\/strong><\/h4>\n\n\n\n<p>We believe the 4th quarter of 2018 marked the beginning of&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/sec-imposes-its-first-civil-penalties-for-two-icos-violating-security-registration-laws\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">actions taken by the SEC&nbsp;<\/a>against companies that raised capital via initial coin offerings. Historically, the SEC attacks the “low hanging fruit” first in order to build a series of precedent wins before chasing more challenging cases.&nbsp;<\/p>\n\n\n\n<p>It is likely that we will see further SEC action in 2019 including some of the larger (possibly a top 25 market cap) cryptoassets.&nbsp;<\/p>\n\n\n\n<p>Even the clear winners of 2018, the exchanges, are now targets of SEC scrutiny. At the end of December, Korean regulators indicted the top executives of Korea’s largest exchange, UpBit, for&nbsp;<a href=\"https:\/\/cryptoslate.com\/upbit-crypto-exchange-executives-indicted-for-market-manipulation\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">fraud and market manipulation<\/a>. A December 2018 report issued by the&nbsp;<a href=\"https:\/\/www.blockchaintransparency.org\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Blockchain Transparency Institute&nbsp;<\/a>noted that the volume at most of the top 25 crypto exchanges was faked by wash trading. We expect further regulatory actions against major exchanges as more unsavory practices are brought to light.&nbsp;<\/p>\n\n\n\n<p>In addition to regulatory action,&nbsp;<strong>we&nbsp;<em>expect to see more civil lawsuits&nbsp;<\/em><\/strong>against crypto issuers whose investors were fundamentally misled and misinformed. These civil suits could be used as a tool of “activist investors” to force certain projects to refund the remaining capital in their treasuries.&nbsp;<\/p>\n\n\n\n<p>We believe that the overhang of regulatory actions against issuers may continue to create downward pressure on prices in 2019. While regulatory actions could have a negative impact on prices, they bring transparency and clear industry standards in the long term, so we view them as a net positive for the space.&nbsp;<\/p>\n\n\n\n<p>A few other positive regulatory advancements include:&nbsp;<\/p>\n\n\n\n<ol><li>The release of<a href=\"https:\/\/www.swissinfo.ch\/eng\/dlt-report_switzerland-sets-legal-foundations-for-blockchain-industry\/44617654\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;comprehensive legal guidelines<\/a>&nbsp;by the Swiss Financial Authority, FINMA, in early December 2018&nbsp;<br>‍<\/li><li>VanEck launched the first comprehensive index tracking&nbsp;<a href=\"https:\/\/bitcoinist.com\/vaneck-mvis-bitcoin-otc-index-binance\/\" rel=\"nofollow noopener\" target=\"_blank\">Bitcoin OTC prices<\/a>&nbsp;in November 2018, which enhances the potential for an SEC-approved Bitcoin spot ETF in 2019. This outcome would likely lead to meaningful optimism and unexpected price appreciation&nbsp;<\/li><\/ol>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>The Rise of the Security Token Industry&nbsp;<\/strong><\/h4>\n\n\n\n<p>One reaction to the increased regulatory scrutiny has been a pivot from the “utility token” thesis to the “security token” thesis.&nbsp;<\/p>\n\n\n\n<p>We divide security tokens into two categories:&nbsp;<\/p>\n\n\n\n<ol><li><strong>Asset-backed security tokens&nbsp;<\/strong>&#8211; these include the digitization of real-world assets (ie:&nbsp;<a href=\"https:\/\/siliconangle.com\/2018\/11\/28\/harbor-launches-20m-tokenized-investments-student-residence-blockchain-platform\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Harbor’s $20M tokenized REIT offering&nbsp;<\/a>or&nbsp;<a href=\"https:\/\/www.cryptonewsz.com\/dx-exchange-launches-trading-of-nasdaq-listed-companies\/5159\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">DX.Exchange recent launch of Nasdaq-traded equities<\/a>)&nbsp;<br>‍<\/li><li><strong>Native digital security tokens &#8211;&nbsp;<\/strong>digital assets issued via a fully compliant sale of securities (ie:&nbsp;<a href=\"https:\/\/www.propsproject.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">YouNow Props<\/a>&nbsp;issued on a platform like&nbsp;<a href=\"https:\/\/republic.co\/crypto\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Republic<\/a>&nbsp;or portfolio company&nbsp;<a href=\"https:\/\/www.phunware.com\/press-releases\/phuncoin-token-rights-sale\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Phunware Phuncoin<\/a>&nbsp;issued via&nbsp;<a href=\"https:\/\/coinlist.co\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">CoinList<\/a>)&nbsp;<\/li><\/ol>\n\n\n\n<p>We make this distinction because we are still in the very early stages for the first category, which may ultimately have a much larger addressable market than that of category 2.&nbsp;<\/p>\n\n\n\n<p>In Q4 2018 we saw nascent security token space grow. A few security token issuance platforms launched their first offerings including&nbsp;<a href=\"https:\/\/www.securitize.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Securitize<\/a>, who launched Blockchain Capital (BCAP), SpiceVC, 22x, and&nbsp;<a href=\"http:\/\/lottery.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Lottery.com<\/a>.&nbsp;<\/p>\n\n\n\n<p>The first regulated security token exchange,&nbsp;<a href=\"https:\/\/www.openfinance.io\/trade.html\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">OpenFinance Network<\/a>, went live in November 2018. OpenFinance Network has now listed both SpiceVC and BCAP. Volumes are muted (only a few hundred dollars trade per day).&nbsp;<\/p>\n\n\n\n<p>We expect that 2019 will be an active year for security token industry service providers like issuance platforms, underwriters, and custody solutions as more issuers race to launch a security token. However, though we are excited by the long term trajectory of the sector, early signs show that the hype may be starting to exceed the reality.&nbsp;<\/p>\n\n\n\n<p>In the last few months, we have witnessed the launch of dozens of new security token issuance platforms intending to compete with well-capitalized incumbents. In addition, a number of former ICO investors\/advisors are pivoting into the security token space.&nbsp;<\/p>\n\n\n\n<p>The product-market fit for security tokens remains unclear in the short term because we do not know who will be the major buyers of these products. We expect existing financial institutions to be hesitant to invest in an unproven asset class with more complexity than traditional investments and crypto investors are mostly out of capital or seeking venture-like returns.&nbsp;<\/p>\n\n\n\n<p>Our research shows that launching a security token can cost hundreds of thousands in upfront legal and administrative costs. After launch, the issuer is still responsible for soliciting investment and may need to hire a third party broker-dealer. There are no shortcuts and capital raising can often be a time and capital consuming process.&nbsp;<\/p>\n\n\n\n<p>Without clear buyers and few institutions entering the space in 2019, we expect secondary exchange volumes to remain muted.&nbsp;<\/p>\n\n\n\n<p>On a positive note for the industry, major players have entered the security token space. In addition, we expect Coinbase to launch trading of security tokens in 2019. This may accelerate market adoption but negatively impact other STO exchange valuations.&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>More Scalable Smart Contract Platforms&nbsp;<\/strong><\/h4>\n\n\n\n<p>2018 marked the beginning of the smart contract platform wars as a number of “Ethereum killers” raised tens of millions (in some cases hundreds of millions) of capital via ICOs on the promise of solving the scalability trilemma. A few of these platforms launched in 2018 (per above), but a number are expected to go live in the first half of 2019.&nbsp;<\/p>\n\n\n\n<ol><li>If one of these networks successfully launches with its estimated level of scalability, we believe it could pose a serious threat to Ethereum’s dominance as a smart contract platform. New smart contract platforms launching in 2019 with the largest treasuries include:&nbsp;<a href=\"https:\/\/www.algorand.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Algorand<\/a>&nbsp;plans to launch its mainnet at the end of Q1 2019. Marketed as “the blockchain for business”, the platform raised a fresh $62M in October 2018 from leading VCs like Union Square Ventures. Algorand’s testnet is live and the team expects the mainnet will scale to thousands of transactions per second.<br>‍<\/li><li><a href=\"https:\/\/hackernoon.com\/zilliqa-the-holy-grail-of-scalability-a761c246e83f\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Zilliqa<\/a>&nbsp;had planned its much anticipated mainnet launch for 2018, but this has since been pushed back to early 2019. Zilliqa uses a sharding solution similar to that being built on Ethereum. The Zilliqa testnet can currently process 2,500 tps and it is anticipated to process more than 10,000 tps.<br>‍<\/li><li><a href=\"https:\/\/dfinity.org\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Dfinity<\/a>&nbsp;Backed by Polychain Capital and a16z, Dfinity raised $102M in August 2018. The company is building a “new world computer” similar to Ethereum but with purportedly improved performance. Dfinity is known for its “Liquid Democracy” on chain governance structure and Threshold Relay consensus mechanism. Ethereum code can run on Dfinity. Like many other next-generation smart contract platforms, Dfinity has&nbsp;<a href=\"https:\/\/medium.com\/dfinity\/dfinity-status-update-dec-2018-a6e516514531\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">pushed back its timeline<\/a>&nbsp;and expects to launch its testnet at the end of Q2 2019. This means it is likely that Dfinity mainnet will not go live until 2020, though it is possible that it launches in Q4 2019.<br>‍<\/li><li><a href=\"https:\/\/www.hedera.com\/\" rel=\"nofollow noopener\" target=\"_blank\">Hedera Hashgraph<\/a>&nbsp;leverages a Distributed Acyclic Graph (DAG) protocol to process transactions faster. The network will include 39 validators who will be members of the “Hashgraph Council”. Similar to GoChain’s PoR, Hashgraph council members will include high-quality enterprises that have meaningful reputations at stake. Hashgraph’s mainnet went live in August 2018, though it will not be made publicly available until the end of Q1 2019. Hedera raised $100m in 2018 at as high as a $6Bn valuation. Hashgraph executives claim that the network will be able to scale to hundreds of thousands of transactions per second.&nbsp;<br>‍<\/li><li><a href=\"https:\/\/solana.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Solana<\/a>&nbsp;another next-generation smart contract platform, Solana raised around $28M in mid-2018. The company claims its network can process 710,000 transactions per second without sharding by using its Proof of History consensus algorithm. The company expects to launch a mainnet at the end of Q1 2019.&nbsp;<\/li><\/ol>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Interoperability&nbsp;<\/strong><\/h4>\n\n\n\n<p>As the number of smart contract platforms and cryptocurrencies for different use cases expands in 2019 and beyond we believe that the need for those networks to communicate with each other will increase. In the future, a blockchain for decentralized file storing like&nbsp;<a href=\"https:\/\/filecoin.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Filecoin<\/a>&nbsp;may need to communicate with a decentralized computing protocol like&nbsp;<a href=\"https:\/\/golem.network\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Golem<\/a>&nbsp;&nbsp;or&nbsp;<a href=\"https:\/\/hypernetwork.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Hypernet<\/a>&nbsp;. In the current state of the crypto industry, this cross chain communication or “interoperability” is only possible through centralized hubs like exchanges that run nodes and have built infrastructure for independent blockchains. The protocol(s) that is (are) able to build a product for trustless interoperability between existing and future cryptoassets may ultimately capture significant value.<\/p>\n\n\n\n<p>We are monitoring the two largest interoperability protocols that have been leading the development of trustless interoperability:&nbsp;<a href=\"https:\/\/cosmos.network\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Cosmos<\/a>&nbsp;&nbsp;&amp;&nbsp;<a href=\"https:\/\/polkadot.network\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Polkadot<\/a>&nbsp;. Each of these protocols has new product release scheduled in 2019.<\/p>\n\n\n\n<p>Both Cosmos and Polkadot are based upon a hub &amp; spoke model in which there is one central hub that connects to many blockchains allowing them to communicate with and transfer value between one another. One drawback of these solutions is that they currently can only work via sidechains and thus are limited to proof of stake protocols. Therefore neither protocol in its current form will allow for interoperability with Bitcoin .<\/p>\n\n\n\n<p>This may represent an advantage to certain smart contract platforms that are using or plan to utilize proof of stake. It is possible that interoperability can lead to one underlying protocol token OR the interoperability protocol token (like Polkadot’s DOTS) itself accruing most of the value in a decentralized future.<\/p>\n\n\n\n<p>For a more in-depth comparison of Cosmos &amp; Polkadot, you can read here .<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4><strong>Ecosystem Development &amp; Crypto Exchange Funds will Drive Growth in 2019&nbsp;<\/strong><\/h4>\n\n\n\n<p>Although prices declined by over 90% for many cryptoassets in 2018, we believe there remains a substantial amount of investment capital available to finance industry-leading businesses in 2019.&nbsp;<\/p>\n\n\n\n<p>In 2017 and 2018, we saw the rapid growth in the number of crypto-focused investment funds. At the market’s peak, there were over 400 registered funds, the majority of which had under $25M assets under management. Given the marked decline in prices in 2018, we have already begun to see a&nbsp;<a href=\"https:\/\/www.marketwatch.com\/story\/how-bitcoins-meltdown-is-ravaging-hedge-funds-2018-11-21\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">number of funds unwinding<\/a>; even some of the larger funds in the space like&nbsp;<a href=\"https:\/\/bitcoinexchangeguide.com\/polychain-capital-crypto-hedge-fund-fires-ryan-zurrer-after-firms-subpar-2018-results\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Polychain Capital were affected<\/a>. We expect to see&nbsp;<a href=\"https:\/\/www.ccn.com\/crypto-hedge-funds-are-going-to-start-shutting-down-morgan-creek\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">further fund closures in 2019<\/a>&nbsp;as funds miss their high water mark in the face of a prolonged bear market.&nbsp;<\/p>\n\n\n\n<p>Though fund closures may be a theme in 2019, there still remain a few dozen well-capitalized crypto funds, like Andreessen Horowitz’s a16z crypto (with nearly $300M AUM) and Paradigm (an additional&nbsp;<a href=\"https:\/\/www.coindesk.com\/yale-university-said-to-invest-in-400-million-paradigm-crypto-fund\" rel=\"nofollow noopener\" target=\"_blank\">$400M<\/a>). In addition, we expect that newly created protocol ecosystem development funds and crypto exchange venture funds will drive the majority of financing and innovation in 2019.&nbsp;<\/p>\n\n\n\n<p>In 2018, over 25 protocols launched their own funds and a few more are expected to come online in 2019. A sample of protocols that launched funds includes Ripple (+$100m), DFINITY ($40m), IOTA ($7.7M), NEO ($350M at peak), and Decred ($11M treasury managed by the community via&nbsp;<a href=\"https:\/\/proposals.decred.org\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Politeia<\/a>). A number of other leading protocols like 0x, Lisk, Stellar, and Ontology have followed.&nbsp;<\/p>\n\n\n\n<p>The largest of these “ecosystem development funds” is led by the EOS protocol, which partnered with 5 venture capital firms to deploy $600M into EOS-related infrastructure and dApps. This is at least 10x larger than the next largest publicly available ecosystem development fund. This is possibly a competitive advantage for EOS in 2019. Most recently, EOS venture partner Galaxy Digital&nbsp;<a href=\"https:\/\/bitcoinexchangeguide.com\/mythical-games-secures-16-million-led-by-galaxy-digital-and-javelin-to-create-new-era-of-player-owned-games\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">led a $15M investment round&nbsp;<\/a>into blockchain gaming company, Mythical Games.&nbsp;<\/p>\n\n\n\n<p>In addition to these ecosystem development funds, a number of exchanges and wallets launched their own funds in 2018. In April, the largest crypto exchange in the US,&nbsp;<a href=\"https:\/\/blog.coinbase.com\/introducing-coinbase-ventures-c67865a1d2fe\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Coinbase, announced its venture fund<\/a>, Coinbase Ventures. In addition, leading crypto derivatives fund, BitMex launched&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/08\/bitmex-joins-its-rivals-in-launching-its-own-vc-arm\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">BitMex ventures in November<\/a>. A number of other leading Asian exchanges launched funds including&nbsp;<a href=\"https:\/\/labs.binance.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Binance Labs&nbsp;<\/a>and Huobi Capital.&nbsp;<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h3><strong>V. Our Reading \/ Listening List&nbsp;<\/strong><\/h3>\n\n\n\n<p>In case this letter was not enough to wet your crypto appetite, we’ve included a few links below to highlight what we’ve been tracking in Q42018 (there’s more where this came from, so if you’re feeling ambitious, don’t hesitate to email us for further links).&nbsp;<\/p>\n\n\n\n<ol><li><a href=\"https:\/\/medium.com\/@nlw\/the-most-essential-crypto-long-reads-2018-6ec08b08d86\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Nathaniel Whitmore \/ Longreads Best of 2018&nbsp;<\/a><\/li><li><a href=\"https:\/\/medium.com\/@arjunblj\/crypto-theses-for-2019-dd20cb7f9895\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Crypto Theses for 2019 By Arjun Balaji&nbsp;<\/a><\/li><li><a href=\"https:\/\/multicoin.capital\/2018\/12\/20\/questions-from-the-crypto-idea-maze\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Questions from the Crypto Idea Maze by Kyle Samani of Multicoin Capital&nbsp;<\/a><\/li><li><a href=\"https:\/\/medium.com\/@twobitidiot\/96-theses-for-crypto-in-2019-1498fe1a14e?_branch_match_id=521048096027354408\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">96 Theses for Crypto in 201<\/a>9 by Ryan Selkis of Messari&nbsp;<\/li><li><a href=\"https:\/\/a16z.com\/2018\/12\/20\/stablecoins-why-matter-what-how-daos-maker\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">A16z all about Stablecoins Podcast&nbsp;<\/a><\/li><li><a href=\"https:\/\/www.youtube.com\/watch?v=svD6cCv-Nes\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Metastable Chat on Stablecoins&nbsp;<\/a><\/li><\/ol>\n\n\n\n<p>‍<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<p><strong><em>Mr. Weinstein is a Principal at Wave Financial. The views expressed in this Market Update accurately reflect Mr. Weinstein’s personal views about the subject companies, platforms, issuers, security and non-security investments (“investments”) and not those of Wave Financial. Mr. Weinstein’s comments are not intended to be construed as recommendations or an offer to buy, sell or hold any investment. Mr. Weinstein&#8217;s compensation is not directly or indirectly related to the specific recommendations or views contained in the research report.<\/em><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>2018 was a challenging year for cryptoasset prices and in Q4 we witnessed the acceleration of market declines, followed finally by a rally the last week of December. DISCLAIMER:&nbsp; This&#8230;<\/p>\n","protected":false},"author":6,"featured_media":3652,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[9],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3646"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3646"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3646\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3652"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3646"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3646"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3646"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3646"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}