{"id":3653,"date":"2019-03-19T21:45:11","date_gmt":"2019-03-19T21:45:11","guid":{"rendered":"https:\/\/wavegp.com\/?p=3653"},"modified":"2020-11-22T21:45:38","modified_gmt":"2020-11-22T21:45:38","slug":"your-blockchain-privacy-primer","status":"publish","type":"post","link":"https:\/\/wavegp.com\/your-blockchain-privacy-primer\/","title":{"rendered":"Your Blockchain Privacy Primer"},"content":{"rendered":"\n<p>Just like Zuck, we believe that privacy is a crucial element to the proper functioning of the future of the Internet. That’s why this month we will be going deep on privacy coins.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"1200\" height=\"677\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f984afc7b910_1UzEuqD-9r_Co9G7_XD-MfA.jpg\" alt=\"\" class=\"wp-image-3655\" srcset=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f984afc7b910_1UzEuqD-9r_Co9G7_XD-MfA.jpg 1200w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f984afc7b910_1UzEuqD-9r_Co9G7_XD-MfA-768x433.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><figcaption>Credit: AFP, Privacy Coin Websites<\/figcaption><\/figure>\n\n\n\n<h3><strong>The Scalability Race<\/strong><\/h3>\n\n\n\n<p>It<strong>&nbsp;<\/strong>is well known in the crypto market that scalability remains an unresolved roadblock to mass market adoption. Bitcoin and Ethereum, the two largest cryptoassets by market capitalization, max at around&nbsp;<a href=\"https:\/\/www.blockchain.com\/charts\/n-transactions?timespan=all&amp;showDataPoints=true\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">7 transactions per second (tps)<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/etherscan.io\/chart\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">15 tps<\/a>, respectively. To put this into context, individuals often cite the Visa network’s ability to&nbsp;<a href=\"https:\/\/usa.visa.com\/run-your-business\/small-business-tools\/retail.html\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">process over 24,000 tps<\/a>&nbsp;as a benchmark.&nbsp;<a href=\"https:\/\/www.cryptokitties.co\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">CryptoKitties<\/a>, a decentralized app where you can collect and trade digital kitties, nearly crashed Ethereum at the end of 2017 because of the congestion in processing trades. Without scalability, blockchains cannot function.<\/p>\n\n\n\n<p>So what’s preventing blockchains from becoming as scalable as Visa’s network? Their decentralized nature.<\/p>\n\n\n\n<p>Bitcoin and Ethereum are trustless because there are thousands of independent<a href=\"https:\/\/en.bitcoin.it\/wiki\/Full_node\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;nodes<\/a>&nbsp;across the world, run by independent companies and individuals, that maintain the security of the network. The more nodes there are, the more difficult it is for one node\/person\/nation\/enterprise to attack the network. However, the more nodes there are, the more servers decisions are processed through, and thus the longer it takes to agree on a decision. A direct democracy is a good analogy here — how long would it take to pass a bill if every American citizen had to vote on every bill proposed as a new law?<\/p>\n\n\n\n<p><a href=\"https:\/\/en.wikipedia.org\/wiki\/Vitalik_Buterin\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Vitalik Buterin<\/a>, co-founder of Ethereum, has coined this major problem the “scalability trilemma”: how can blockchains be scalable, secure, AND decentralized?¹ Solving this trilemma remains the foremost objective in the industry today. If we cannot find solutions, adoption will never take off, and the complex challenges our industry addresses like non-sovereign money, individual data ownership, or banking the unbanked, may never be solved.<\/p>\n\n\n\n<p>For now, there are a few core ideas² behind solving the scalability trilemma:<\/p>\n\n\n\n<ol><li>Replace the “direct democracy” approach blockchains use for governance with a representative democracy. The independent nodes all over the world elect a subset of nodes to manage the network. This way, decisions only have to pass through the delegates and can be made much faster. Three of the largest blockchains by market cap,&nbsp;<a href=\"https:\/\/eos.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">EOS<\/a>&nbsp;(#5),&nbsp;<a href=\"https:\/\/tron.network\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Tron<\/a>&nbsp;(#10), and&nbsp;<a href=\"https:\/\/tezos.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Tezos<\/a>&nbsp;(#22) use delegated governance. Critics of delegated blockchains argue that with fewer machines, the network will become less secure, and furthermore, these “elections” are subject to manipulation, increasing the potential for corruption.<\/li><li>Use a smaller number of trusted nodes run by corporations that have reputation at stake<\/li><li>Maintain the fully decentralized (direct democracy) approach; instead, rely on technological improvements to increase the efficiency of the communication between the nodes in both time and space.<\/li><li>Since not all transactions need such a high level of security, we can move\/validate those with lower security requirements off-chain or to side-chains.<\/li><\/ol>\n\n\n\n<p>The last two options are complex. There are dozens of companies that are trying to solve this at the protocol layer using technology like sharding or complex calculus. There are many others tackling scalability via off-chain and side-chain solutions such as payment channels (<a href=\"https:\/\/lightning.network\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">lightning network<\/a>,<a href=\"https:\/\/raiden.network\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;raiden<\/a>) and other state channels,<a href=\"https:\/\/plasma.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;plasma<\/a>. None of these are yet successfully operational at scale. You can time stamp the industry as being in the midst of a “scalability race.”<\/p>\n\n\n\n<h3><strong>But what’s this have to do with Privacy?<\/strong><\/h3>\n\n\n\n<p>Many crypto enthusiasts were originally attracted to Bitcoin because they believed it was anonymous. This is not true; contrary to popular belief, Bitcoin is far from anonymous. While real-world identities aren’t revealed, when users engage in a Bitcoin transaction, their&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Public-key_cryptography\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">public keys<\/a>&nbsp;(public address), and transaction amounts are broadcasted to the public ledger. Anyone who has obtained a record of the blockchain over time can easily visit these users’ wallet addresses to see how much Bitcoin they own.³ ⁴ Furthermore, once someone transacts with a counterparty he\/she learns one of the counterparty’s public keys, and thereafter can trace the holdings tied to that public key. In fact, law enforcement has previously used end-users’ misperception of Bitcoin’s transparency to its advantage. Kathryn Haun, who is a General Partner at Andreessen Horowitz, previously led a<a href=\"https:\/\/www.youtube.com\/watch?v=507wn9VcSAE\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Ted Talk<\/a>&nbsp;on how the US Government used full-nodes on Bitcoin to trace $13.4M to&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Ross_Ulbricht\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Ross Ulbricht<\/a>, the mastermind behind the first modern darknet market, Silk Road.<\/p>\n\n\n\n<p>Nevertheless, there are multiple blockchains that have been engineered to be private. The major ones, based on their technical proficiency⁵ and the market cap of their associated cryptocurrencies, are<a href=\"https:\/\/ww.getmonero.org\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Monero<\/a>&nbsp;(#13) and<a href=\"https:\/\/z.cash\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Zcash<\/a>&nbsp;(#21). In addition, two new privacy coins,<a href=\"https:\/\/grin-tech.org\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Grin<\/a>&nbsp;and<a href=\"https:\/\/www.beam.mw\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Beam<\/a>, launched in January 2019 and are generating a lot of recent buzz in the industry. Privacy research continues to be at the forefront of the crypto space, as we’ve seen with the most recent<a href=\"https:\/\/crypto.stanford.edu\/~buenz\/papers\/zether.pdf\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Zether whitepaper<\/a>, published in late February 2019 as a collaboration between the senior research teams in applied cryptography from Stanford University and Visa.<\/p>\n\n\n\n<p>The purpose of these blockchains is self-explanatory: you can buy\/sell\/trade value and record the transaction on the blockchain, anonymously. Many view privacy coins as technology that supports the dark web; however, privacy is important for all users if crypto payments are to become mainstream — do you want your coworkers to know how much you spent on your girlfriend’s birthday present? These blockchains are working on protocols that fundamentally protect people’s personal information but also can be audited\/examined by law enforcement if nefarious activity is suspected.<\/p>\n\n\n\n<p>So, what does privacy have to do with the scalability race? Think about it this way — when you don’t tell everyone, everything, you theoretically can save time and space. Capitalizing on this interesting axiom, blockchain developers have been working hard to implement “<a href=\"https:\/\/en.wikipedia.org\/wiki\/Zero-knowledge_proof\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">zero-knowledge<\/a>” proofs, which are protocols within the blockchain code that allow independent nodes to verify transactions in a block&nbsp;<em>without identifying the participants involved or the inputs and outputs of the transactions<\/em>. There are ways, using math, to make this possible, which is an amazing and potentially game-changing concept.⁶ Thus privacy blockchains and scalability progress are intimately linked.<\/p>\n\n\n\n<p>Over the next few weeks, we will release analyses on the leading and bleeding edge privacy coins. Today, we start with two of the oldest and largest privacy coins by market capitalization — Monero and Zcash.<\/p>\n\n\n\n<p><strong><em>Disclaimer: These are in-depth reports that will take time to read, but hopefully you will learn a lot. Our recommendation: pick a Sunday afternoon, kick up your feet, and enjoy.<\/em><\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"506\" height=\"508\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f94df9c7b912_1E20VsXU4xUAl6QsnMTCEGA.png\" alt=\"\" class=\"wp-image-3656\" srcset=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f94df9c7b912_1E20VsXU4xUAl6QsnMTCEGA.png 506w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f94df9c7b912_1E20VsXU4xUAl6QsnMTCEGA-150x150.png 150w\" sizes=\"(max-width: 506px) 100vw, 506px\" \/><\/figure>\n\n\n\n<h3><strong>Monero<\/strong><\/h3>\n\n\n\n<p>Monero is the oldest major privacy coin. It was created in<a href=\"https:\/\/medium.com\/@favakrypt\/the-long-fork-story-of-monero-xmr-cryptonote-code-forks-chain-splits-and-network-upgrades-bc5250b4db5\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;2014<\/a>&nbsp;through a<a href=\"https:\/\/www.mycryptopedia.com\/hard-fork-soft-fork-explained\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">hard-fork<\/a>&nbsp;of the Bytecoin protocol. Monero, by design of the protocol, has mandatory anonymization. The protocol relies on three methods to accomplish this (and a fourth on the way):<\/p>\n\n\n\n<h3>1. Ring Signatures<\/h3>\n\n\n\n<p>Ring Signatures protect the anonymity of the sender (from everyone but the receiver). Generally speaking, when a sender initiates a transaction with a recipient in a blockchain network, the sender digitally signs, with its&nbsp;<a href=\"https:\/\/en.bitcoin.it\/wiki\/Private_key\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">private key<\/a>, the value it is sending to prove to the recipient they agree to the value they’re transferring. This is the technical equivalent to signatures we provide on documents today when we’re agreeing to a transaction i.e. signing the check. The receiver uses the&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Public-key_cryptography\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">public key<\/a>&nbsp;of the sender to unpack the digital signature from the sender and confirm, based on what the unpacked digital signature says, that the sender intended to send what was sent. Most blockchains today are<a href=\"https:\/\/en.bitcoin.it\/wiki\/Multisignature\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;multi-signature<\/a>&nbsp;protocols, meaning multiple entities need to sign the transaction on behalf of the sender before it is submitted to the receiver. The receiver then can use the public keys from all of the entities that signed the transaction to decrypt the digital signature and confirm its accuracy.<\/p>\n\n\n\n<p>Ring signatures are a specific type of multi-signature where at least six decoy parties, who each hold the same amount of transacted Monero in their<a href=\"https:\/\/en.wikipedia.org\/wiki\/Cryptocurrency_wallet\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">wallets<\/a>, are randomly selected to sign a transaction in addition to the true sender. You can verify the validity of the transaction by using the public keys of the parties, but you cannot figure out which member sent the funds, and which are decoy co-signers. As Monero’s sponsored<a href=\"https:\/\/www.getmonero.org\/resources\/moneropedia\/ringsignatures.html\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;website<\/a>&nbsp;puts it: “In a ‘ring’ of possible signers, all ring members are equal and valid. There is no way an outside observer can tell which of the possible signers in a signature group belongs to your account.” However, Monero initially had issues guaranteeing anonymity with ring signatures because observers, who had access to the public keys of the random accounts chosen, could explore the transaction history of each of the public keys and eliminate the public keys that were inactive — meaning they hadn’t transacted Monero in a while. As it turned out, the account with either the most recent or most active wallet was usually the sender. [You can read more about this<a href=\"https:\/\/eprint.iacr.org\/2017\/338.pdf\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;here<\/a>]. Additionally, adding at least six decoy signatures to each transaction significantly increases the size of a transaction and ultimately the Monero blockchain. Because<a href=\"https:\/\/bitcoin.org\/en\/full-node\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;full-nodes<\/a>&nbsp;have to scan the entire blockchain to validate transactions, the larger the size of the blockchain, the longer it will take to validate transactions, and the more expensive it will be for nodes to scan the blockchain.⁷<\/p>\n\n\n\n<h3>2. RingCT<\/h3>\n\n\n\n<p>RingCT, adopted by Monero in<a href=\"https:\/\/www.getmonero.org\/resources\/roadmap\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;January 2017<\/a>, anonymizes the amount sent between the sender and receiver. RingCT implements the<a href=\"https:\/\/people.xiph.org\/~greg\/confidential_values.txt\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Confidential Transactions<\/a>&nbsp;algorithm developed by<a href=\"https:\/\/www.weusecoins.com\/gregory-maxwell-bitcoin-expert\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Gregory Maxwell<\/a>, a type of “zero-knowledge” proof which allows for the amount transferred to be completely obfuscated to everyone outside of the sender and receiver. The implementation of Confidential Transactions is a reflection of the progress the industry has made with implementing zero-knowledge proofs in the last two years.<\/p>\n\n\n\n<p>Here’s how the algorithm works: before the transaction is submitted to the blockchain, the sender and receiver each choose their own “blinding factor”. A blinding factor is a randomized string of letters and numbers that is multiplied by the value being transacted to obscure the network from knowing how much is really being transferred. Multiplying the blinding factor by the value being transferred produces a new public key called a “Pedersen Commitment”. The sender and receiver each create their own Pedersen Commitment and subtract the receiver’s Pedersen Commitment from the sender’s (Output — Input). When the transaction is published to the blockchain, validating nodes just see the resulting Pedersen Commitment.<\/p>\n\n\n\n<p>Because the validators do not know the random blinding factors of the sender and receiver, there’s no way for them to unwind the resulting Pedersen Commitment and determine the value transferred. But the validators do not need to unwind anything in order to approve the transaction.&nbsp;<em>Here’s the zero-knowledge proof:<\/em>&nbsp;the only component that differs between the Pedersen Commitment of the sender and that of the receiver is the difference in value of their blinding factors. So as long as the receiver’s Pedersen Commitment — the sender’s Pedersen Commitment equals the difference in their blinding factors, the validating nodes can approve the transaction and post it to the next block.⁸<\/p>\n\n\n\n<p>You may ask — how can the validators be sure the resulting Pedersen Commitment equals the difference in their blinding factors? To test this, before the validators approve the transaction they could have the involved parties redo their transaction with dummy blinding factors supplied by the validators and see if the resulting Pedersen Commitment is what the validators anticipate. Ultimately, there are many ways the protocol can test for the “soundness” of a zero-knowledge proof without breaking with zero-knowledge principle. These are called<a href=\"https:\/\/blockonomi.com\/bullet-proofs\/#Range_Proofs\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;rangeproofs<\/a>, and they are a series of proofs that prove a blinding factor lies within a certain interval or “range” of known numbers. A common rangeproof is to prove that the value transacted is non-negative, as transferring negative values would allow the sender to create value out of thin air.⁹ Confidential Transactions require that each transaction contains a rangeproof(s), and the rangeproofs are actually included in the block with the transaction data. For those interested, you can learn more about Monero’s particular rangeproofs<a href=\"https:\/\/eprint.iacr.org\/2015\/1098.pdf\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;here<\/a>.<\/p>\n\n\n\n<p>In addition, by obscuring transaction values the adoption of RingCT minimized the vulnerability in detecting the true sender in Ring Signatures because it eliminated the requirement that each of the decoys have to possess the value being transferred, thereby massively increasing the decoy pool.<\/p>\n\n\n\n<h3>Bulletproofs<\/h3>\n\n\n\n<p>Although zero-knowledge proofs might be the holy grail of secure verification in decentralized systems, the first implementations have been both computationally intensive and expensive. This can be attributed to the rangeproofs, which account for the<a href=\"https:\/\/blockstream.com\/2018\/02\/21\/bulletproofs-faster-rangeproofs-and-much-more\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;vast majority<\/a>&nbsp;of data in blocks that use them. Therefore, in<a href=\"https:\/\/www.getmonero.org\/resources\/roadmap\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;October 2018<\/a>, Monero<a href=\"https:\/\/www.mycryptopedia.com\/hard-fork-soft-fork-explained\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;hard-forked<\/a>&nbsp;its protocol and reconstructed Confidential Transactions into a<a href=\"https:\/\/eprint.iacr.org\/2017\/1066\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;bulletproof<\/a>, a much more efficient zero-knowledge proof standard. Under the original zero-knowledge proof standard for Confidential Transactions, each transaction size in a block scaled linearly (1 output = 7kB, 2 outputs = 13kB). Under bulletproofs, transaction sizes scale logarithmically instead (ex: 1 output = 2kB, 2 outputs = 2.5kB). According to Monero, this represents an<a href=\"https:\/\/ww.getmonero.org\/2017\/12\/07\/Monero-Compatible-Bulletproofs.html\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;80% reduction<\/a>&nbsp;in transaction size. Therefore, the integration of bulletproof standards into zero-knowledge algorithms has the potential to give the Monero blockchain sustainability.<\/p>\n\n\n\n<h3>3. Stealth Addresses<\/h3>\n\n\n\n<p>Stealth Addresses protect the anonymity of the receiver (from everyone but the sender). Before completing the transaction, the sender creates a new, one-time public address for the receiver by multiplying its private address by the public address of the receiver, thereby creating a stealth address. This stealth address is what the receiver submits to the block when the transaction is pending.<\/p>\n\n\n\n<p>Stealth addresses protect the anonymity of both the sender and the receiver:<\/p>\n\n\n\n<ul><li>Because<a href=\"https:\/\/blockgeeks.com\/guides\/what-is-hashing\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;a hashed output address doesn’t reveal anything about its inputs<\/a>, the receiver doesn’t learn the sender’s private key through this process.<\/li><li>Because none of the validators know the sender’s private key, they cannot establish a connection between the receiver’s public key and its stealth address.<\/li><li>Because a new stealth address is created for each transaction, this limits each sender’s ability to track the activity of the receiver just to their transaction.<\/li><\/ul>\n\n\n\n<h3>4. Kovri<\/h3>\n\n\n\n<p>In order to understand Kovri, it’s important to know that there are two layers to blockchain privacy. The first, which Ring Signatures, RingCT, and Stealth Addresses attempt to protect, is&nbsp;<em>validation privacy<\/em>: the network can verify the transaction without exposing the personal\/private details of the involved parties. The second is&nbsp;<em>transmission privacy.<\/em><\/p>\n\n\n\n<p>In order to understand transmission privacy, we need to briefly walk through how data transmission works on the Internet. Data transfer on the Internet, whether via a blockchain or other, fundamentally works in the same way: the data is originated and sent from a computer, known as the “client” node.¹⁰ The client node has a public address associated with it, which represents its location within the Internet, known as an IP address. Whether we realize it or not, the data sent and received online is always triggered by a command from the client node via an Internet browser, such as “send me to ESPN.com,” or “send this message to that e-mail address” or “send 3 BTC to Alice.” Based on<a href=\"https:\/\/en.wikipedia.org\/wiki\/Internet_protocol_suite\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">TCP\/IP<\/a>, the communication protocol for the Internet, the sender’s command tells its client node what the intended destination node is supposed to be for the data.¹¹ Almost always, unless the client and destination nodes are on the same local network, the client node only knows the destination’s domain name, such as espn.com or an e-mail address. In other words, the sender doesn’t know the IP address of the receiver. As a result, the data travels through the Internet being forwarded from the client node through a pathway of nodes, known as “relay” nodes, looking for a<a href=\"https:\/\/en.wikipedia.org\/wiki\/Domain_name\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;DNS server<\/a>&nbsp;that contains the domain name in its database and its associated IP address.<\/p>\n\n\n\n<p>Here’s a key point to understand: the data itself isn’t traveling aimlessly looking for the right DNS server. If that were the case, the data would pass through and be exposed to a bunch of unnecessary nodes. Instead, the shortest path between the senders address and unknown receivers address is solved, like a puzzle, using&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Dijkstra%27s_algorithm\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Dijkstra’s algorithm<\/a>.¹² Once the shortest path is determined, the data passes through the relay nodes along that path. Therefore, unnecessary nodes do not touch the data.<\/p>\n\n\n\n<p>Here are additional consequences of this setup:<\/p>\n\n\n\n<ul><li>Because Dijkstra’s algorithm determines the transmission route before the data is transferred, each node only knows the previous node and the next node in the transmission pathway. The only computer that knows the sending IP address is the sender, and the only computer that knows the receiving IP addresses is the destination computer.<\/li><li>The DNS server is queried for the IP address of the destination computer, but because Dijkstra’s algorithm computes before the data is transferred, it learns nothing about the information\/value being transferred.<\/li><li>The data that’s being transferred does not contain information on the sender and receiver. So again, relay nodes learn nothing about the sender and receiver.<\/li><li>The Internet and TCP\/IP protocol use domain names for navigation rather than IP addresses because this adds in a critical layer of obfuscation.<\/li><\/ul>\n\n\n\n<p>So — taking all this into consideration, where’s the vulnerability? Our description may have made TCP\/IP appear fortified, but there are actually multiple ways to “cyber attack” via the Internet. There’s an entire industry (Cybersecurity) dedicated to combating this pursuit. Generally speaking, the first type of attack are destructive attacks — many of these, such as<a href=\"https:\/\/www.cloudflare.com\/learning\/ddos\/what-is-a-ddos-attack\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;DDos<\/a>, overwhelm and take out the functionality of a targeted client. The second are spying attacks — where attackers can access the sender, receiver and data being transferred.¹³<\/p>\n\n\n\n<p>So how can blockchain nodes avoid the range of possible cyber attacks? Well, guaranteed avoidance isn’t possible unless nodes remain offline, because when you interact with other nodes you assume the risk the counterparty is infected with a virus, that upon interaction, could harm your computer. This, again, is merely how the Internet works because it’s empirically peer-to-peer \/ node-to-node. However, if the attack isn’t coming from your counterparty but rather a third-party, there is a proposed solution for how to avoid attacks:&nbsp;<em>obfuscating<\/em>&nbsp;either your location or your transmission pathway.<\/p>\n\n\n\n<p>Privacy, the form of cryptography, strikes again. One of the preeminent proposals behind transmission security are anonymous P2P communication systems. Heard of<a href=\"https:\/\/en.wikipedia.org\/wiki\/Tor_%28anonymity_network%29\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Tor<\/a>? Tor, or The Onion Router, was the first commercialized anonymous P2P communication system, developed in the mid-1990’s by the US Navy to protect US intelligence communications online.¹⁴ The purpose of Tor is to enable anonymous transmission of data on the Internet. Nodes on the Tor network essentially have downloaded the Tor software that allows them to decrypt encrypted data transmissions. The Tor network consists of the user\/client, internal relay node and exit nodes, which are the last node in transmission before the data exits out of the Tor network and is sent to the receiver, who is likely outside of the Tor “bubble.” Additionally and also as popular, there’s the Invisible Internet Project (<a href=\"https:\/\/en.wikipedia.org\/wiki\/I2P\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">I2P<\/a>), which takes anonymity one step further. I2P, initially released in 2003, is an encrypted Internet inside of the Internet; sender and receivers are apart of the I2P network, and the protected data never leaves the bubble. Because of this, some refer to I2P as the true darknet. Both I2P and Tor are free and open-source software. You can learn more about how Tor and I2P work and their similarities and differences as P2P encryption networks&nbsp;<a href=\"https:\/\/www.ivpn.net\/privacy-guides\/an-introduction-to-tor-vs-i2p\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>A Monero development team, led by core Monero developer “Anonimal” has been working on an integration of I2P for Monero named Kovri. Simply put, I2P is programmed in&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Java_%28programming_language%29\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Java<\/a>&nbsp;and Kovri was proposed as an enhanced,&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/C%2B%2B\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">C++<\/a>implementation. Kovri currently is not live and updates from Anonimal have been few and far between. On December 25, 2018, Anonimal released a&nbsp;<a href=\"https:\/\/gitlab.com\/sekreta\/sekreta\/blob\/master\/README.md\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">white paper on Sekreta<\/a>, which could be an updated version of Kovri and references Kovri’s I2P protocol throughout its analysis. All in all, the intention of Kovri \/ Sekreta is to couple&nbsp;<em>transmission privacy&nbsp;<\/em>with the more popularly addressed&nbsp;<em>validation privacy.<\/em>&nbsp;We will provide updates if there is any announced progress on Monero’s I2P solution.<\/p>\n\n\n\n<p>In review, Monero has mandatory anonymization and utilizes a combination of zero-knowledge algorithms and community-based signature mixing to preserve users’ privacy. Monero developers are working on an interesting side project to secure transmission privacy, but this project is still under development.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"795\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f9dbe7c7b915_1FXSgcBQwnsE_sw2GCIbUlw.png\" alt=\"\" class=\"wp-image-3657\" srcset=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f9dbe7c7b915_1FXSgcBQwnsE_sw2GCIbUlw.png 800w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f9dbe7c7b915_1FXSgcBQwnsE_sw2GCIbUlw-150x150.png 150w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f9dbe7c7b915_1FXSgcBQwnsE_sw2GCIbUlw-768x763.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/figure>\n\n\n\n<h3><strong>Zcash<\/strong><\/h3>\n\n\n\n<p>Zcash isn’t the oldest privacy blockchain (it officially launched as a hard-fork of Bitcoin in October 2016), but its team and technology has led by example. Originally designed by cryptographers from some of the world’s leading academic institutions (MIT, Technion, Johns Hopkins, Tel Aviv University and UC Berkeley), Zcash’s anonymization is built entirely on<a href=\"https:\/\/z.cash\/technology\/zksnarks\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;zk-SNARKs<\/a>&nbsp;(Zero-Knowledge Succinct Non-Interactive Argument of Knowledge), which allows Zcash to hide almost all data from the validators in its network (the sender information, receiver information, and transaction amounts) except for time stamps and transaction fees. Many call Zcash’s zk-SNARKs algorithm “moon math,” because of its incredible complexity. Zcash has two main features that make it standout:<\/p>\n\n\n\n<ol><li>Its zk-SNARKs technology<\/li><li>Its anonymization is selective<\/li><\/ol>\n\n\n\n<p>Zcash allows users, both senders and receivers, to choose whether they want their transaction information to be transparent or shielded. A fully transparent transaction, where both the sender and receiver opt out of hiding their information, looks and operates similar to that of Bitcoin. However, if any part of the transaction is shielded, Zcash uses its zk-SNARK algorithm to verify the transaction. Using a zero-knowledge algorithm rather than signature mixing makes it easier for Zcash to comply with law enforcement, as users can reveal their transaction history for a shielded address to a third party by providing their “view key”.¹⁵ Zcash also contains a memo field for shielded transactions, which you can think of as the description line on a check that only you, the recipient, and whichever third party to whom you’ve sent your “view key” can see.<\/p>\n\n\n\n<p>What’s the difference between Zcash’s zk-SNARKs and Monero’s RingCT bulletproof? They are different zero-knowledge algorithms that have trade-offs based on time, size and cost. Exploring the trade-offs can get quite technical and is outside the scope of this paper. (For the ambitious among you, you can start<a href=\"https:\/\/ethereum.stackexchange.com\/questions\/59145\/zk-snarks-vs-zk-starks-vs-bulletproofs-updated\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;here<\/a>). Nevertheless, there is one aspect of the comparison that is important to explore: Zcash’s zk-SNARK implementation has, as founder<a href=\"https:\/\/en.wikipedia.org\/wiki\/Zooko_Wilcox-O%27Hearn\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Zooko Wilcox<\/a>&nbsp;describes it, an “unfortunate vulnerability in the math,” where it requires a trusted setup, while Monero’s bulletproofs do not.<\/p>\n\n\n\n<p>Zcash’s trusted setup is similar to the sender’s and receiver’s selection of a “blinding factor” or secret key in Monero’s RingCT. However, Zcash has one secret key and it holds significantly more importance. Because zk-SNARKs power the entire protocol, Zcash uses its blinding factor to generate the Zcash currency and launch its blockchain. On one hand, it’s efficient that the blinding factor only needs to be chosen once, rather than per transaction like Monero. On the other, the security of the entire network is predicated on this blinding factor. If somebody got a hold of it, he or she could successfully make counterfeit Zcash tokens. And because of Zcash’s privacy features, these counterfeit tokens could go undetected. Talk about a nightmare.¹⁶<\/p>\n\n\n\n<p>So how did Zcash generate this blinding factor so that a) no one could steal it upon creation and b) they could prove to all potential future users of Zcash that no one knew, saw, learned or tampered with this number? Founding members held a ceremony right before the launch of the blockchain from October 22–23, 2016, where six independent teams in distributed locations all over the world generated and contributed a piece or “shard” of the private key, without knowledge of the others. The original Zcash “<a href=\"https:\/\/z.cash\/blog\/zcash-sprout-launch\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Sprout Ceremony<\/a>” was quite elaborate — to hear the details, checkout journalist Morgan Peck’s entertaining first-hand account<a href=\"https:\/\/www.wnycstudios.org\/story\/ceremony\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;here<\/a>.<\/p>\n\n\n\n<p>Unfortunately for Zcash, their ceremonial days aren’t behind them. Every time Zcash wants to hard-fork their protocol, they have to create a new blinding key and conduct another ceremony. On April 13, 2018, Zcash completed their second “<a href=\"https:\/\/www.zfnd.org\/blog\/conclusion-of-powers-of-tau\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Power of Tau Ceremony<\/a>,” which was public and included hundreds of participants globally,¹⁷ in preparation for their<a href=\"https:\/\/z.cash\/blog\/sapling-activation-complete\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;Sapling<\/a>&nbsp;hard-fork.<\/p>\n\n\n\n<p>One of the major problems with the optional privacy features of Zcash is that if the majority of the network opts out of the privacy feature, it becomes easier for surveyors to track the private users. So it is in Zcash’s best interests for more users to opt into privacy.<\/p>\n\n\n\n<p>Zcash users’ initial disinterest in shielding transactions might be attributed to its computational intensity\/cost and latency. Originally, Zcash’s Sprout protocol took multiple gigabytes of memory and over 30 seconds to create a shielded transaction. Under Sapling, a shielded transaction can be created in a few seconds and use only 40 megabytes of memory, making it realistic for users to regularly transact with a shielded address. In fact, this significant decrease in cost and latency pushes Zcash closer to being able to conduct shielded transfers on smartphones\/mobile devices. Yet, the Zcash network has yet to reap the fruits of developers’ labor, as only<a href=\"https:\/\/explorer.zcha.in\/statistics\/usage\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">&nbsp;15%<\/a>&nbsp;of all transactions on the Zcash blockchain in the past month have been partially or fully shielded.<\/p>\n\n\n\n<p>All in all, Zcash’s protocol design leads by technical example. However, their trusted setups are still a headache, and there remains risk to the underlying security of the network if someone were to obtain this blinding factor. This captures the trade-off between Zcash and Monero. One utilizes a trustless protocol (zk-SNARKs) reliant upon a trusted setup. The other has trustless features but is not trustless throughout, instead relying on obfuscation tricks whose success is correlated to its network size. Neither are perfect, which is why other privacy coins (Grin and Beam) have continued to launch.<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<p><em>All material presented in this article represents the research analysis and opinions of the author. Nothing in this article should be construed as investment advice.<\/em><\/p>\n\n\n\n<p>¹ Zooko Wilcox, founder of Zcash referenced in the following Zcash section, has coined Zooko’s Triangle, a similar trilemma around building a system that is secure, decentralized, and uses a naming scheme that is actually meaningful\/memorable to the end user. Read more&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Zooko%27s_triangle\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>² There is an additional approach, which is to permission the blockchain. Permissioned blockchains, also referred to as consortium blockchains, are fully decentralized but nodes have to be invited to participate. From a governance standpoint, they are essentially closed-sourced, direct democracies. Many enterprises are exploring consortium blockchains as an alternative to their legacy centralized database infrastructure. See JPM Coin and Quorum as an example&nbsp;<a href=\"https:\/\/www.jpmorgan.com\/global\/news\/digital-coin-payments\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>³ By default, Bitcoin’s wallet is built so that each time you receive a payment, your public address is updated to a new, unique address in order to avoid observer traceability. However, Ethereum does not do this by default, so you can trace a user’s activity by following his or her public key on the blockchain. Read on more on this&nbsp;<a href=\"https:\/\/support.blockchain.com\/hc\/en-us\/articles\/210353663-Why-are-my-bitcoin-and-bitcoin-cash-addresses-changing-\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>. Bitcoin has developed many privacy methods (Centralized Mixing, Tumblebit, CoinJoining, Confidential Transactions, Stealth Addresses, off-chain solutions such as Lightning Network), but these are not a part of the default protocol because they either involve third parties to work or haven’t been implemented yet. Read more on this&nbsp;<a href=\"https:\/\/bitcoinmagazine.com\/articles\/bitcoin-privacycoin-tech-making-bitcoin-more-private\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>⁴ There is&nbsp;<a href=\"https:\/\/www.coindesk.com\/coinbase-acquires-blockchain-tracking-startup-neutrino-for-undisclosed-price\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">demand<\/a>&nbsp;for blockchain-tracking startups whose objective is simply to monitor wallets and transactions on blockchains to detect criminal activities.<\/p>\n\n\n\n<p>⁵ This statement is based on the fact that the majority of leading publications in the blockchain industry that have published primers on privacy blockchains have concentrated their analysis on Monero and Zcash.<\/p>\n\n\n\n<p>⁶ In fact, zero-knowledge proofs were originally invented in 1985 by MIT researchers Shafi Goldwasser and Silvio Micali and University of Toronto researcher Charles Rackoff. See the original paper&nbsp;<a href=\"http:\/\/groups.csail.mit.edu\/cis\/pubs\/shafi\/1985-stoc.pdf\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>. In proof systems between a prover (sender) and a verifier (receiver), research traditionally focused on safeguarding the system from the malicious intentions of the prover. The team instead focused on safeguarding the system from the malicious intentions of the verifier. As we figure out how to make the Internet more secure for users, zero-knowledge proofs are gaining momentum today. Read more from Matthew Green, one of the founding Zcash scientists,&nbsp;<a href=\"https:\/\/blog.cryptographyengineering.com\/2014\/11\/27\/zero-knowledge-proofs-illustrated-primer\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>⁷ Additionally, the more expensive it becomes for nodes to scan the blockchain, the more expensive miner fees will become. Miner fees are not the focus on this report, but read more on this&nbsp;<a href=\"https:\/\/en.bitcoin.it\/wiki\/Miner_fees\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>⁸ This proof works because of the&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Homomorphic_encryption\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">homomorphic properties<\/a>&nbsp;of Pedersen Commitments.<\/p>\n\n\n\n<p>⁹ For example, if the sender sent 2 Monero to the receiver and kept -1 Monero in his\/her wallet as change, the sender essentially sent 1 Monero to the receiver he or she did not own.<\/p>\n\n\n\n<p>¹⁰ The client node can be a personal computer, smartphone, server, etc. any type of computer.<\/p>\n\n\n\n<p>¹¹ For those interested in a visual illustration of the evolution of the Internet, see&nbsp;<a href=\"https:\/\/www.vox.com\/a\/internet-maps\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>¹² Does this sound like how GPS works? You don’t drive aimlessly, and the path is predetermined? Dijkstra’s algorithm and variants thereof are used for GPS systems as well.<\/p>\n\n\n\n<p>¹³ For more information on common types of cyber attacks, read&nbsp;<a href=\"https:\/\/blog.netwrix.com\/2018\/05\/15\/top-10-most-common-types-of-cyber-attacks\/#Denial-of-service%20%28DoS%29%20and%20distributed%20denial-of-service%20%28DDoS%29%20attacks\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>¹⁴ The idea for an anonymous communication system was proposed by cryptographer&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/David_Chaum\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">David Chaum<\/a>&nbsp;in 1981, which soon thereafter developed into eCash, an anonymous electronic P2P money system that many consider to be the original precursor to Bitcoin. Read more&nbsp;<a href=\"https:\/\/bitcoinmagazine.com\/articles\/genesis-files-how-david-chaums-ecash-spawned-cypherpunk-dream\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">here<\/a>.<\/p>\n\n\n\n<p>¹⁵ Monero offers a view key feature as well, but it only allows third parties to review information on the receiver (show the public address tied to the stealth address), which isn’t very helpful.<\/p>\n\n\n\n<p>¹⁶ In fact, Zcash&nbsp;<a href=\"https:\/\/z.cash\/blog\/zcash-counterfeiting-vulnerability-successfully-remediated\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">announced<\/a>&nbsp;in February 2019 it had discovered a counterfeiting vulnerability in the system 17 months after launch, which was fixed by the Sapling upgrade in October 2018.<\/p>\n\n\n\n<p>¹⁷ In fact, adding hundreds of participants made the ceremony more secure, as an attacker would have needed to learn all hundreds of shards to steal the blinding factor, rather than just six. Also, multiple mixing algorithms were used to randomize the shards, unlike the first ceremony which used just one.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Just like Zuck, we believe that privacy is a crucial element to the proper functioning of the future of the Internet. That’s why this month we will be going deep&#8230;<\/p>\n","protected":false},"author":6,"featured_media":3654,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[9],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3653"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3653"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3653\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3654"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3653"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3653"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3653"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3653"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}