{"id":3659,"date":"2019-03-01T21:49:29","date_gmt":"2019-03-01T21:49:29","guid":{"rendered":"https:\/\/wavegp.com\/?p=3659"},"modified":"2020-11-22T21:54:17","modified_gmt":"2020-11-22T21:54:17","slug":"the-alpha-framework-an-analysis-of-the-coinbase-effect","status":"publish","type":"post","link":"https:\/\/wavegp.com\/the-alpha-framework-an-analysis-of-the-coinbase-effect\/","title":{"rendered":"The Alpha Framework: An Analysis of the “Coinbase Effect”"},"content":{"rendered":"\n<p>Existing in the cryptocurrency markets during 2018 is existing in a world of declining alpha.<\/p>\n\n\n\n<p>Existing in the cryptocurrency markets during 2018 is existing in a world of declining alpha. As late as 2017, there was significant alpha in the markets due to abundance of retail investors (a test for you — have you ever bought a coin based on a reddit thread?) and their propensity for following the herd to make decisions. Simply using google trends, monitoring exchange listings, using rudimentary momentum strategies and making educated guesses on the emotional state of the market was enough to ensure you would leave your screen happy.<\/p>\n\n\n\n<p>A favorite moment of mine was when&nbsp;<a href=\"https:\/\/medium.com\/@vikram.arun\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Vikram Arun<\/a>&nbsp;and I realized that you could track CoinMarketCap listings using their API and get notified of a pending asset listing approximately 40 minutes before they tweeted. Despite the fact CoinMarketCap is but an excel sheet on a website, it provided us ample returns due to those very kind speculators who insisted (via their buys) that CoinMarketCap&nbsp;<strong><em>for sure<\/em><\/strong>&nbsp;knew the next, hot coin.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"421\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f92167c7b929_1WgS9mur4azZKYwRfyl7raw.png\" alt=\"\" class=\"wp-image-3661\" srcset=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f92167c7b929_1WgS9mur4azZKYwRfyl7raw.png 800w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f92167c7b929_1WgS9mur4azZKYwRfyl7raw-768x404.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><figcaption>From the Ledger Capital pitch deck. The old days.<\/figcaption><\/figure>\n\n\n\n<p>‍<\/p>\n\n\n\n<p>It was a low volume, but fun exercise. We enjoyed ourselves immensely.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Note: These returns are an artifact retained from the author’s now-defunct fund. The returns are presented as a snapshot to demonstrate returns not meant to imply future performance.<\/em><\/p><\/blockquote>\n\n\n\n<p>Now, a few of these still work but the majority do not. The edge is slowly being beat out of the market, and one of the only true sources of alpha left are event driven plays. Do you know something in advance? Are you fast enough with your reaction? News does in fact appear to be mis-priced constantly. The market reacts wildly to unforeseen events, and that presents opportunity for the quick trader. Take for example the&nbsp;<a href=\"https:\/\/www.ccn.com\/this-crypto-surged-200-after-listing-on-samsung-galaxy-s10-blockchain-wallet\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">200% increase in of Enjin Coin<\/a>&nbsp;despite the weakness of the market following Samsung’s announcement.&nbsp;<a href=\"https:\/\/www.ccn.com\/crypto-spike-decentraland-60-htc-blockchain-smartphone-exodus\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">The 40% increase in $MANA<\/a>&nbsp;following their HTC partnership. Events make money. It’s just a matter of figuring out which ones.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>There are of course a few others useful sources of alpha to be discovered via a close inspection of prices, on chain movements of bitcoin, volatility, alt volumes, and the options market. None of which I will share of course (unless you ask me nicely).<\/em><\/p><\/blockquote>\n\n\n\n<p>Of course, the gold standard of event driven trading has always been exchange listings. In early 2017, the innovative thing to do was to consistently scrape the API of major exchanges and wait to see if a new asset was added. Usually by employing this method, you were able to catch exchange listings some minutes in advance of the medium or twitter post. In 2018, this seems to work less well, as exchanges began to add assets to their APIs after announcing they would be adding the asset.<\/p>\n\n\n\n<p>Now of course, the gold standard of the gold standard has long been Coinbase. Of all the major exchanges, Coinbase has listed the least amount of assets and has historically been the hardest exchange to get your token listed on. Combined with the massive retail marketplace that Coinbase represents (it was once #1 on the iOS App Store), you can see why. It was once reported that Ripple offered Coinbase a $100M loan in order to secure a place on the trading platform — and they were actively turned away.<\/p>\n\n\n\n<p>In this article, I want to explore the idea that the Coinbase listing itself has had the alpha driven out. It’s happened too often, it’s old hat. There have been a few explorations of this issue but none of them competently did a true analysis, and left in the mix many confounding factors. I will attempt to clear up the confusion, and also hopefully present a solid framework for identifying event driven alpha.<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4>The Alpha Framework<\/h4>\n\n\n\n<p>It’s interesting that the crypto space seems to need this, but here we are. Before we dive in a quick review of what alpha is,&nbsp;<a href=\"https:\/\/www.investopedia.com\/terms\/a\/alpha.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">courtesy of Investopedia:<\/a><\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>“Alpha” (the Greek letter α) is a term used in investing to describe a strategy’s ability to beat the market, or it’s “edge.” Alpha is thus also often referred to as “<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/e\/excessreturn.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>excess return<\/em><\/a><em>” or “<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/a\/abnormalreturn.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>abnormal rate of return<\/em><\/a><em>,” which refers to the idea that markets are efficient, and so there is no way to systematically earn returns that exceed the broad market as a whole. Alpha is often used in conjunction with&nbsp;<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/b\/beta.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>beta<\/em><\/a><em>(the Greek letter β) , which measures the broad market’s overall&nbsp;<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/v\/volatility.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>volatility<\/em><\/a><em>&nbsp;or risk, known as&nbsp;<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/s\/systematicrisk.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>systematic market risk<\/em><\/a><em>.<\/em><\/p><\/blockquote>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Alpha is used in finance as a measure of&nbsp;<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/f\/financialperformance.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>performance<\/em><\/a><em>, indicating when a strategy, trader, or portfolio manager has managed to beat the market return over some period. Alpha, often considered the&nbsp;<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/a\/active-return.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>active return<\/em><\/a><em>&nbsp;on an investment, gauges the performance of an investment against a market index or benchmark that is considered to represent the market’s movement as a whole. The excess return of an investment relative to the&nbsp;<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/r\/return.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>return<\/em><\/a><em>&nbsp;of a benchmark index is the investment’s alpha. Alpha may be positive or negative and is the result of active investing. Beta, on the other hand, can be earned through passive&nbsp;<\/em><a href=\"https:\/\/www.investopedia.com\/terms\/i\/index-investing.asp\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>index investing<\/em><\/a><em>.<\/em><\/p><\/blockquote>\n\n\n\n<p>This framework will be both an exercise in determining how to distinguish alpha from beta and figuring out whether that specific event based is diminishing or not. It’s a way to help understand whether the effect on price you are seeing is truly a result of the event, and how that varies based on certain market conditions. In this article, I will be applying it to the Coinbase Effect. In the future, I hope to expand to other exchanges and events. I say hope, because it’s quite tedious and honestly will help you far more than it will help me. So maybe I won’t. We’ll see.<\/p>\n\n\n\n<p><strong>Excess Return:&nbsp;<\/strong>Make sure the asset is outperforming the market. Many people will point to the beginning of an event and say “Look, a coin is up 40%! What a trade!” They will then disregard the fact the market is up 50%. So the first thing to account for is market return during the period you wish to look at, and take a look at the&nbsp;<strong>excess return<\/strong>during that timeframe.<\/p>\n\n\n\n<p><strong>Market Cap Weighted:&nbsp;<\/strong>If a similar event moves a $1B coin 5% in January, and a $500M coin 10% in February, then we cannot say at all that the effect is diminishing. Some people may try to argue otherwise and to them I say go away, you are wrong. For an analysis to have weight, please make sure you instead account for discrepancies in return by market-cap.<\/p>\n\n\n\n<p><strong>Short term\/long term:&nbsp;<\/strong>Does the announcement change the fundamentals of the asset? What are the 1d, 7d, and 30d returns post announcement? Your timeframe is important here to determine whether an event fundamentally changes the asset or is a market overreaction.<\/p>\n\n\n\n<p><strong>Volatility:&nbsp;<\/strong>If you’re feeling up for it, try to see how the announcement changes the volatility of the asset moving forward. This can give you insight into the long term effect. Will it provide more liquidity? Is it a safer investment now? Often times exchange listings dampen volatility of low caps, and do nothing to volatility of large caps.<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4>Some Background:<\/h4>\n\n\n\n<p>There are technically two types of listing, one for Coinbase and one for Coinbase Pro. Whether an asset is listed on one or the other is not likely to have a material affect on the alpha for the announcement, and therefore I will be referring to either as a listing on “Coinbase”.<\/p>\n\n\n\n<p>With Coinbase, we must also make some distinctions as there are a few different types of announcements I would like to point out, and only one that I would like to focus on.<\/p>\n\n\n\n<ol><li>An announcement that Coinbase is exploring adding an asset, and may potentially be added in the future.<\/li><li>An announcement that an asset will be added in the future to Coinbase<\/li><li>An announcement that the asset has started trading on Coinbase<\/li><\/ol>\n\n\n\n<p>In this analysis, I will be focusing on announcement #2 to determine whether Coinbase listings have a material affect on the markets.<\/p>\n\n\n\n<p>Moving forward, one could look at announcements about the potential for adding to an exchange to determine the market probability of addition. Another potential exploration is determining whether accumulation before trading actually leads to a net decrease for asset prices when listing is announced. I reserve these explorations for future posts.<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<h4>The Analysis:<\/h4>\n\n\n\n<p>First, let’s take a look at a table of all assets ever listed on Coinbase and see if we can find anything interesting.<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"712\" height=\"322\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f9fd8ec7b928_1R10L6bXGpIpLKsNSeGV27w.png\" alt=\"\" class=\"wp-image-3665\"\/><figcaption>Source: Wave Financial Calculations<\/figcaption><\/figure>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Quick note: Excess return is defined as the return of an asset over a basket of 50% Bitcoin and 50% Ethereum. This is to account for the fact that the broader market may be moving and the movement of asset X may be a result of that movement rather than alpha due to listing<\/em><\/p><\/blockquote>\n\n\n\n<p>From a cursory glance, it seems clear that the Coinbase effect has lessened as time goes on. This is to be expected for any event or strategy that produces alpha and is the general rule of the Jungle. Nothing too crazy!<\/p>\n\n\n\n<p>It also appears that even though the affect on Ripple was assumed to be weak, it stood out as better than the previous 7d returns of the five previous assets listed on Coinbase.<\/p>\n\n\n\n<p>The above points can be more easily visualized in the chart below.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"1200\" height=\"708\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f973dfc7b927_1vCc9eULhTbuDHzpXVappEQ.png\" alt=\"\" class=\"wp-image-3663\" srcset=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f973dfc7b927_1vCc9eULhTbuDHzpXVappEQ.png 1200w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f973dfc7b927_1vCc9eULhTbuDHzpXVappEQ-768x453.png 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><figcaption>Source: Wave Financial Calculations. To calculate ETH excess returns I only used BTC returns during that time frame.<\/figcaption><\/figure>\n\n\n\n<p>‍<\/p>\n\n\n\n<p>Looking at a different angle, it becomes clear that market cap has an influence on the returns generated by a coinbase listing. Below is the same table, but sorted by market cap instead. Note however, that the best performing assets (Litecoin &amp; Bitcoin Cash) were listed during a bear market. A better approach may be to rank returns by the 60 day previous performance of Bitcoin, which would allow us to see whether or not market sentiment has an affect on the listing pump (it likely does).<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"712\" height=\"327\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f9e58cc7b925_1ngbAZHMaTjgVOSS5EOiXvA-1.png\" alt=\"\" class=\"wp-image-3664\"\/><figcaption>Source: Wave Financial Calculations<\/figcaption><\/figure>\n\n\n\n<p>‍<\/p>\n\n\n\n<p>I want to draw attention to this because controlling for different criteria should help with heuristics when making a decision on how to play a Coinbase listing. For example, if Coinbase announces they may be listing Coin A or Coin B and Coin A is 10x the size of Coin B then it may be a more EV positive play to buy into Coin B even if you believe the probability of Coin B being listed is lower.<\/p>\n\n\n\n<p>Clearly from a cursory glance at the data, we can draw a few interesting conclusions. One, the Coinbase affect is indeed fading overall. This however can be reversed if something is small cap (District0x) or if the asset added was heavily requested (XRP). We also see that the market has a strong affect on listings, with Litecoin and BCH posting great returns as they were listed during a full swing bull market.<\/p>\n\n\n\n<p>Hopefully, you find this alpha framework helpful for analyzing different opportunities, events and catalysts. I encourage the use of these controlling factors, and I’m excited to see research from the community moving forward!<\/p>\n\n\n\n<p>All material presented in this article represents the research analysis and opinions of the author. Nothing in this article should be construed as investment advice.<\/p>\n\n\n\n<p>Thanks to&nbsp;<a href=\"https:\/\/medium.com\/@warcmeinstein?source=post_page\" rel=\"nofollow noopener\" target=\"_blank\">Marc Weinstein<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Existing in the cryptocurrency markets during 2018 is existing in a world of declining alpha. Existing in the cryptocurrency markets during 2018 is existing in a world of declining alpha&#8230;.<\/p>\n","protected":false},"author":6,"featured_media":3660,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[9],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3659"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3659"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3659\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3660"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3659"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3659"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3659"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3659"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}