{"id":3667,"date":"2019-03-21T21:51:58","date_gmt":"2019-03-21T21:51:58","guid":{"rendered":"https:\/\/wavegp.com\/?p=3667"},"modified":"2020-11-22T21:52:28","modified_gmt":"2020-11-22T21:52:28","slug":"wave-financial-february-market-report","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-february-market-report\/","title":{"rendered":"Wave Financial &#8211; February Market Report"},"content":{"rendered":"\n<p>The purpose of this section is to keep you updated on the most important movements in the industry. The crypto markets move at a rapid pace and there is no shortage of news to share. At Wave, we track the markets 24\/7 to gain an edge on investing. Here are some important trends from January and February that we continue to track.<\/p>\n\n\n\n<h1>Market Update<\/h1>\n\n\n\n<p>The purpose of this section is to keep you updated on the most important movements in the industry. The crypto markets move at a rapid pace and there is no shortage of news to share. At Wave, we track the markets 24\/7 to gain an edge on investing.<\/p>\n\n\n\n<p>Here are some important trends from January and February that we continue to track.<\/p>\n\n\n\n<p><strong>The Smart Money is Pouring In<\/strong><\/p>\n\n\n\n<p>While crypto prices remain subdued at the start of 2019, there is no doubt that the asset class as a whole continues to gain traction with leading financial and technological institutions.<\/p>\n\n\n\n<p>Only last week, it was reported that Fidelity’s long-awaited digital asset custody solution is already live. The company began onboarding institutional clients<a href=\"https:\/\/www.cnbc.com\/2019\/03\/08\/fidelitys-new-cryptocurrency-company-is-up-and-running-despite-a-bear-market-for-digital-coins.html\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;in January<\/a>. In February, JPMorgan<a href=\"https:\/\/www.theverge.com\/2019\/2\/14\/18224976\/jp-morgan-chase-cryptocurrency-banking-cnbc\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;announced JPM Coin<\/a>, a cryptocurrency used for instant settlements of international transactions between corporate clients. This marks a major shift from JPMorgan CEO Jamie Dimon’s previous comments that Bitcoin is a fraud and has led many in the industry to wonder how long this had been in the works.<\/p>\n\n\n\n<p>In addition,<a href=\"https:\/\/www.nytimes.com\/2019\/02\/28\/technology\/cryptocurrency-facebook-telegram.html\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Facebook is creating its own cryptocurrency<\/a>&nbsp;&#8211; a stablecoin that will be used to address the $69Bn remittances market in India. Facebook’s stablecoin will be available to WhatsApp users. This likely is only the tip of the iceberg for Facebook’s ambitions in the crypto industry. Recently, Zuck posted an update on the<a href=\"https:\/\/www.facebook.com\/notes\/mark-zuckerberg\/a-privacy-focused-vision-for-social-networking\/10156700570096634\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;direction he’d like to take Facebook<\/a>&nbsp;and it read like a crypto canon.<\/p>\n\n\n\n<p>After the Yale Endowment announced that it<a href=\"https:\/\/www.cnbc.com\/2018\/10\/05\/yale-investment-chief-david-swensen-jumps-into-crypto-with-bets-on-two-silicon-valley-funds.html\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;invested in two leading crypto venture funds<\/a>, A16Z and Paradigm, it became clear that other institutions would follow suit. Two big announcements in February confirmed this. First, our friend Anthony Pompliano at Morgan Creek announced a $40m digital asset fund anchored by<a href=\"https:\/\/bitcoinmagazine.com\/articles\/morgan-creek-bags-40m-raise-attracts-industry-first-funding-pensions\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;two pension funds from Fairfax County Virginia.<\/a>&nbsp;Pensions are typically the most risk-averse and slowest moving of all institutional investors, so this is a big deal. Following this news, a leading gatekeeper to major institutional capital, Cambridge Associates, announced that it has begun<a href=\"https:\/\/www.cambridgeassociates.com\/research\/cryptoassets-venture-into-the-unknown\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;advising its clients to explore investment options in the crypto industry<\/a>.<\/p>\n\n\n\n<p>Crypto prices remained relatively unaffected by this wave of good news, but we remain optimistic that more institutional capital may continue to move into the industry over the coming years. A positive for Wave and the industry at large.<\/p>\n\n\n\n<p><strong>QuadrigaCX &amp; The Case For Non-Custodial Exchanges<\/strong><\/p>\n\n\n\n<p>In spite of the wave of new investors entering the space, crypto continues to be plagued by exchange hacks. The most recent hack of leading Canadian exchange, QuadrigaCX, was<a href=\"https:\/\/twitter.com\/tayvano_\/status\/1101745089468985344?utm_campaign=Long%20Reads%20Sunday%20&amp;utm_medium=email&amp;utm_source=Revue%20newsletter\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;most unusual<\/a>. Approximately,<a href=\"https:\/\/www.engadget.com\/2019\/03\/08\/quadrigacx-bitcoin-missing-millions\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;$190M in crypto assets are now inaccessible for exchange users<\/a>. The company’s CEO, Gerald Cotton, died unexpectedly in December taking with him the only knowledge of the exchanges private keys. These keys are needed in order for anyone to access the exchange’s funds.<\/p>\n\n\n\n<p>While this is another huge story tied to an exchange-related issue; we don’t believe that this should be a net negative for the industry at large. It is clear that there is a need for non-custodial exchanges in the crypto industry and as institutions enter, better, more secure custody solutions are coming online.<\/p>\n\n\n\n<p>The ethos behind the crypto market is that of decentralization, so it is not surprising that centralized points of failure, like insecure exchanges, are the main culprits of some of the worst news in crypto today.&nbsp;<\/p>\n\n\n\n<p>The industry is making progress towards replacing custodial exchanges like QuadrigaCX, with non-custodial “decentralized” exchanges in which the end-users hold their own private keys. This is beneficial because a hacker would need to attack every individual user’s wallet vs. one centralized repository of funds. &nbsp;Binance, the leading global crypto exchange, recently announced that its non-custodial exchange, Binance DEX, is&nbsp;<a href=\"https:\/\/www.coindesk.com\/binances-decentralized-exchange-is-about-to-launch-for-public-testing\" rel=\"nofollow noopener\" target=\"_blank\">live for testing<\/a>&nbsp;on Cosmos, a new interoperability protocol. In addition, this week Bancor, another leading decentralized exchange&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/11\/bancor-launches-new-wallet-to-improve-user-experience-for-cross-chain-token-trading\/\" rel=\"nofollow noopener\" target=\"_blank\">launched a new wallet<\/a>&nbsp;to support cross blockchain token trading.<\/p>\n\n\n\n<p><strong>Revived Industry Focus on User Experience Could Drive Adoption<\/strong><\/p>\n\n\n\n<p>At Wave, we have never subscribed to the<a href=\"https:\/\/www.usv.com\/blog\/fat-protocols\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Fat Protocol thesis<\/a>&nbsp;first promoted by Union Square Ventures. In short, this thesis states that it will be the infrastructure of the decentralized internet, not the applications, that will accrue the most value (imagine if HTTP had had a token).<\/p>\n\n\n\n<p>We believe the opposite – value has always accrued and will continue to accrue to the applications that can onboard the most users (whether enterprise or consumer). Companies are rewarded for finding product-market fit and driving adoption. &nbsp;<\/p>\n\n\n\n<p>That said, we have not yet seen a killer application for crypto (other than as a speculative asset class). This is partly because key technological challenges still need to be solved (scalability, interoperability), but also because very few crypto companies have focused on the user experience (or UX).<\/p>\n\n\n\n<p>This is finally beginning to change. As Taylor Monahan, CEO of MyCrypto (a leading crypto wallet), stated during a<a href=\"https:\/\/medium.com\/mycrypto\/building-confidence-not-dapps-d8a3bc1f29d1\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;recent presentation<\/a>&nbsp;at<a href=\"https:\/\/decentralizedsummit.com\/agenda\/1100-am-january-29-2\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Mainframe’s Decentralized Summit<\/a>, “We need to be building&nbsp;<strong>a positive experience<\/strong>&nbsp;that people want to—and can—partake in.” &nbsp;<\/p>\n\n\n\n<p>This may start with a shift in developer interest from “dApps” (or decentralized applications) to normal centralized applications built on top of decentralized protocols. As Chris Burniske author of<a href=\"https:\/\/www.amazon.com\/dp\/B0743MPV9R\/ref=dp-kindle-redirect?_encoding=UTF8&amp;btkr=1\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;CryptoAssets: The Innovative Investor’s Guide<\/a>&nbsp;and partner at<a href=\"https:\/\/www.placeholder.vc\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Placeholder VC<\/a>&nbsp;states in this tweet storm that, “Long term, centralized<a href=\"https:\/\/twitter.com\/hashtag\/crypto?src=hash\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;#crypto<\/a>&nbsp;apps that build atop decentralized infrastructure will find it the key to what allows them to scale beyond, and outcompete, incumbents that fear public networks &amp; cling to owning their infrastructure.”<\/p>\n\n\n\n<p>Increasingly, leading centralized crypto incumbents like Coinbase and Circle are building using decentralized protocols like<a href=\"https:\/\/0x.org\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;0x<\/a>&nbsp;and<a href=\"https:\/\/t.co\/iPbyhlalB9\" rel=\"nofollow\" target=\"_blank\">&nbsp;ZeppelinOS<\/a>&nbsp;and new entrants are following suit. Veil and Dharma Lever are two prime examples of centralized applications that leverage the composability of multiple decentralized protocols.<a href=\"https:\/\/medium.com\/veil-blog\/veil-is-live-on-mainnet-6cdbf870f230\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Veil<\/a>&nbsp;is a prediction market built on top of<a href=\"https:\/\/www.augur.net\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Augur<\/a>&nbsp;with a slick user experience.<a href=\"https:\/\/blog.dharma.io\/introducing-dharma-lever-1bde1451e95c?gi=db056a92ee38\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Dharma Lever<\/a>, is a crypto lending platform built on top of its own decentralized credit protocol,<a href=\"https:\/\/dharma.io\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Dharma<\/a>. Co-founded by Coinbase alum, Nadav Hollander, Dharma is focusing most of its energy on improving the user experience for lending crypto assets. One such improvement is that Dharma Lever pays for the gas (transaction fee) associated with writing the smart contract on their platform to reduce friction.<\/p>\n\n\n\n<p>We’re excited for more companies to leverage the existing crypto infrastructure with a sharpened focus on the end user’s experience. Without ease of use, we’ll never see mass crypto adoption.<\/p>\n\n\n\n<p><strong>More on Scalability: Ethereum Completes Key Upgrade<\/strong><\/p>\n\n\n\n<p>As we noted in our 2018 year-end LP update, a number of newly scalable blockchains are expected to launch in 2019. If Ethereum wants to keep its first mover advantage, it needs to deliver on a number of protocol upgrades including a move to proof of stake consensus. This long road kicked off with the much anticipated Ethereum upgrade called<a href=\"https:\/\/twitter.com\/ethhub_io\/status\/1100826808461647872?utm_campaign=Long%20Reads%20Sunday%20&amp;utm_medium=email&amp;utm_source=Revue%20newsletter\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;Constantinople<\/a>. Constantinople failed to launch on schedule due to the last minute discovery of a bug in the code. However, on February 28th, the Ethereum community announced the implementation of the upgrade which will improve the efficiency of the network by reducing transaction fees and block rewards. Major exchanges like Binance, Huobi, OKex, and Coinbase all announced support for the upgrade.<\/p>\n\n\n\n<p>The race to a scalable blockchain continues, and it remains unclear if Ethereum will be the winner. Ethereum’s main competitive advantage continues to be its strong community of developers (more on that below).<\/p>\n\n\n\n<h1>Wave In the News<\/h1>\n\n\n\n<ol><li>Wave CEO, Dave Siemer, was quoted in a recent report on<a href=\"https:\/\/tearsheet.co\/blockchain-crypto\/crypto-lending-must-move-beyond-speculation-to-become-a-viable-industry\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;crypto lending for Tearsheet<\/a><\/li><li>Wave Principal, Marc Weinstein, was recently quoted in a<a href=\"https:\/\/www.forbes.com\/sites\/tatianakoffman\/2019\/03\/08\/stablecoins-the-next-generation-of-digital-money\/#4dee56c923f3\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;recent article for Forbes<\/a>&nbsp;on the growing importance of stablecoins<\/li><li>Wave President, Ben Tsai, wrote an<a href=\"https:\/\/blocktribune.com\/security-tokens-must-be-driven-by-demand\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;op-ed for Block Tribune<\/a>&nbsp;on the need for digital securities to be driven by demand<\/li><li>Wave Principal, Marc Weinstein, wrote an<a href=\"https:\/\/cryptobriefing.com\/security-token-reality-hype\/\" rel=\"nofollow noopener\" target=\"_blank\">&nbsp;op-ed for Crypto Briefing<\/a>&nbsp;on the hype surrounding digital securities<\/li><\/ol>\n\n\n\n<h1>Wave Around the Globe<\/h1>\n\n\n\n<p>‍<\/p>\n\n\n\n<p><strong>ETH Denver: February 15-17, 2019<\/strong><\/p>\n\n\n\n<p>In February, Wave team members Marc Weinstein, Les Borsai, and Tom Lombardi attended the leading US-based developer conference for the Ethereum community, ETHDenver. There were thousands of developers in attendance working on new code and applications for the Ethereum main net. One of the major themes of the conference was a new focus on decentralized or open finance, also known as #DeFi. There were presentations from some of the leading individuals and companies in the crypto industry.<\/p>\n\n\n\n<p><strong>Key takeaway:<\/strong>&nbsp;Ethereum’s competitive advantage lies in the deep pool of developers who continue to build on the protocol.<\/p>\n\n\n\n<p><strong>Oppenheimer Blockchain Summit<\/strong><\/p>\n\n\n\n<p><strong>Where:&nbsp;<\/strong>New York, NY<\/p>\n\n\n\n<p><strong>When:&nbsp;<\/strong>February 20, 2019<\/p>\n\n\n\n<p>Following the developer conference in Denver, the Wave team attended Oppenheimer’s Blockchain Conference, a 1 day event in New York that highlighting the future of blockchain as an institutional asset class. The conference was well attended by some of New York’s leading financial institutions, hedge funds, and a number of family offices. The quality of the questions showed the improvement in general knowledge surrounding the industry.<\/p>\n\n\n\n<p><strong>Key takeaway:<\/strong>&nbsp;Institutional investors are gearing up to enter the crypto space. The infrastructure that will support their investments and future speculation in the asset class provides an interesting investment opportunity.<\/p>\n\n\n\n<p><strong>Upcoming Conferences<\/strong><\/p>\n\n\n\n<p>Boston, March 9-10, MIT Blockchain&nbsp;<\/p>\n\n\n\n<p>Hong Kong, March 12-14, Token 2049<\/p>\n\n\n\n<p>Philadelphia, April 6, Penn Blockchain Conference<\/p>\n\n\n\n<p>Seoul, April 10-11, Deconomy<\/p>\n\n\n\n<h1>Long Read: Privacy Coins<\/h1>\n\n\n\n<p>In this month’s letter, we share a deep dive from Wave’s all star research Associate Jordan Bloch on an important feature to crypto’s success – privacy. Please see attached to this email.&nbsp;<\/p>\n\n\n\n<p>In a recent letter to Facebook stakeholders, Mark Zuckerberg states,<\/p>\n\n\n\n<p><em>“As I think about the future of the internet, I believe a privacy-focused communications platform will become even more important than today&#8217;s open platforms. Privacy gives people the freedom to be themselves and connect more naturally, which is why we build social networks.”<\/em><\/p>\n\n\n\n<p>We couldn’t agree more. In fact, privacy in the crypto markets is a crucial feature that not only improves scalability (speed) of these networks (the less information stakeholders share, the less data needs to be stored in a blockchain), but also (along with stability) might help usher in an age of international crypto payments. Privacy is misunderstood by many outside of the crypto industry as a way for black market participants to obfuscate important transaction data. However, it is much more than that. For example, do you want your coworkers (or anyone for that matter) to be able to track your purchases for the last month? Of course not.<\/p>\n\n\n\n<p>Much progress on this crucial market theme is being made by numerous teams focused on privacy features and coins. In this deep dive, our associate, Jordan Bloch, addresses the two oldest and largest privacy coins by market cap: ZCash and Monero.<\/p>\n\n\n\n<p>In the coming months, we’ll share more research on this subject.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The purpose of this section is to keep you updated on the most important movements in the industry. The crypto markets move at a rapid pace and there is no&#8230;<\/p>\n","protected":false},"author":6,"featured_media":3668,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[9],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3667"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3667"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3667\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3668"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3667"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3667"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3667"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3667"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}