{"id":3684,"date":"2019-04-18T22:04:45","date_gmt":"2019-04-18T22:04:45","guid":{"rendered":"https:\/\/wavegp.com\/?p=3684"},"modified":"2021-01-21T19:50:12","modified_gmt":"2021-01-21T19:50:12","slug":"unraveling-the-ecosystem-financing-landscape","status":"publish","type":"post","link":"https:\/\/wavegp.com\/unraveling-the-ecosystem-financing-landscape\/","title":{"rendered":"Unraveling the Ecosystem Financing Landscape"},"content":{"rendered":"\n<p>Useful Info for Developers &amp; Founders to Access Strategic Capital<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"408\" src=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f92a1dc7b92c_0pwTGAfIdVfAZMtlw.jpg\" alt=\"\" class=\"wp-image-3685\" srcset=\"https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f92a1dc7b92c_0pwTGAfIdVfAZMtlw.jpg 800w, https:\/\/wavegp.com\/wp-content\/uploads\/2020\/11\/5ccc76413871f92a1dc7b92c_0pwTGAfIdVfAZMtlw-768x392.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/figure>\n\n\n\n<p>This is what navigating the ecosystem financing landscape feels like<\/p>\n\n\n\n<p>Ecosystem financing has become an increasingly important subject these days. Why?<\/p>\n\n\n\n<ol><li>Both the number of crypto funds and total Assets Under Management (“AUM”) have rapidly declined with cryptoasset prices<\/li><li>As the need for treasury management has become&nbsp;<a href=\"https:\/\/forum.aragon.org\/t\/clarifications-on-agp-41-acquisition-of-dots\/827\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">increasingly clear<\/a>, so has the importance of finding the most effective ways to deploy capital.<\/li><li>Maybe most importantly, a new generation of layer 1 smart contract platforms are launching and competition for high-quality developers and their applications is heating up<\/li><\/ol>\n\n\n\n<p>Ecosystem financing is strategic in nature and thus offers an important complement to purely financial investments made by venture capital funds. Grants and investments are a big part of a protocol’s limited toolkit to attract developer talent and build a dedicated and energized user base.<\/p>\n\n\n\n<p>Despite its importance to the industry, there is currently little to no research available on the ecosystem financing landscape and thus it remains obscure. Like most things in crypto, important information is scattered between hundreds of Medium posts, Github repositories, Twitter feeds, press releases, and foundation\/fund websites. Information is often confusing, outdated, and\/or contradictory.<\/p>\n\n\n\n<p>This is why I am releasing the&nbsp;<strong>Ecosystem Financing Landscape<\/strong>. Now developers and founders will have access to a single source of information that will hopefully help them identify new sources of capital to finance important work.<\/p>\n\n\n\n<h3><strong>Why Ecosystem Financing Matters<\/strong><\/h3>\n\n\n\n<h4><strong>The Rise and Fall of Crypto Funds<\/strong><\/h4>\n\n\n\n<p>In 2017 and 2018, the industry saw&nbsp;<a href=\"https:\/\/cryptofundresearch.com\/cryptocurrency-funds-overview-infographic\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">rapid growth<\/a>&nbsp;in the number of crypto-focused investment funds. However, given the steep decline in prices in 2018, we have already begun to witness&nbsp;<a href=\"https:\/\/www.marketwatch.com\/story\/how-bitcoins-meltdown-is-ravaging-hedge-funds-2018-11-21\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">a number of funds unwinding<\/a>. I expect more&nbsp;<a href=\"https:\/\/www.ccn.com\/crypto-hedge-funds-are-going-to-start-shutting-down-morgan-creek\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">fund closures in 2019<\/a>. Many funds posted terrible losses that will make it difficult to ever earn carry and as a result, I believe that their limited partners, dissatisfied with their returns, will begin to redeem capital.<\/p>\n\n\n\n<p>According to&nbsp;<a href=\"https:\/\/medium.com\/vision-hill-blog\/vision-hill-crypto-hedge-fund-returns-fourth-quarter-2018-a87d8c38d44\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Vision Hill Research<\/a>, as of Q4 2018 there were over 425 known crypto funds with approximately $4.5Bn in AUM (down around 25% from $6Bn in Q2 2018). Vision Hill estimates, that over 53% of that AUM is held with only the top 20 funds, meaning that the remaining 405 funds manage, on average, approximately $5m.*<\/p>\n\n\n\n<h4><strong>Ecosystem Financing is a Governance Issue<\/strong><\/h4>\n\n\n\n<p>Ecosystem financing and ongoing protocol funding has been a major theme of the last week as projects determine how to continue incentivizing building.&nbsp;<a href=\"https:\/\/medium.com\/@toms119\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Tom Shaughnessy<\/a>&nbsp;of Delphi Digital outlines some of the challenges and opportunities in this recent&nbsp;<a href=\"https:\/\/twitter.com\/Shaughnessy119\/status\/1116449686997610500\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Tweet Storm<\/a>.<\/p>\n\n\n\n<p><a href=\"https:\/\/blog.0xproject.com\/0x-roadmap-2019-part-4-proposal-for-stake-based-liquidity-incentive-52c16558df29\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">0x’s recent Stake-Based Liquidity Proposal<\/a>, ZEIP-31, includes a renewed focus on “sustainability” (aka incentivizing the 0x developer community via investments). ZEIP-31 recommends that a portion of 0x trading fees flow back into the 0x community treasury, which will be fully controlled and allocated by $ZRX token holders. The spirit of this proposal is similar to the creation of&nbsp;<a href=\"https:\/\/medium.com\/@simondlr\/the-moloch-dao-collapsing-the-firm-2a800b3aa2e7\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Moloch Dao<\/a>, a new kind of organization built to justly deploy grants to Ethereum developers.<\/p>\n\n\n\n<p>Without developer funding, protocols could end up like Grin, in which core developers struggle financially,&nbsp;<a href=\"https:\/\/grin-tech.org\/funding\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">operating only with the support of donations<\/a>. This model is unsustainable in the long run, so it is crucial for protocols to determine a governance model that properly incentivizes future core developers.<\/p>\n\n\n\n<p>Two other examples, Decred’s&nbsp;<a href=\"https:\/\/proposals.decred.org\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Politeia<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.stellar.org\/blog\/sdf-ecosystem-updates-lumen-distribution-programs\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Stellar’s Community Fund<\/a>&nbsp;both place the power of grants in the hands of their communities. While Decred votes for proposals on-chain, Stellar handles these votes off-chain. If you’d like to dive deeper into the difference between the two, check out my colleague&nbsp;<a href=\"https:\/\/medium.com\/@learner.roy\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Roy Learner<\/a>’s&nbsp;<a href=\"https:\/\/medium.com\/wave-financial\/blockchain-voter-apathy-69a1570e2af3\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">recent post<\/a>&nbsp;on voter apathy.<\/p>\n\n\n\n<h4><strong>Competition and Adoption<\/strong><\/h4>\n\n\n\n<p>Competition among incumbent smart contract platforms like Ethereum and soon to launch platforms like Polkadot is heating up.&nbsp;<a href=\"https:\/\/twitter.com\/ameensol\/status\/1116361514531704832?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed&amp;ref_url=http%3A%2F%2Fboards.messari.io%2Fboard%2F2d7fe93595e73d8e9125478fd764b9eb09750ca4c321d63c85f8e7802c1e42f8\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">#CryptoTwitter<\/a>&nbsp;is extra salty these days and tribalism seems to be at an all-time high.<\/p>\n\n\n\n<p>As&nbsp;<a href=\"https:\/\/medium.com\/@rbozman\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Regan Bozman<\/a>&nbsp;recently highlighted — adoption at the application layer has&nbsp;<a href=\"https:\/\/medium.com\/@rbozman\/the-applications-never-came-5089a196cbfb\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">failed to materialize<\/a>. There are a number of reasons behind this. For starters, we all know that existing Web3 infrastructure is insufficient and too costly for high throughput applications. In addition, key developer tools and layer 2 scaling solutions are not ready, though&nbsp;<a href=\"https:\/\/skalelabs.com\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">they are on the way<\/a>.<\/p>\n\n\n\n<p>Superior technology may not be enough to win this smart contract platform “war,” so teams are using every tool at their disposal to win developer attention. This includes deploying capital via foundations and funds. Winning developer mind share will likely have a positive impact on core protocol development into the future.<\/p>\n\n\n\n<p>Perhaps the&nbsp;<a href=\"https:\/\/www.usv.com\/blog\/fat-protocols\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">fat protocol thesis<\/a>&nbsp;will play out in the long term, but for now the flow of capital that originally poured into layer 1 is moving back up the stack to the application layer, which will be critical to drive users to these platforms.<\/p>\n\n\n\n<p><strong>Ethereum’s Tenuous Lead<\/strong><\/p>\n\n\n\n<p>According to the Electric Capital’s&nbsp;<a href=\"https:\/\/medium.com\/@ElectricCapital\/dev-report-476df4ff1fd2\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">recent developer report<\/a>, Ethereum maintains a meaningful lead in developer activity compared to other smart contract platforms (over 2x the monthly CORE developers as the next highest protocol, Bitcoin). Many attribute this to Ethereum’s first-mover advantage and the network effects created by its existing developer community.<\/p>\n\n\n\n<p>However, due to the&nbsp;<a href=\"https:\/\/blog.cosmos.network\/cosmos-hub-to-launch-mainnet-a453d2247a34\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">recent launch of Cosmos<\/a>, and the coming launch of Polkadot and other platforms, this may change. A minor flare-up that occurred last week within the Ethereum developer community highlights this perfectly. The Aragon team proposed that the ETH Foundation should&nbsp;<a href=\"https:\/\/forum.aragon.org\/t\/ethdao-governance\/747\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">place money in an Aragon DAO<\/a>, while they simultaneously explored&nbsp;<a href=\"https:\/\/forum.aragon.org\/t\/agp-42-keep-aragon-focused-on-ethereum-not-polkadot\/795\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">launching an Aragon parachain on Polkadot<\/a>.<\/p>\n\n\n\n<p>In addition, many underestimate the impact that ConsenSys had on the growth of the Ethereum community. Remember, ConsenSys deployed hundreds of millions of US dollar equivalent capital to dozens of startup companies and developers over the last two years.<\/p>\n\n\n\n<p>ConsenSys has been challenged lately,&nbsp;<a href=\"https:\/\/www.coindesk.com\/consensys-confirms-layoffs-projecting-13-of-staff-at-startups-to-be-cut\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">cutting 13% of its staff<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.theverge.com\/2018\/12\/20\/18150036\/consensys-layoffs-employees-pending-startup-ethereum\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">releasing a number of spokes<\/a>. These developers are looking for new homes and other smart contract platforms will welcome them with open arms.<\/p>\n\n\n\n<p>That said, Ethereum should not be underestimated. Consensys continues to deploy capital (recently announced&nbsp;<a href=\"https:\/\/www.crypto-economy.net\/en\/ethereum-eth-consensys-announces-tachyon-2-0-accelerator-program\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">their second Taychon cohort<\/a>) and the ETH Foundation invested over $2 million across 20 teams in&nbsp;<a href=\"https:\/\/blog.ethereum.org\/2018\/10\/15\/ethereum-foundation-grants-update-wave-4\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Wave IV of its Grant Program<\/a>&nbsp;last October. There seems to be plenty more where that came from and it is reported that Consensys is&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/consensys-looks-to-raise-200m-generated-21m-in-revenue-in-2018\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">raising a fresh $200 million<\/a>&nbsp;at a minimum $1 billion valuation.<\/p>\n\n\n\n<h3><strong>Navigating the Ecosystem Financing Landscape<\/strong><\/h3>\n\n\n\n<p>Developer activity is growing and near all-time highs, but real-world use cases still feel years away with the exception of&nbsp;<a href=\"https:\/\/www.kanaandkatana.com\/valuation-depot-contents\/2019\/4\/11\/the-case-for-a-small-allocation-to-bitcoin\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">crypto as a speculative asset class<\/a>. The long road to adoption will open many opportunities for savvy developers and founders to identify the existing shortfalls of the ecosystem and build solutions.<\/p>\n\n\n\n<p>However, amidst a prolonged bear market, and declining crypto fund AUM, many credible teams still struggle to find financing solutions.<\/p>\n\n\n\n<p>Ecosystem financing options seem to be one viable path forward. There are a number of well-capitalized protocols that are deploying grants and investments to build their ecosystem in a highly competitive environment.<\/p>\n\n\n\n<p>Ecosystem financing typically comes in two forms:<\/p>\n\n\n\n<ol><li><strong>Dilutive Capital<\/strong> — this includes venture investment and accelerator programs. Investors take ownership in an entity and invest for profit.<\/li><li><strong>Non-dilutive Capital<\/strong> — this includes protocol foundations and grant programs. No ownership is granted and there are no profit expectations, but different incentives for investors.<\/li><\/ol>\n\n\n\n<p>However, information on these financing programs is scattered and often contradictory, so this is a challenging landscape for entrepreneurs to navigate.<\/p>\n\n\n\n<h4><strong>EOS.VC A Case Study in Confusion<\/strong><\/h4>\n\n\n\n<p>One of the largest ecosystem development funds is&nbsp;<a href=\"https:\/\/vc.eos.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">EOS.VC<\/a>. Block One created EOS.VC which then announced&nbsp;<a href=\"https:\/\/vc.eos.io\/partners\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">partnerships with five outside venture capital firms<\/a>&nbsp;in early 2018 to deploy $725M into EOS-related infrastructure and dApps.<\/p>\n\n\n\n<p>With such deep pockets, EOS has the ability to take market share from Ethereum by offering large investments to companies that build on its protocol. Most recently, EOS partner Galaxy Digital&nbsp;<a href=\"https:\/\/bitcoinexchangeguide.com\/mythical-games-secures-16-million-led-by-galaxy-digital-and-javelin-to-create-new-era-of-player-owned-games\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">led a $15M investment round<\/a>&nbsp;into blockchain-based gaming company, Mythical Games.<\/p>\n\n\n\n<p>However, from an entrepreneur’s perspective securing investment from EOS.VC may be confusing and this is true of the ecosystem financing landscape at large. First, it is unclear who is truly in charge of the funds. In July 2018, only a few months after BlockOne announced its five independent partner funds, the company&nbsp;<a href=\"https:\/\/cryptovest.com\/news\/blockone-appoints-michael-alexander-of-jefferies-group\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">hired Michael Alexander<\/a>&nbsp;as the CEO of EOS.VC.<\/p>\n\n\n\n<p>Because there are multiple funds and little to no transparency into decision-making, it is difficult for teams to understand what to expect. For example, one of EOS.VC’s partner funds, Galaxy Digital,&nbsp;<a href=\"https:\/\/www.galaxydigital.io\/services\/principal-investments\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">also makes principal investments&nbsp;<\/a>off its balance sheet. If an entrepreneur is speaking to Galaxy for investment, does he\/she need to build on EOS? It is not 100% clear.<\/p>\n\n\n\n<p>In addition, information is constantly changing. For example, EOS.VC announced a partnership with&nbsp;<a href=\"https:\/\/block.one\/news\/block-one-and-tomorrow-blockchain-opportunities-announce-formation-of-eos-io-blockchain-focused-fund\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Tomorrow Blockchain<\/a>&nbsp;in January 2018, but if you&nbsp;<a href=\"https:\/\/vc.eos.io\/partners\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">search the EOS.VC website for partners<\/a>, TomorrowBC is nowhere to be found, while the four other partner funds remain. To date there has been no announcement of a meaningful change in the EOS.VC partner network.<\/p>\n\n\n\n<p>Finally, many in the industry wonder if capital alone is enough. Teams like Block.one also need to entice developers via other community building activities, marketing, hackathons, and ethos. This has been a challenge for EOS as developer activity on the core protocol has declined since launch.<\/p>\n\n\n\n<p>Believe it or not, I do not mean to pick on EOS.VC. In fact, it is one of the most transparent of the ecosystem development funds, which highlights exactly why I decided to consolidate all ecosystem financing information.<\/p>\n\n\n\n<h4><strong>Protocol Level-Risk<\/strong><\/h4>\n\n\n\n<p>Another, more cautionary example is that of the&nbsp;<a href=\"https:\/\/www.rchain.coop\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">RChain Protocol&nbsp;<\/a>and its ecosystem development fund,&nbsp;<a href=\"https:\/\/www.reflectiveventures.io\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Reflective Ventures<\/a>. The Reflective Ventures website states that the fund deployed $21 million into 21 companies that were interested in building on the RChain network. However, Reflective has since pivoted to become protocol agnostic and rebranded as&nbsp;<a href=\"http:\/\/counterpointeventures.com\/education-partners\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Counterpointe Ventures<\/a>.<\/p>\n\n\n\n<p>The website does not specify how Reflective’s investments were structured or the currency it used to make these investments. As The Block announced in December 2018, the&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/2018\/12\/20\/rchain-cooperative-functionally-bankrupt-after-questionable-deals-with-investors-and-developers-losing-faith\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">RChain Protocol is now “functionally bankrupt”<\/a>. Development on the protocol has all but ceased and the price of the native token, RHOC, declined over 95% from all time highs. With essentially zero liquidity, it is essentially a zombie protocol.<\/p>\n\n\n\n<p>If Reflective invested RHOC and portfolio companies did not immediately sell, were mandated not to sell (lock up), or were not sent the RHOC all up front (milestone-based financing \/ earn outs), then those investments, and as a result, those companies might be in trouble.<\/p>\n\n\n\n<p>It’s important to note that ecosystem financing is strategic capital that creates an alignment between the funded team and the native protocol. Receivers of grants and investments take the risk that the underlying protocol might fail.<\/p>\n\n\n\n<h4><strong>What Questions Should Developers &amp; Founders Ask?<\/strong><\/h4>\n\n\n\n<p>If you are a developer or founder seeking financing from an ecosystem fund or foundation, it is important to ask the right questions. The below questions are certainly not exhaustive, but may offer a reasonable starting point.<\/p>\n\n\n\n<ol><li>Is this an investment (dilutive capital with the expectation of profit) or is this a non-dilutive grant?<\/li><li>By taking your investment am I mandated to exclusively develop for your protocol or can I remain protocol agnostic?<\/li><li>If the answer to the above is exclusive, am I comfortable taking on the additional platform-level risk?<\/li><li>Do I lose my rights to any intellectual property that I develop?<\/li><li>Are you investing using your native token, fiat, a stablecoin, ETH, or BTC?<\/li><li>Is there a lockup on your investment capital?<\/li><li>Do you offer tech support to help us integrate into your protocol?<\/li><li>Is the financing milestone based?<\/li><li>Do you write follow-on checks?<\/li><li>What other value add can you offer (ie: BNB trading support)<\/li><\/ol>\n\n\n\n<h3><strong>Our Findings<\/strong><\/h3>\n\n\n\n<p>Our research identified 28 protocols that offer one or more forms of ecosystem financing. This includes 25 venture funds and accelerators that manage upwards of $1.6 billion and have funded over 100 companies to date. It also includes 20 foundations\/grant programs managing over $350 million assets that have funded dozens of developers and companies to date.<\/p>\n\n\n\n<p>This nearly $2bn AUM represents a whopping ~44% of Vision Hill’s estimated Q4 crypto hedge fund AUM, although the $2bn estimate is likely inflated. Many funds launched during late 2017 and early 2018 before the rapid decline in crypto prices. Therefore, it’s more than likely that actual AUM is meaningfully smaller than that listed here, but even so ecosystem financing should not be ignored.<\/p>\n\n\n\n<p>Our landscape includes the following fund and foundation information:<\/p>\n\n\n\n<ol><li>Name and Protocol<\/li><li>Key Contact<\/li><li>Representative Investments \/ Grants (either specific companies, tools, or services)<\/li><li>Investment Thesis (High-level fund goals)<\/li><li>Fund Size — as of last announcement<\/li><li>Range of Investment \/ Grant Sizes<\/li><li>Date of last publicly announced investment (proxy for a fund’s activity)<\/li><li>Website \/ Application Page<\/li><li>Medium &amp; Twitter Accounts<\/li><\/ol>\n\n\n\n<p>I may have made other mistakes, so if you are part of one of the teams represented in this landscape and identify inaccurate information, please reach out to help me correct it. I hope to keep updating this over time.<\/p>\n\n\n\n<p>If you are part of a team developing a protocol that is interested in launching your own ecosystem financing, or a company seeking ecosystem financing, I’d be happy to connect to further discuss my findings.<\/p>\n\n\n\n<p><em>*While Vision Hill does not track venture funds, I expect the AUM distribution to be similarly concentrated with a handful of leading funds such as a16z ($300m), Paradigm ($400m) and Pantera ($175m). This means the funding landscape for early-stage projects extremely scattered and hard to navigate.<\/em><\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<p><strong>DISCLAIMER:<\/strong><\/p>\n\n\n\n<p><em>This informational piece is intended to inform Wave Financial’s audience of the current status of the crypto industry. Nothing in this material should be interpreted as an offer or recommendation to buy, sell or hold any security or other financial product. Wave Financial LLC is a registered investment adviser, registered with the state of California. Registration with the SEC or state authority does not imply a certain level of skill or training. Additional information including important disclosures about Wave Financial LLC also is available on the SEC’s website at&nbsp;<\/em><a href=\"http:\/\/www.adviserinfo.sec.gov.\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"><em>www.adviserinfo.sec.gov.<\/em><\/a><em>&nbsp;Or, learn more information about Wave Financial at&nbsp;<\/em><a href=\"https:\/\/wavegp.com.\/\" target=\"_blank\" rel=\"noreferrer noopener\"><em>www.wavegp.com.<\/em><\/a><\/p>\n\n\n\n<p><em>Mr. Weinstein is a Principal at Wave Financial. The views expressed in this report reflect Mr. Weinstein’s personal views about the subject companies, platforms, issuers, security and non-security investments (“investments”) and not those of Wave Financial. Mr. Weinstein’s comments are not intended to be construed as recommendations or an offer to buy, sell or hold any investment. Mr. Weinstein’s compensation is not directly or indirectly related to the specific recommendations or views contained in the research report. The ecosystem landscape included in this post is intended to provide generalized guidance; nothing in this analysis is intended as investment advice, a recommendation or an introduction to particular funding or capital resource.<\/em><\/p>\n\n\n\n<p>Thanks to&nbsp;<a href=\"https:\/\/medium.com\/@learner.roy?source=post_page\" rel=\"nofollow noopener\" target=\"_blank\">Roy Learner<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/medium.com\/@AviFelman?source=post_page\" rel=\"nofollow noopener\" target=\"_blank\">Avi Felman<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Useful Info for Developers &amp; Founders to Access Strategic Capital This is what navigating the ecosystem financing landscape feels like Ecosystem financing has become an increasingly important subject these days&#8230;.<\/p>\n","protected":false},"author":6,"featured_media":3685,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[9],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3684"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3684"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3684\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3685"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3684"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3684"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3684"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3684"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}