{"id":3688,"date":"2019-05-02T22:07:49","date_gmt":"2019-05-02T22:07:49","guid":{"rendered":"https:\/\/wavegp.com\/?p=3688"},"modified":"2020-11-22T22:10:32","modified_gmt":"2020-11-22T22:10:32","slug":"fineqia-announces-investment-in-blockchain-focused-wave-financial-group","status":"publish","type":"post","link":"https:\/\/wavegp.com\/fineqia-announces-investment-in-blockchain-focused-wave-financial-group\/","title":{"rendered":"Fineqia Announces Investment in Blockchain-Focused Wave Financial Group"},"content":{"rendered":"\n<p>LONDON, May 2, 2019 \/PRNewswire\/ &#8211; Fineqia International Inc. (the &#8220;Company&#8221; or &#8220;Fineqia&#8221;) (CSE: FNQ) (OTC: FNQQF) (Frankfurt: FNQA) is pleased to announce its subsidiary, Fineqia Investments Limited, (&#8220;Fineqia Investments&#8221;) has taken an equity stake in Wave Financial Group, LLC (&#8220;Wave&#8221;).<\/p>\n\n\n\n<p>LONDON, May 2, 2019 \/PRNewswire\/ &#8211; Fineqia International Inc. (the &#8220;Company&#8221; or &#8220;Fineqia&#8221;) (CSE: FNQ) (OTC: FNQQF) (Frankfurt: FNQA) is pleased to announce its subsidiary, Fineqia Investments Limited, (&#8220;Fineqia Investments&#8221;) has taken an equity stake in Wave Financial Group, LLC (&#8220;Wave&#8221;).&nbsp;<\/p>\n\n\n\n<p>Based in Los Angeles, Wave undertakes early-stage investment, asset management, treasury management and strategy consulting to enhance the adoption of blockchain technologies worldwide. The investment gives Fineqia a stake in a team with significant knowledge, expertise and a worldwide network.&nbsp;<\/p>\n\n\n\n<p>Wave draws on the experience and discipline of early-stage investing of its CEO and founder David Siemer, who previously co-founded Wavemaker Partners (&#8220;Wavemaker&#8221;) that has nearly 15 years of investment and operating history. Wavemaker includes seven funds with Assets Under Management of $300 million and investments in more than 300 companies in the U.S. and Southeast Asia. David also founded Siemer &amp; Associates LLC., a technology focused investment bank, which he sold to CEC Capital in 2016.<\/p>\n\n\n\n<p>&#8220;We look forward to working with Fineqia to gain access to non-correlated, high-quality debt opportunities and continue growing our partnership as they continue to push the envelope around issuing Digital Asset backed bonds,&#8221; shared David Siemer, CEO.&nbsp;<\/p>\n\n\n\n<p>The transaction follows Fineqia Investments&#8217; earlier financings in blockchain insurance company, Black Insurance; blockchain-based asset registration and clearing solution, Nivaura Ltd; and premium finance Software-as-a-Service (SaaS) provider, PremFina Limited. Additionally, Fineqia has equity holding in Phunware Inc., a fully integrated enterprise cloud platform for mobile that provides products and services for brands worldwide.<\/p>\n\n\n\n<p>&#8220;Wave&#8217;s network and knowledge of both start-ups and corporates pursuing blockchain and crypto strategies is a huge asset for Fineqia,&#8221; said Bundeep Singh Rangar, CEO of Fineqia. &#8220;It fits in with our core business of placing debt and equity securities including those backed by crypto assets, soon to be tested within the UK regulator&#8217;s sandbox program.&#8221;<\/p>\n\n\n\n<p>Fineqia&#8217;s investment in Wave is in line with its strategy to invest in blockchain related companies that support its business model. Fineqia&#8217;s investment sum represents less than 5% of its market capitalisation.&nbsp;<\/p>\n\n\n\n<p>ABOUT FINEQIA INTERNATIONAL INC.<\/p>\n\n\n\n<p>Fineqia International Inc. is a listed entity in Canada (CSE: FNQ), the US (OTC: FNQQF) and Europe (Frankfurt: FNQA). Fineqia International outlines the Company&#8217;s corporate governance, culture, processes and relations by which the Company and its subsidiaries are controlled, directed and governed. It oversees and ensures the overall success, planning and growth of the Company and all of its subsidiaries and investments, including those propagating blockchain technologies. For more information visit:&nbsp;<a href=\"https:\/\/investors.fineqia.com\/news\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">https:\/\/investors.fineqia.com\/news<\/a>.<\/p>\n\n\n\n<p>ABOUT FINEQIA INVESTMENTS LTD<\/p>\n\n\n\n<p>Fineqia Investments Ltd is a wholly-owned subsidiary of Fineqia International set up to hold the Company&#8217;s growing portfolio of blockchain, fintech and cryptocurrency technology companies worldwide.<\/p>\n\n\n\n<p>About Wave Financial Group<\/p>\n\n\n\n<p>Wave Financial is a leading diversified digital asset management company, offering early-stage investment, treasury management and asset management strategies &amp; indices to further the growth of the digital asset ecosystem. Led by CEO, David Siemer and President &amp; Managing Partner, Benjamin Tsai, the Wave Financial team is pioneering the bridge between traditional asset management within a new paradigm of digital assets.<\/p>\n\n\n\n<p>FORWARD-LOOKING STATEMENTS<\/p>\n\n\n\n<p>Some statements in this release may contain forward-looking information (as defined under applicable Canadian securities laws) (&#8220;forward-looking statements&#8221;). All statements, other than of historical fact, that address activities, events or developments that Fineqia (the &#8220;Company&#8221;) believes, expects or anticipates will or may occur in the future (including, without limitation, statements regarding potential acquisitions and financings) are forward-looking statements. Forward-looking statements are generally identifiable by use of the words &#8220;may&#8221;, &#8220;will&#8221;, &#8220;should&#8221;, &#8220;continue&#8221;, &#8220;expect&#8221;, &#8220;anticipate&#8221;, &#8220;estimate&#8221;, &#8220;believe&#8221;, &#8220;intend&#8221;, &#8220;plan&#8221; or &#8220;project&#8221; or the negative of these words or other variations on these words or comparable terminology. Forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond the Company&#8217;s ability to control or predict, that may cause the actual results of the Company to differ materially from those discussed in the forward-looking statements. Factors that could cause actual results or events to differ materially from current expectations include, among other things, without limitation, the failure to obtain sufficient financing, and other risks disclosed in the Company&#8217;s public disclosure record on file with the relevant securities regulatory authorities. Any forward-looking statement speaks only as of the date on which it is made except as may be required by applicable securities laws. The Company disclaims any intent or obligation to update any forward-looking statement except to the extent required by applicable securities laws.<\/p>\n\n\n\n<p>SOURCE Fineqia International Inc.<a href=\"https:\/\/wavegp.com\/media\/fineqia-announces-investment-in-blockchain-focused-wave-financial-group#\">Cision<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>LONDON, May 2, 2019 \/PRNewswire\/ &#8211; Fineqia International Inc. (the &#8220;Company&#8221; or &#8220;Fineqia&#8221;) (CSE: FNQ) (OTC: FNQQF) (Frankfurt: FNQA) is pleased to announce its subsidiary, Fineqia Investments Limited, (&#8220;Fineqia Investments&#8221;)&#8230;<\/p>\n","protected":false},"author":6,"featured_media":3689,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3688"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3688"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3688\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3689"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3688"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3688"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3688"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3688"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}