{"id":3691,"date":"2019-05-10T22:12:39","date_gmt":"2019-05-10T22:12:39","guid":{"rendered":"https:\/\/wavegp.com\/?p=3691"},"modified":"2020-11-22T22:12:55","modified_gmt":"2020-11-22T22:12:55","slug":"wave-financial-announces-select-20-index-to-track-performance-of-cryptocurrency-asset-classes","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-announces-select-20-index-to-track-performance-of-cryptocurrency-asset-classes\/","title":{"rendered":"Wave Financial Announces Select 20 Index to Track Performance of Cryptocurrency Asset Classes"},"content":{"rendered":"\n<p>Wave Financial Group, a diversified holding investment and asset management firm that is focused on digital assets and blockchain technology, announced on Thursday the launch of its Select 20 Index, which will track performance of cryptocurrency asset classes<\/p>\n\n\n\n<p><a href=\"https:\/\/wavegp.com\/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Wave Financial Group<\/strong><\/a>, a diversified holding investment and asset management firm that is focused on digital assets and blockchain technology, announced on Thursday the launch of its Select 20 Index, which will track performance of cryptocurrency asset classes. According to Wave, the Wave Select 20 Index provides exposure to the top 20 cryptocurrencies weighted by market capitalization, which includes privacy tokens and stablecoin, and rebalances monthly.<\/p>\n\n\n\n<p>“The index currently captures over 93% of the total cryptocurrency market capitalization, and aims to provide superior pure beta (market) exposure. The index’s largest components include current market leaders, such as Bitcoin (BTC), Ethereum (ETH) and Ripple (XRP). Its smallest holdings include a number of fringe currencies, such as Basic Attention Token (BAT) and NEM (XEM). The index is constructed to be tradable.”<\/p>\n\n\n\n<p>While sharing more details about the index, &nbsp;David Siemer, CEO of Wave Financial, observed:<\/p>\n\n\n\n<p>“Even as sophisticated and institutional investors increasingly diversify their holdings to include digital assets, there are few complete ways to effectively track the cryptocurrency market. We designed the index to reflect not only the performance of leaders such as Bitcoin, but also emerging assets which offer positive upside as their adoption increases. Through monthly rebalancing, the index simplifies tracking the health of the cryptocurrency asset class and can adapt to rapid shifts in the marketplace.”<\/p>\n\n\n\n<p>Wave added that the index was designed using a rigorous framework to reduce turnover and risk, and Wave monitors the index holdings monthly to ensure that it includes the largest crypto assets by market capitalization. Select 20 excludes stablecoins pegged to fiat currencies, as they do not move with the market. The index also excludes privacy coins to avoid exposure to regulatory issues in certain countries.<a href=\"https:\/\/wavegp.com\/media\/wave-financial-announces-select-20-index-to-track-performance-of-cryptocurrency-asset-classes-2#\">Crowdfund Insider<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Wave Financial Group, a diversified holding investment and asset management firm that is focused on digital assets and blockchain technology, announced on Thursday the launch of its Select 20 Index,&#8230;<\/p>\n","protected":false},"author":6,"featured_media":3692,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3691"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3691"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3691\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3692"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3691"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3691"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3691"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3691"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}