{"id":3694,"date":"2019-05-10T22:14:26","date_gmt":"2019-05-10T22:14:26","guid":{"rendered":"https:\/\/wavegp.com\/?p=3694"},"modified":"2020-11-22T22:18:04","modified_gmt":"2020-11-22T22:18:04","slug":"wave-financial-announces-select-20-index-to-track-performance-of-cryptocurrency-asset-classes-2","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-announces-select-20-index-to-track-performance-of-cryptocurrency-asset-classes-2\/","title":{"rendered":"Wave Financial Announces Select 20 Index to Track Performance of Cryptocurrency Asset Classes"},"content":{"rendered":"\n<p>The Wave Select 20 Index provides exposure to the top 20 crypto currencies weighted by market capitalization, excluding privacy tokens and stablecoin, and rebalances monthly.<\/p>\n\n\n\n<p>LOS ANGELES, CA, May 10, 2019 (GLOBE NEWSWIRE) &#8212; (via&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=7c4Xryfw6MMT4NYZJQg_dRnLqzbC8e1sx7WJWcxob_ebvMBcABixqQfM4Iu8FameQZNSlHV87LT6NkGwXXtaRkQlShmeURsAZCzCYrzq2YE=\" rel=\"nofollow noopener\" target=\"_blank\">Blockchain Wire<\/a>&nbsp;)&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=iZzZ1oxBrKq94JL4giVEW-qknAhBaXyZVxC4ERMo6zk0-AGa4Dv64Qa0Xhx946bLEoTww1o0owgrW4rR8zWxC6JfRDMh7NVUGmGYez8C_dM=\" rel=\"nofollow noopener\" target=\"_blank\">Wave Financial Group<\/a>, a leading diversified holding investment and asset management firm focused on digital assets and blockchain technology, today announced that it has formally launched an algorithmic, rules-based index which tracks nearly all of the cryptocurrency market. The&nbsp;<a href=\"https:\/\/www.globenewswire.com\/Tracker?data=esZcmD4xrAD_NunrApMj2vTWZsQrdgs9Hk2SqJ10CLkM-BRIBLrqcwR4e1rbWsylSDJ4wf320IKTTzdOAqQaZ16l7Sivz5Oi2aA2voms6nNGwhWn40oJW1BPLgswXZPL\" rel=\"nofollow noopener\" target=\"_blank\">Wave Select 20 Index<\/a>&nbsp;provides exposure to the top 20 crypto currencies weighted by market capitalization, excluding privacy tokens and stablecoin, and rebalances monthly. The index currently captures over 93% of the total cryptocurrency market capitalization, and aims to provide superior pure beta (market) exposure. The index’s largest components include current market leaders, such as Bitcoin (BTC), Ethereum (ETH) and Ripple (XRP). Its smallest holdings include a number of fringe currencies, such as Basic Attention Token (BAT) and NEM (XEM). The index is constructed to be tradable.<\/p>\n\n\n\n<p>“Even as sophisticated and institutional investors increasingly diversify their holdings to include digital assets, there are few complete ways to effectively track the cryptocurrency market,” said David Siemer, CEO of Wave Financial. “We designed the index to reflect not only the performance of leaders such as Bitcoin, but also emerging assets which offer positive upside as their adoption increases. Through monthly rebalancing, the index simplifies tracking the health of the cryptocurrency asset class and can adapt to rapid shifts in the marketplace.”<\/p>\n\n\n\n<p>The index was designed using a rigorous framework to reduce turnover and risk, and Wave monitors the index holdings monthly to ensure that it includes the largest crypto assets by market capitalization. Select 20 excludes stablecoins pegged to fiat currencies, as they do not move with the market. The index also excludes privacy coins to avoid exposure to regulatory issues in certain countries.<\/p>\n\n\n\n<p>Given the evolving nature of digital assets and decisions made by blockchain project leaders, Select 20 also accounts for the future possibility of forking and airdrops of index components. In the event that a fork occurs to a cryptocurrency, the value of the fork will be included in the index as an additional token until the next rebalancing date, when it can be rebalanced out of the index. If the value of the token is less than 15% of the value of the main chain, uncertain or cannot be determined, it will be calculated at zero value.<\/p>\n\n\n\n<p>In the event that an airdrop occurs, the newly airdropped tokens will generally not be included in the index.<\/p>\n\n\n\n<p>“We are committed to bridging traditional asset management to what we view as the future of finance. In developing the Wave Select 20 Index, we are excited to have created a usable market benchmark to address that unique investing need,” added Benjamin Tsai, President of Wave Financial. “Our team of experts carefully considered what would best meet the investment demands of sophisticated investors, while also staying up-to-date with the rapid technical, regulatory and strategic factors shaping the cryptocurrency marketplace.”<\/p>\n\n\n\n<p>Using an inception date of February 1, 2019, and a base value of $100, the index has risen 48.17% as of May 1, 2019.<\/p>\n\n\n\n<p>Risk Disclosure<\/p>\n\n\n\n<p>Index Related Performance of an index is not illustrative of any particular investment. The Wave Select 20 Index represents a hypothetical, back-tested, and unaudited return-stream that does not represent the returns of an actual account. Actual returns may differ materially from hypothetical, backtested returns. Back-testing is calculated by retroactively applying an Index-weighting methodology to the historical data. Digital asset selection for index fund will be based on reasonably available data and is also subject to necessary judgement calls by management given data supply problems that currently exist in the crypto currency sector.<\/p>\n\n\n\n<p>About Wave<\/p>\n\n\n\n<p><a href=\"https:\/\/www.globenewswire.com\/Tracker?data=iZzZ1oxBrKq94JL4giVEWwt9Pn6xARNVL2Nfd3Ukh9YY6iNjafijhyqAvvK7Dys2AGyVOoF5XKmLkxnEmH41qA==\" rel=\"nofollow noopener\" target=\"_blank\">Wave Financial<\/a>&nbsp;Group is a holding company providing investment and asset management focused on the rapidly growing digital asset and blockchain ecosystem. Led by veteran investors in the venture capital, commodity, and alternative asset fields, the Wave group of companies offers accredited and institutional investors a bridge between traditional asset management and the future of finance.<\/p>\n\n\n\n<p>The Wave group of companies offer strategic products and services structured to provide liquidity and access to established cryptocurrencies as well as rapidly growing projects. Its innovative Wave Select 20 Index, which tracks the performance of nearly the entire cryptocurrency market (excluding privacy tokens and stablecoins), is weighted by market capitalization, and underpins funds available to accredited and international investors.<\/p>\n\n\n\n<p>Wave Financial is a Registered Investment Advisor (CRD#292343) and also provides treasury management services and consultation to investors and businesses in the digital asset ecosystem.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Wave Select 20 Index provides exposure to the top 20 crypto currencies weighted by market capitalization, excluding privacy tokens and stablecoin, and rebalances monthly. LOS ANGELES, CA, May 10,&#8230;<\/p>\n","protected":false},"author":6,"featured_media":3697,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3694"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3694"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3694\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3697"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3694"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3694"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3694"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3694"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}