{"id":3714,"date":"2019-06-04T22:31:38","date_gmt":"2019-06-04T22:31:38","guid":{"rendered":"https:\/\/wavegp.com\/?p=3714"},"modified":"2020-11-22T22:47:57","modified_gmt":"2020-11-22T22:47:57","slug":"wave-financial-names-henry-k-elder-director-of-investment-strategy","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-names-henry-k-elder-director-of-investment-strategy\/","title":{"rendered":"Wave Financial Names Henry K. Elder Director of Investment Strategy"},"content":{"rendered":"\n<p>Expert on asset structuring and tokenization to spearhead firm&#8217;s product distribution<\/p>\n\n\n\n<p>LOS ANGELES, June 4, 2019 \/PRNewswire\/ &#8212;&nbsp;<a target=\"_blank\" href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2487049-1&amp;h=1635010221&amp;u=https%3A%2F%2Fwavegp.com%2F&amp;a=Wave+Financial+Group\" rel=\"noreferrer noopener\">Wave Financial Group<\/a>, a leading diversified investment and asset management firm focused on digital assets and blockchain technology, is pleased to announce the hiring of Henry K. Elder as Director of Investment Strategy. Elder brings an extensive background in structuring investment products backed by physical assets as well as asset tokenization, and will be responsible for managing client relationships and product strategy.<\/p>\n\n\n\n<p>Elder will lead the distribution of Wave&#8217;s investment products globally with a focus on Europe and the Middle East. He will report to Wave&#8217;s President and Managing Partner, Benjamin Tsai and work closely with the product structuring team.<\/p>\n\n\n\n<p>Elder currently serves as the President of the International Blockchain Real Estate Association (IBREA), an organization dedicated to supporting the adoption of blockchain technology in the real estate industry. Prior to joining Wave, Elder co-founded Digital Asset Advisors, a leading blockchain consultancy headquartered in Los Angeles. In early 2018, as Director of Origination &amp; Investment at Slice, he oversaw the tokenization of one of the first commercial properties in the United States.<\/p>\n\n\n\n<p>&#8220;Henry brings a wealth of experience in asset tokenization and an extensive network of professional connections in the blockchain industry,&#8221; said Tsai. &#8220;He will fill an important role as a liaison to our growing roster of clients, and his hire will better position Wave to take advantage of opportunities to tokenize high-demand alternative assets that we expect to appreciate in value.&#8221;<\/p>\n\n\n\n<p>&#8220;I was an early adopter of blockchain and have confidence in its ability to disrupt traditional industries,&#8221; said Elder. &#8220;I am thrilled to have the opportunity to apply my expertise in tokenization and financial product strategy at Wave and help bridge the divide between traditional investors and the future of finance.&#8221;<\/p>\n\n\n\n<p><strong>About Wave<\/strong><\/p>\n\n\n\n<p><a target=\"_blank\" href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2487049-1&amp;h=1635010221&amp;u=https%3A%2F%2Fwavegp.com%2F&amp;a=Wave+Financial+Group\" rel=\"noreferrer noopener\">Wave Financial Group<\/a>&nbsp;is a holding company providing investment and asset management focused on the rapidly growing digital asset and blockchain ecosystem. Led by veteran investors in the venture capital, commodity, and alternative asset fields, the Wave group of companies offers accredited and institutional investors a bridge between traditional asset management and the future of finance.<\/p>\n\n\n\n<p>The Wave group of companies offer strategic products and services structured to provide liquidity and access to established cryptocurrencies as well as rapidly growing projects. Its innovative Wave Select 20 Index, which tracks the performance of nearly the entire cryptocurrency market (excluding privacy tokens and stablecoins), is weighted by market capitalization, and underpins funds available to accredited and international investors.<\/p>\n\n\n\n<p>Wave Financial LLC is a Registered Investment Advisor (CRD#292343) and also provides treasury management services and consultation to investors and businesses in the digital asset ecosystem.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Expert on asset structuring and tokenization to spearhead firm&#8217;s product distribution LOS ANGELES, June 4, 2019 \/PRNewswire\/ &#8212;&nbsp;Wave Financial Group, a leading diversified investment and asset management firm focused on&#8230;<\/p>\n","protected":false},"author":6,"featured_media":3717,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3714"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3714"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3714\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/3717"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3714"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3714"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3714"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3714"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}