{"id":3744,"date":"2019-09-19T23:05:35","date_gmt":"2019-09-19T23:05:35","guid":{"rendered":"https:\/\/wavegp.com\/?p=3744"},"modified":"2020-11-22T23:07:06","modified_gmt":"2020-11-22T23:07:06","slug":"wave-financial-launches-world-first-bitcoin-yield-fund-wave-btc-income-growth-digital-fund","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-launches-world-first-bitcoin-yield-fund-wave-btc-income-growth-digital-fund\/","title":{"rendered":"Wave Financial Launches World-First Bitcoin Yield Fund: Wave BTC Income &#038; Growth Digital Fund"},"content":{"rendered":"\n<p>Wave BTC Income &amp; Growth Digital Fund, Ltd, the first crypto derivatives-based yield fund on the market.<\/p>\n\n\n\n<p>LOS ANGELES, Sept. 19, 2019 \/PRNewswire\/ &#8212; <a href=\"\/\" target=\"_blank\" aria-label=\" (opens in a new tab)\" rel=\"noreferrer noopener\" class=\"rank-math-link\">Wave Financial LLC<\/a> (Wave), a leading asset management firm focused on digital assets, today announced that it has launched the <strong>Wave BTC Income &amp; Growth Digital Fund, Ltd, <em>the first crypto derivatives-based yield fund on the market<\/em>.<\/strong><\/p>\n\n\n\n<p>Wave BTC Income &amp; Growth Digital Fund is a British Virgin Islands incorporated fund that holds Bitcoin (BTC).&nbsp;<strong><em>The investment objective is to generate yield by selling call options on BTC held in the Fund.<\/em><\/strong>&nbsp;The Fund expects such option sales to generate attractive premiums due to BTC&#8217;s high volatility, which should provide a stream of&nbsp;<strong>income<\/strong>that can be paid out monthly.<\/p>\n\n\n\n<p>The Fund aims to distribute a dividend of 1.5% of NAV per month, which, if achieved, would result in an 18% target annual yield. Excess premium above the target yield, minus a performance fee, would be credited back to the Fund to purchase more BTC, contributing to the&nbsp;<strong>growth<\/strong>&nbsp;of NAV. The Fund would generate this premium by selling call options with strikes higher than the current price, which also leaves room for investors to capture potential BTC upside. Fidelity Digital Assets will provide custody for the Fund&#8217;s BTC.<\/p>\n\n\n\n<p>&#8220;For high net worth investors, appetite for innovative yield product with upside potential is strong. &nbsp;This product monetizes higher volatility of BTC to deliver yield, independent of the interest rate environment, while keeping some upside exposure,&#8221; said Benjamin Tsai, President of Wave.<\/p>\n\n\n\n<p>For investors that are interested,&nbsp;<strong>Wave BTC Income &amp; Growth Digital Fund<\/strong>&nbsp;will issue Fund Tokens based on cryptographic technologies similar to those used for creation and transfer of select virtual currencies. Wave anticipates that Tokens will be able to be traded on alternative trading systems at a later date.&nbsp;<\/p>\n\n\n\n<p>&#8220;The mission of Wave is to provide investors with diversified exposure to crypto assets,&#8221; said David Siemer, CEO of Wave. &#8220;This is an alternative way to hold BTC exposure.&#8221;<\/p>\n\n\n\n<p>Potential investors should be aware that an investment in Fund\/Tokens involves a high degree of risk. Please read the private placement memorandum carefully for a discussion of the most significant risks to such an investment.<\/p>\n\n\n\n<p>An investment in Fund\/Tokens is suitable only for sophisticated investors who have experience investing in private funds employing the Fund&#8217;s strategies, are familiar with investing in and trading Crypto Assets and can afford the loss of their entire investment in Fund\/Tokens.<\/p>\n\n\n\n<p>The Fund will sell Fund\/Tokens only outside the United States to non-US persons in compliance with Regulation S under the Securities Act of 1933 or, within the United States, only to &#8220;accredited investors&#8221; within the meaning of Rule 501(a) of Regulation D under the Securities Act, pursuant to an exemption from registration provided by Rule 506(c) of Regulation D. The Fund\/Tokens are only available for purchase through the Fund or broker\/dealers engaged by Wave on behalf of the Fund. For additional information, please contact&nbsp;<a target=\"_blank\" href=\"mailto:operations@wavegp.com\" rel=\"noreferrer noopener\">operations@wavegp.com<\/a>.<\/p>\n\n\n\n<p>The offer and sale of the Fund Tokens, the Fund, and its managers are not and will not be registered with the Securities and Exchange Commission, and are not subject to disclosure and certain other requirements mandated by U.S. federal securities laws, and investors therefore will not benefit from the protection of such laws. This press release does not constitute an offer to sell or a solicitation of an offer to purchase any securities in the United States or in any other jurisdictions. Offers to sell the Fund Tokens are made solely pursuant to the Fund&#8217;s private placement memorandum.<\/p>\n\n\n\n<p>Forward-Looking Statements<\/p>\n\n\n\n<p>This press release contains &#8220;forward-looking statements&#8221;. &nbsp;Forward-looking statements can be identified by words like, &#8220;would,&#8221; &#8220;should,&#8221; &#8220;expect,&#8221; &#8220;anticipate,&#8221; and similar expressions. &nbsp;Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on our current beliefs, expectations and assumptions regarding the future of our business, future plans and strategies, projections, anticipated events and trends, the economy and other future conditions. &nbsp;Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict and many of which are outside of our control. Our actual results and financial condition may differ materially from those indicated in the forward-looking statements. &nbsp;Therefore, you should not rely on any of these forward-looking statements. Important factors that could cause our actual results and financial condition to differ materially from those indicated in the forward-looking statements include, among others, changes in the condition of the U.S. and global economy and, in particular, the global currency and financial markets.<\/p>\n\n\n\n<p>The forward-looking statements included in this press release are made only as of the date of this release, and except as otherwise required by federal securities law, the Fund does not have any obligation to publicly update or revise any forward-looking statements to reflect subsequent events or circumstances.<\/p>\n\n\n\n<p><strong>About Wave<\/strong><\/p>\n\n\n\n<p><a href=\"\/\" class=\"rank-math-link\">Wave Financial<\/a> provides investment advice and asset management focused on the rapidly growing digital asset ecosystem. Led by veteran investors in venture capital, commodity and alternative asset fields, Wave offers accredited and institutional investors a bridge between traditional asset management and the future of finance.<\/p>\n\n\n\n<p>Wave Financial is a Registered Investment Advisor (CRD#292343) in California, and provides treasury management services and consultation to investors and businesses in the digital asset ecosystem.<\/p>\n\n\n\n<p>‍<\/p>\n\n\n\n<p>Media Contact:<\/p>\n\n\n\n<p>Jessica Gilbert<\/p>\n\n\n\n<p>Jessica@wavegp.com<\/p>\n\n\n\n<p>833-331-9283<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Wave BTC Income &amp; Growth Digital Fund, Ltd, the first crypto derivatives-based yield fund on the market. LOS ANGELES, Sept. 19, 2019 \/PRNewswire\/ &#8212; Wave Financial LLC (Wave), a leading asset management&#8230;<\/p>\n","protected":false},"author":6,"featured_media":892,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3744"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3744"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/3744\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/892"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3744"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=3744"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=3744"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=3744"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}