{"id":6492,"date":"2021-06-02T21:21:03","date_gmt":"2021-06-02T21:21:03","guid":{"rendered":"https:\/\/wavegp.com\/?p=6492"},"modified":"2021-06-02T21:23:49","modified_gmt":"2021-06-02T21:23:49","slug":"digital-asset-manager-wave-financial-crosses-500-million-aum-landmark-2","status":"publish","type":"post","link":"https:\/\/wavegp.com\/digital-asset-manager-wave-financial-crosses-500-million-aum-landmark-2\/","title":{"rendered":"Digital Asset Manager Wave Financial Crosses $500 Million AUM Landmark"},"content":{"rendered":"\n<p><strong><em>&#8211; Regulated digital asset manager experiences rapid growth of AUM in its wealth &amp; treasury management and funds divisions&nbsp;<\/em><\/strong><\/p>\n\n\n\n<p><strong><em>&#8211; Income and capital growth strategies attract assets from HNWIs, family offices and blockchain protocols&nbsp;<\/em><\/strong><\/p>\n\n\n\n<p><em>26 May 2021, Los Angeles and New York, US \/ London, UK<\/em>.<a href=\"https:\/\/wavegp.com\/\"> Wave Financial<\/a> LLC (Wave), the Registered Investment Advisor for digital assets, is pleased to announce that it has just crossed $500 million of AUM for the first time since being founded in 2018.&nbsp;<\/p>\n\n\n\n<p>“Wave is one of the only cryptocurrency-focused registered investment advisors serving high-net-worth clients and institutions seeking individually tailored wealth management strategies – we believe this has been a major contributor to hitting our AUM milestone,” said Les Borsai, Chief Strategist and Co-Founder of Wave. “We set up Wave to bridge the divide between the traditional investment management space and crypto assets, and we believe Wave’s growth demonstrates that there is a seismic move by HNWIs, family offices, and institutional investors into digital assets.”<\/p>\n\n\n\n<p>Wave’s wealth and treasury management division has been a significant contributor to this growth; the division provides bespoke portfolio solutions and services for blockchain protocols, corporates and high-net-worth individuals (HNWI). Wave has also experienced rapid growth within its suite of funds in new investments, which includes a 2020 TADS award-winning fund.<\/p>\n\n\n\n<p>&nbsp;“Wave is attracting investors from around the globe looking for crypto asset exposure,” continued Borsai. “Our ability to provide ‘white-glove’ service, secure custody, and timely reporting to our clients is a primary growth driver in this space.”<\/p>\n\n\n\n<p>Beyond its fund product offerings, Wave manages the fiat currency and native token treasuries of large protocols and crypto companies by providing leading edge staking, lending, and derivative yield strategies, and liquidity services. This reflects the growing demand from not only cryptocurrency firms and foundations, but also traditional financial services firms, to have their treasuries managed by highly experienced teams of investment managers and federally regulated fiduciaries. Wave is federally regulated by the US Securities &amp; Exchange Commission as a registered investment adviser.<\/p>\n\n\n\n<p>“Our focus on institutional quality investment management, along our highly experienced team which hails from some of the most respected traditional firms, gives our clients confidence that even though we operate in a new and volatile sector, their assets are in skilled hands,” said David Siemer, CEO and Co-Founder of Wave. “As the digital asset space continues to grow, traditional financial services firms and HNWIs are looking for firms that are regulated and have reputable track records such as Wave to manage their assets in both fund and bespoke solutions.”<\/p>\n\n\n\n<p>Wave also works with institutional custodians and offers sophisticated yield and alpha strategies for investors who want to put crypto assets to work. Digital assets entrusted to Wave typically reside with world-class qualified custodians like Fidelity Digital Assets, Coinbase Custody, and Copper Technology.<\/p>\n\n\n\n<p>By applying traditional investment techniques to digital assets via its three product divisions of investment funds, wealth management, and venture capital, the Wave family of companies is increasing its AUM rapidly due to growing interest from investors who demand regulated, sophisticated and bespoke portfolio management solutions for digital assets.  <\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8211; Regulated digital asset manager experiences rapid growth of AUM in its wealth &amp; treasury management and funds divisions&nbsp; &#8211; Income and capital growth strategies attract assets from HNWIs, family&#8230;<\/p>\n","protected":false},"author":6,"featured_media":6477,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/6492"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=6492"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/6492\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/6477"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=6492"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=6492"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=6492"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=6492"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}