{"id":6569,"date":"2021-06-17T08:26:57","date_gmt":"2021-06-17T08:26:57","guid":{"rendered":"https:\/\/wavegp.com\/?p=6569"},"modified":"2021-06-17T08:33:07","modified_gmt":"2021-06-17T08:33:07","slug":"wave-financial-nears-launch-of-second-tokenized-real-asset-fund-tapping-whiskey-market","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-nears-launch-of-second-tokenized-real-asset-fund-tapping-whiskey-market\/","title":{"rendered":"Wave Financial Nears Launch of Second Tokenized Real Asset Fund Tapping Whiskey Market"},"content":{"rendered":"\n<ul><li><em>Leading asset manager expands suite of tokenized whiskey portfolios leveraging digital assets and blockchain<\/em><\/li><li><em>New fund will serve the increased investor appetite for high-performing whiskey market<\/em><\/li><\/ul>\n\n\n\n<p><em>16 June 2021, Los Angeles and New York, US \/ London, UK<\/em> &#8211; <a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=2585513-1&amp;h=761891768&amp;u=https:\/\/wavegp.com\/&amp;a=Wave+Financial+LLC\">Wave Financial LLC<\/a>&nbsp;(Wave), the Investment Advisor for digital assets, today announced the second iteration of Wave Kentucky Whiskey Digital Fund will open to investors in June 2021.<\/p>\n\n\n\n<p>In 2020, Wave created the world’s first tokenized portfolios of whiskey barrels that capture the value appreciation associated with the spirits’ aging process. The Wave Kentucky Whiskey 2020 Digital Fund closed in December 2020 with over 2700 barrels included in the portfolio, which its projections suggest may increase in value by three to five times over five years.<\/p>\n\n\n\n<p>“We are thrilled to introduce a second fund of this nature and offer investors another path to access an otherwise hard-to-reach asset class,” said Benjamin Tsai, President and Managing Partner of Wave Financial Group. “By leveraging digital tokens that represent shares in the fund, investors will be able to trade on a regulated crypto exchange as the barrels appreciate in value over time.”<\/p>\n\n\n\n<p>Similar to the first iteration of the fund, the 2021 iteration will include Kentucky bourbon and rye whiskey from Wilderness Trail Distillery, a heritage member of the Kentucky Distillers’ Association and member of the world-famous Kentucky Bourbon Trail.&nbsp; Depending on demand, additional distilleries may be added to diversify the exposure.<\/p>\n\n\n\n<p>By investing in the fund, investors will be able to capitalize on the Kentucky whiskey market in an asset class that has potential to appreciate significantly during the spirits’ aging process. The anticipated alpha generation potential of the fund is designed to replicate its 2020 predecessor, which has a net asset value of +9.2% as of Q1 2021.&nbsp;<\/p>\n\n\n\n<p>“We continue to produce innovative approaches to modern investing by assigning fractional ownership of tangible assets via tokenization,” said Tsai. “Following the success of the initial Whiskey Fund in 2020, this new offering further validates our investment model.”<\/p>\n\n\n\n<p>To learn more about the Wave Kentucky Whiskey Digital Fund, please visit <a href=\"https:\/\/wavegp.com\">wavegp.com<\/a>.&nbsp;<\/p>\n\n\n\n<p>About Wave Financial<\/p>\n\n\n\n<p>Wave Financial LLC (Wave) is a Los Angeles and London based investment management company that provides institutional and private wealth digital asset solutions. Led by a team of highly experienced financial services professionals, Wave provides investable funds via their diverse investment strategies applied to digital assets and tokenized real assets. Wave also offers managed accounts for HNWIs and family offices seeking tailored digital asset exposure, bespoke treasury management services, and early-stage venture capital and strategic consultation to the digital asset ecosystem. Wave is federally regulated by the US Securities &amp; Exchange Commission as an investment adviser.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Leading asset manager expands suite of tokenized whiskey portfolios leveraging digital assets and blockchain New fund will serve the increased investor appetite for high-performing whiskey market 16 June 2021, Los&#8230;<\/p>\n","protected":false},"author":6,"featured_media":6572,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[20],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/6569"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=6569"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/6569\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/6572"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=6569"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=6569"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=6569"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=6569"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}