{"id":6582,"date":"2021-06-22T21:08:50","date_gmt":"2021-06-22T21:08:50","guid":{"rendered":"https:\/\/wavegp.com\/?p=6582"},"modified":"2022-03-24T16:56:18","modified_gmt":"2022-03-24T16:56:18","slug":"criptonite-asset-management-and-us-based-wave-financial-announce-strategic-partnership","status":"publish","type":"post","link":"https:\/\/wavegp.com\/criptonite-asset-management-and-us-based-wave-financial-announce-strategic-partnership\/","title":{"rendered":"Criptonite Asset Management and US-Based Wave Financial Announce Strategic Partnership"},"content":{"rendered":"\n<p><em>Geneva, Switzerland<\/em> &#8211; <a href=\"https:\/\/www.criptoniteam.com\/\" rel=\"nofollow noopener\" target=\"_blank\">Criptonite AM<\/a>, an innovative Swiss wealth management company, today announced its strategic partnership with <a href=\"https:\/\/wavegp.com\/\">Wave Financial<\/a> (Wave), a SEC regulated digital asset investment manager founded in 2018 with over $500 million in assets under management. The partnership will bring together the experience of traditional Swiss wealth management and the technology focus of one of the top five largest SEC regulated digital asset managers in the United States.&nbsp;<\/p>\n\n\n\n<p>Criptonite and Wave will address the increasing demand from European investors for new, secure and regulated crypto-asset investment products, targeting qualified investors across Switzerland providing diversified crypto investment solutions through regulated Actively Managed Certificates (AMC) focused on growth and income. AMCs are securitized portfolios similar to Exchange Traded Funds and have risen in popularity during the past decade due to the level of flexibility they offer.<\/p>\n\n\n\n<p>“Both our companies were founded with a similar focus on private investors’ needs and share a strong conviction that crypto investments must be treated with the same level of risk and investment management rigour as traditional assets,” says Florian Rais, CEO and Founder of Criptonite. “There was an immediate connection because we speak the same language, share the same vision and our offerings certainly have parallels. All in all, I’m very excited about our new strategic partnership”.<\/p>\n\n\n\n<p>Speaking about the new partnership, Matteo Dante Perruccio, President International at Wave says “David Siemer and Ben Tsai founded Wave Financial with the idea that, although crypto is a new asset class, investors should have access to regulated, rigorously risk managed, compliant vehicles and strategies. As one of the early entrants in the crypto asset management sector, we have accumulated a deep knowledge of the digital asset markets and opportunities. I look forward to working with Criptonite to offer novel and highly attractive investment solutions to their professional clients. Initially, we will be focusing on specific themes, such as income growth, yield generation and diversified strategies, as well as selective portfolios”.<\/p>\n\n\n\n<p>“We help people make rational decisions,” continued Rais. “I regard the growth within the digital assets ecosystem as a transformational phenomenon. As this asset class has grown very rapidly, many traditional asset and wealth managers are increasingly seeking assistance from outside specialists to help service their clients’ crypto investment needs. Both Criptonite and Wave recognise the growing interest amongst traditional investors who want to participate in this new asset class”.&nbsp;<\/p>\n\n\n\n<p>Criptonite has proven over the years that it is able to select attractive investment management teams for the purpose of offering well-managed crypto investment products with an institutional focus. It manages the Next Gems Certificate which helps investors to achieve long-term capital growth by focusing on a mid to short-term swing trade strategy on major pairs of crypto assets. Criptonite will continue to expand its provision of innovative crypto investment solutions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Geneva, Switzerland &#8211; Criptonite AM, an innovative Swiss wealth management company, today announced its strategic partnership with Wave Financial (Wave), a SEC regulated digital asset investment manager founded in 2018&#8230;<\/p>\n","protected":false},"author":6,"featured_media":7388,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/6582"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=6582"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/6582\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/7388"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=6582"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=6582"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=6582"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=6582"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}