{"id":7384,"date":"2022-03-24T16:51:30","date_gmt":"2022-03-24T16:51:30","guid":{"rendered":"https:\/\/wavegp.com\/?p=7384"},"modified":"2022-03-24T16:53:03","modified_gmt":"2022-03-24T16:53:03","slug":"nft-fund-available-to-qualified-investors-in-switzerland","status":"publish","type":"post","link":"https:\/\/wavegp.com\/nft-fund-available-to-qualified-investors-in-switzerland\/","title":{"rendered":"NFT Fund Available to Qualified Investors in Switzerland"},"content":{"rendered":"\n<p><strong><em>– Managed by SEC regulated digital asset investment manager Wave Financial and distributed by Swiss asset manager Criptonite Asset Management SA –<\/em><\/strong><\/p>\n\n\n\n<p><strong><em>– The “Wave Non Fungible Fund” is the first NFT focused digital asset investment product distributed in Switzerland –<\/em><\/strong><\/p>\n\n\n\n<p><em>28, March, 2022 – Geneva, Switzerland \/ Los Angeles, US<\/em> – <a href=\"https:\/\/www.criptoniteam.com\/\" rel=\"nofollow noopener\" target=\"_blank\">Criptonite Asset Management<\/a> SA is pleased to announce that it will distribute the <a href=\"https:\/\/wavegp.com\"><strong>Wave Financial<\/strong><\/a><strong> Non Fungible Fund (NFF)<\/strong>. Wave is an SEC regulated digital asset investment fund manager based in Los Angeles. Following the launch of the NFT fund in December 2021, Wave Financial, which manages over $1 billion across its digital asset fund, institutional and wealth management products, has seen unprecedented demand globally attracting investment over $20 million from qualified investors already. Criptonite Asset Management SA will offer the NFT fund to qualified investors in Switzerland.<\/p>\n\n\n\n<p>Florian Rais &#8211; CEO and Founder of Criptonite Asset Management SA, said:<\/p>\n\n\n\n<p><em>“Following on from the Wave Bitcoin Income &amp; Growth AMC launch early this year, I am delighted that we are able to deepen our partnership bringing this unique high quality NFT fund product to qualified investors in Switzerland. NFTs are uniquely innovative, important digital assets and the investment landscape is still at a stage of rapid evolution. It is incredibly important that accredited investors have access to experienced professionally managed fund products and Wave Financial is a leader in providing choice to those that want it.”<\/em><\/p>\n\n\n\n<p>Matteo Dante Perruccio, President International at Wave Financial, said:&nbsp;<\/p>\n\n\n\n<p><em>“NFTs are rapidly becoming a highly sought-after asset class among professional investors but they are also a complex asset, with a strong community aspect that requires deep experience and knowledge to navigate. Given the shortage of well-managed products, Wave Financial brings the rigours of traditional investing and sound risk management to the digital assets space. We want to provide investors looking for exposure to NFTs and the metaverse, the means to diversify their portfolios in this way, but through a fund responsibly managed by a regulated entity.”<\/em><\/p>\n\n\n\n<p>Wave Financial’s NFT fund has a unique open-ended structure. Through actively participating in the NFT community and multi-platform social media engagement, the fund managers strive to gain exclusive access to multiple NFT drops. The fund, registered with the British Virgin Islands Financial Services Commission, invests in NFT collectibles, platforms, and protocols, with a view to the future of the sub-asset class and the integration of NFT technology in areas such as the metaverse and decentralised finance. Currently, around 70% of allocations are to the thriving digital art and collectibles space, where an analytical approach includes analysis based on the rarity of traits, with a focus on value drivers such as unique content and scarcity in properties.&nbsp;<\/p>\n\n\n\n<p>Appointing a Swiss representative of the NFT fund “NFF” in Switzerland comes as Wave Financial continues to expand its presence and product offering internationally, having already partnered with Criptonite Asset Management to offer Wave’s flagship BTC Income &amp; Growth strategy through an AMC tracker.<\/p>\n\n\n\n<p>The NFT fund is available to qualified investors only. Potential investors are checked for suitability to ensure that the NFT fund meets their investment objectives, in accordance with relevant local rules and regulations.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>– Managed by SEC regulated digital asset investment manager Wave Financial and distributed by Swiss asset manager Criptonite Asset Management SA – – The “Wave Non Fungible Fund” is the&#8230;<\/p>\n","protected":false},"author":6,"featured_media":7386,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8,105],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/7384"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=7384"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/7384\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/7386"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=7384"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=7384"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=7384"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=7384"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}