{"id":7390,"date":"2022-03-30T13:06:40","date_gmt":"2022-03-30T13:06:40","guid":{"rendered":"https:\/\/wavegp.com\/?p=7390"},"modified":"2023-04-04T18:19:02","modified_gmt":"2023-04-04T18:19:02","slug":"wave-financial-launches-ada-yield-fund-to-support-cardano-defi-ecosystem-growth","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-financial-launches-ada-yield-fund-to-support-cardano-defi-ecosystem-growth\/","title":{"rendered":"Wave Financial Launches ADA Yield Fund to Support Cardano DeFi Ecosystem Growth"},"content":{"rendered":"\n<p><em>The ADA Yield Fund aims to provide liquidity and other resources to Cardano’s rapidly expanding DeFi platform startups&nbsp;<\/em><\/p>\n\n\n\n<p><em>30 March, 2022, Los Angeles, US \/ Singapore<\/em> &#8211; <a href=\"https:\/\/wavegp.com\/\">Wave Financial LLC<\/a>&nbsp;(Wave), a SEC regulated digital asset investment management company, is pleased to announce the launch of the Wave ADA Yield Fund.&nbsp; The fund is designed to provide liquidity with millions in line to support new decentralized finance (DeFi) platforms launched in the Cardano ecosystem starting with an initial $100M.<\/p>\n\n\n\n<p>“We’re thrilled to continue breaking ground in the field of cryptocurrency through the creation of innovative new funds, and today we are launching what we believe is the first pure liquidity provisioning fund in crypto,” said David Siemer, CEO of Wave Financial. “Our new fund will support the new decentralized exchanges, lending protocols, and stablecoin issuers building on Cardano. Each of these decentralized applications adds to the strong foundation of the Cardano blockchain as it realizes a fully functional and diverse ecosystem.”<\/p>\n\n\n\n<p>The new ADA Yield Fund represents the continuation of Wave’s mission to support promising entrepreneurs within the crypto space beyond the early stage and foster greater innovation in the overall crypto ecosystem.&nbsp;<\/p>\n\n\n\n<p>“Since the formal launch of smart contracts in 2021, the Cardano community has launched and funded hundreds of companies building on the Cardano blockchain,” said Charles Hoskinson, founder of Input Output, the software technology company that has been an early supporter of Cardano. “Cardano’s growing ecosystem is hosting an ever expanding universe of applications supporting significant numbers of active users – it’s critical for the success of the ecosystem that Cardano-based projects thrive, and so we are pleased that the ADA Yield Fund is committing substantial financial resources to facilitate continued growth and market acceptance.” &nbsp;<\/p>\n\n\n\n<p>Historically, DeFi dApps are among the most popular in crypto in terms of bringing more users and applications&nbsp; on-chain. Specifically, decentralized exchanges (DEX) and defi lenders have gained the fastest popularity in terms of attracting users and capital. DEX typically are set up without market makers, but with two pools of assets that represent each side of a trading pair that serve as a source for DEX counterparties to trade against when they want to transact on either side of the pair. Wave will be using the ADA Yield Fund to provide liquidity to these pairs of pools to support Cardano DEXes. For DeFi lenders, there will also be a similar form of support to augment liquidity to facilitate lending. Also, Wave will continue to support and expand stake pools to strengthen the Cardano network.&nbsp;<\/p>\n\n\n\n<p>&#8220;EMURGO is excited to support the creation of this valuable ADA Yield Fund to further drive expansion and adoption of Cardano&#8217;s quickly developing DeFi ecosystem,&#8221; said Ken Kodama, founder &amp; CEO of EMURGO, a global blockchain solutions company and venture capital fund that has also been an early supporter of Cardano. &#8220;Providing strategic capital resources through the fund will help talented entrepreneurs and projects to build essential DeFi services on Cardano, ultimately delivering impactful solutions and onboarding more users to the global Cardano community.&#8221;<\/p>\n\n\n\n<p>Wave is registered with the US Securities &amp; Exchange Commission as an investment adviser. To learn more about Wave Financial, please visit <a href=\"https:\/\/c212.net\/c\/link\/?t=0&amp;l=en&amp;o=3289020-1&amp;h=3780648448&amp;u=https:\/\/wavegp.com\/&amp;a=wavegp.com\">wavegp.com<\/a>. Please direct media inquiries to:<\/p>\n\n\n\n<p>US<\/p>\n\n\n\n<p><a href=\"mailto:WaveFinancial@finnpartners.com\">WaveFinancial@finnpartners.com<\/a><\/p>\n\n\n\n<p>UK and Europe<\/p>\n\n\n\n<p><a href=\"mailto:angus.campbell@citigatedewerogerson.com\">Angus.Campbell@citigatedewerogerson.com<\/a><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><em>Wave has many relationships with and around the Cardano network, including because it manages funds\/accounts focused on supporting the growth of the Cardano network. In particular, both Input Output (IOG) and EMURGO were investors in the ADA Yield Fund at the time of this press release&#8217;s publication, and are also clients of Wave, and IOG is an investor in Wave&#8217;s parent company. Neither IOG nor EMURGO were compensated for their statements in this press release; however, each had financial incentives to make such statements promoting the ADA Yield Fund due to their own investments in the ADA Yield Fund, their holdings of Cardano&#8217;s native token, ADA, and relationships with Cardano, and IOG&#8217;s investment in Wave.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The ADA Yield Fund aims to provide liquidity and other resources to Cardano’s rapidly expanding DeFi platform startups&nbsp; 30 March, 2022, Los Angeles, US \/ Singapore &#8211; Wave Financial LLC&nbsp;(Wave),&#8230;<\/p>\n","protected":false},"author":6,"featured_media":7392,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8,105],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/7390"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=7390"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/7390\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/7392"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=7390"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=7390"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=7390"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=7390"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}