{"id":7836,"date":"2023-02-27T18:30:37","date_gmt":"2023-02-27T18:30:37","guid":{"rendered":"https:\/\/wavegp.com\/?p=7836"},"modified":"2023-03-11T02:53:56","modified_gmt":"2023-03-11T02:53:56","slug":"wave-digital-assets-rebrand-faq","status":"publish","type":"post","link":"https:\/\/wavegp.com\/wave-digital-assets-rebrand-faq\/","title":{"rendered":"Wave Digital Assets Rebrand FAQ"},"content":{"rendered":"\n<p><\/p>\n\n\n\n<p><strong>Why is Wave changing our name?<\/strong><\/p>\n\n\n\n<p>The transition from Wave Financial to Wave Digital Assets comes at a time of growth for us. Wave was founded on digital asset investing, and is one of the first investment managers registered with the SEC solely managing digital assets.<\/p>\n\n\n\n<p>We strive to deliver smart capital strategies, deep institutional expertise, and dynamic, cutting-edge ideas seeking to maximize the value of the digital assets we manage, in the best interests of our investors. Our new name – Wave Digital Assets – represents our relentless commitment to advancing the sophistication of risk-managed digital asset investment strategies for our clients while promoting global adoption of disruptive emerging technologies.<\/p>\n\n\n\n<p><strong>What is the significance of our rebrand?<\/strong><\/p>\n\n\n\n<p>Wave is navigating the current “Crypto Winter” successfully to date. We have managed to avoid not one, but two of the largest “black swan events” in our industry&#8217;s short history, all while investing in new businesses, scaling our team, and expanding our international footprint. We recognize that market downturns are often the price of innovation, and what it takes for new markets to emerge in an unfamiliar industry. After all, Wave was born in a bear market.<\/p>\n\n\n\n<p>The crypto industry is currently at an inflection point as we navigate to identify the hallmark institutions that we believe will have a lasting impact on finance and technology as a whole. Perceptions are changing, and the process of crypto acceptance, integration and adoption has accelerated since the pandemic. This is an exciting milestone that comes at a critical time in the marketplace.<\/p>\n\n\n\n<p>We recognized this opportunity early on, and with this movement comes Wave’s inspiration for rebranding. This rebrand symbolizes the strides we have made as an organization &#8211; a leader in the industry &#8211; at the forefront of innovation and modernization. There is more to come &#8211; and while our new company name and brand helps to embody our growth, it also allows us to strategically position ourselves for years to come.<\/p>\n\n\n\n<p><strong>What does this rebrand mean for our partners and customers?<\/strong><\/p>\n\n\n\n<p>Although this may seem like a big change, rest assured, our unwavering commitment to our values, our investors, and our core philosophy remains the same. Wave will continue to expand on new and innovative products and services to serve our clients’ current and evolving needs, just with a new and improved look.<\/p>\n\n\n\n<p>The time has come for Wave to differentiate ourselves from the competition and ensure we continue to exceed our clients&#8217; expectations. Wave is here to help investors unlock the door to regulated financial freedom with Smart Crypto Investing. Welcome to the new Wave Digital Assets.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Why is Wave changing our name? The transition from Wave Financial to Wave Digital Assets comes at a time of growth for us. Wave was founded on digital asset investing,&#8230;<\/p>\n","protected":false},"author":12,"featured_media":7844,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[],"fund-category":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/7836"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=7836"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/posts\/7836\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media\/7844"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=7836"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/categories?post=7836"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/tags?post=7836"},{"taxonomy":"fund-category","embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/fund-category?post=7836"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}