{"id":3,"date":"2020-10-30T10:15:11","date_gmt":"2020-10-30T10:15:11","guid":{"rendered":"https:\/\/wavegp.com\/?page_id=3"},"modified":"2021-01-21T19:41:09","modified_gmt":"2021-01-21T19:41:09","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/wavegp.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<p><strong>Introduction<\/strong><br><strong>‍<\/strong>Wave Financial Group (&#8220;Company&#8221; or &#8220;We&#8221;) respects your privacy and is committed to protecting it through our compliance with this policy. This policy describes the types of information we may collect from you or that you may provide when you visit the website <a href=\"https:\/\/wavegp.com\/\">www.wavegp.com<\/a> (our &#8220;Website&#8221;) and our practices for collecting, using, maintaining, protecting and disclosing that information.<\/p>\n\n\n\n<p>‍<strong>This policy applies to information we collect:<\/strong><br><strong>‍<\/strong>On our Website and through your use of Wave Financial Group platform and services (including the issuer investor dashboards and user accounts).<br>In e-mail, text and other electronic messages between you and our Website.<br>Through mobile and desktop applications you download from our Website, which provide dedicated non-browser-based interaction between you and our Website.<br>When you interact with our advertising and applications on third-party websites and services, if those applications or advertising include links to this policy.<br>When you subscribe to an investment in our funds.<br>When you open an account for our managed services.<\/p>\n\n\n\n<p>‍<strong>It does not apply to information collected by:<\/strong><br><strong>‍<\/strong>Any third party including through any application or content (including advertising) that may link to or be accessible from or on the Website, because this content is out of our control.<\/p>\n\n\n\n<p>Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Website. By accessing or using our Website, you agree to this privacy policy. This policy may change from time to time. Your continued use of our Website after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates.<br><\/p>\n\n\n\n<ul><li><strong>‍<\/strong>On our Website and through your use of Wave Financial Group platform and services (including the issuer investor dashboards and user accounts).<br><\/li><li>In email, text and other electronic messages between you and our Website.<br><\/li><li>Through mobile and desktop applications you download from our Website, which provide dedicated non-browser-based interaction between you and our Website.<br><\/li><li>When you interact with our advertising and applications on third-party websites and services, if those applications or advertising include links to this policy.<br><\/li><li>When you subscribe to an investment in our funds.<br><\/li><li>When you open an account for our managed services.<br><\/li><\/ul>\n\n\n\n<p>‍<strong>It does not apply to information collected by:<\/strong><br><\/p>\n\n\n\n<ul><li>Any third party including through any application or content (including advertising) that may link to or be accessible from or on the Website, because this content is out of our control.<br><\/li><\/ul>\n\n\n\n<p>Please read this policy carefully to understand our policies and practices regarding your information and how we will treat it. If you do not agree with our policies and practices, your choice is not to use our Website. By accessing or using our Website, you agree to this privacy policy. This policy may change from time to time. Your continued use of our Website after we make changes is deemed to be acceptance of those changes, so please check the policy periodically for updates.<\/p>\n\n\n\n<p><strong>Children Under the Age of 13<\/strong><br><strong>‍<\/strong>Our Website is not intended for children under 13 years of age. No one under age 13 may provide any personal information to or on the Website. We do not knowingly collect personal information from children under 13. If you are under 13, do not use or provide any information on our Website or on or through any of its features\/register on the Website, make any purchases through the Website, use any of the interactive or public comment features of our Website, or provide any information about yourself to us, including your name, address, telephone number, e-mail address, or any screen name or user name you may use. If we learn we have collected or received personal information from a child under 13 without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13, please contact us at <a href=\"mailto:support@wavegp.com\">support@wavegp.com<\/a>.<\/p>\n\n\n\n<p>‍<strong>Information We Collect About You and How We Collect It<\/strong><br><strong>‍<\/strong>We collect several types of information from and about users of our Website and the Wave Financial Group platform and services, including information:<br><\/p>\n\n\n\n<ul><li>by which you may be personally identified, such as name, postal address, e-mail address, telephone number, social security number, passport number, date of birth, taxpayer or government identification number, or any other identifier by which you may be contacted online or offline (&#8220;personal information&#8221;);<br><\/li><li>that is about you but individually does not identify you, such as gender, salary, and job;<br><\/li><li>about your crypto-wallet address, bank account and routing numbers and\/or credit card numbers that you link to your Wave Financial Group or input when you use paid Wave Financial Group services; and\/or<br><\/li><li>about your internet connection, the equipment you use to access our Website and usage details.<br><\/li><\/ul>\n\n\n\n<p><strong>We collect this information:<\/strong><br><\/p>\n\n\n\n<ul><li>Directly from you when you provide it to us.<br><\/li><li>Automatically as you navigate through the site. Information collected automatically may include usage details, IP addresses, device information including, but not limited to, identifier, device name and type, operating system, location, mobile network information, and standard web log information, such as your browser type, traffic to and from our site, and the pages you accessed on our website, and information collected through cookies, web beacons, and other tracking technologies.<br><\/li><li>From third parties; for example, credit bureaus, identity verification services, and our business partners.<br><\/li><\/ul>\n\n\n\n<p><strong>Information You Provide to Us<\/strong><br>The information we collect on or through our Website or your use of the Wave Financial Group platform or services may include:<br><\/p>\n\n\n\n<ul><li>Information that you provide by filling in forms on our Website. This includes information provided at the time of registering to use our Website, subscribing to our service, posting material, or requesting further services. We may also ask you for information when you report a problem with our Website.<br><\/li><li>Records and copies of your correspondence (including e-mail addresses), if you contact us.<br><\/li><li>Your responses to surveys that we might ask you to complete for research purposes.<br><\/li><li>Details of transactions you carry out through our Website and of the fulfillment of your orders. You will be required to provide financial information before placing an order through our Website.<br><\/li><li>Your search queries on the Website.<br><\/li><\/ul>\n\n\n\n<p><strong>Information We Collect Through Automatic Data Collection Technologies<\/strong><br>As you navigate through and interact with our Website, we may use automatic data collection technologies to collect certain information about your equipment, browsing actions and patterns, including:<br><\/p>\n\n\n\n<ul><li>Details of your visits to our Website, including traffic data, location data, logs and other communication data, and the resources that you access and use on the Website.<br><\/li><li>Information about your computer and internet connection, including your IP address, operating system, and browser type.<br><\/li><li>Wave Financial Group does not track its customers over time and across third-party websites to provide targeted advertising and therefore does not respond to Do Not Track (DNT) signals. Third parties that have content embedded on Wave Financial Group websites may set cookies on a user’s browser and\/or obtain information about the fact that a web browser visited a specific Wave Financial Group website from a certain IP address.<br><\/li><\/ul>\n\n\n\n<p>See your web browser&#8217;s documentation for information on how to enable DNT signals and learn about other mechanisms that enable consumers to exercise choice about behavioral tracking.<\/p>\n\n\n\n<p>The information we collect automatically is statistical data and may include personal information, but we may maintain it or associate it with personal information we collect in other ways or receive from third parties. It helps us to improve our Website and to deliver a better and more personalized service, including by enabling us to:<br><\/p>\n\n\n\n<ul><li>Estimate our audience size and usage patterns.<br><\/li><li>Store information about your preferences, allowing us to customize our Website according to your individual interests.<br><\/li><li>Speed up your searches.<br><\/li><li>Recognize you when you return to our Website.<br><\/li><\/ul>\n\n\n\n<p><strong>The technologies we use for this automatic data collection may include:<\/strong><br><\/p>\n\n\n\n<ul><li>Cookies (or browser cookies). A cookie is a small file placed on the hard drive of your computer. You may refuse to accept browser cookies by activating the appropriate setting on your browser. However, if you select this setting you may be unable to access certain parts of our Website. Unless you have adjusted your browser setting so that it will refuse cookies, our system will issue cookies when you direct your browser to our Website.<br><\/li><li>Flash Cookies. Certain features of our Website may use local stored objects (or Flash cookies) to collect and store information about your preferences and navigation to, from, and on our Website. Flash cookies are not managed by the same browser settings as are used for browser cookies.<br><\/li><li>Web Beacons. Pages of our Website and our e-mails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an e-mail and for other related website statistics (for example, recording the popularity of certain website content and verifying system and server integrity).<br><\/li><\/ul>\n\n\n\n<p><strong>Third-party Use of Cookies and Other Tracking Technologies<\/strong><br><strong>‍<\/strong>Some content or applications on the Website are served by third-parties, including content providers and application providers. These third-parties may use cookies alone or in conjunction with web beacons or other tracking technologies to collect information about you when you use our website. The information they collect may be associated with your personal information or they may collect information, including personal information, about your online activities over time and across different websites and other online services. They may use this information to provide you with targeted content.<\/p>\n\n\n\n<p>We do not control these third-parties&#8217; tracking technologies or how they may be used. If you have any questions about targeted content, you should contact the responsible provider directly.<\/p>\n\n\n\n<p>‍<strong>How We Use Your Information<\/strong><br><strong>‍<\/strong>We use information that we collect about you or that you provide to us, including any personal information:<br><\/p>\n\n\n\n<ul><li>To present our Website and its contents to you.<br><\/li><li>To enable your use of the Wave Financial Group platform and services and to process transactions and send notices about your transactions.<br><\/li><li>To provide you with information, products, or services that you request from us.<br><\/li><li>To fulfill any other purpose for which you provide it.<br><\/li><li>To provide you with notices about your account.<br><\/li><li>To carry out our obligations and enforce our rights arising from any contracts entered into between you and us, including for executing transactions, billing and collection.<br><\/li><li>Resolve disputes, collect fees, and troubleshoot problems.<br><\/li><li>To notify you about changes to our Website or any products or services we offer or provide though it.<br><\/li><li>To allow you to participate in interactive features on our Website.<br><\/li><li>In any other way we may describe when you provide the information.<br><\/li><li>For any other purpose with your consent.<br><\/li><li>We may also use your information to contact you about our own and third-parties&#8217; goods and services that may be of interest to you. If you do not want us to use your information in this way, please check the relevant box located on the form on which we collect your data (the registration form) or adjust your user preferences in your account profile.<br><\/li><\/ul>\n\n\n\n<p><strong>Disclosure of Your Information<\/strong><br>We may disclose aggregated information about our users, and information that does not identify any individual, without restriction.<\/p>\n\n\n\n<p>We may disclose personal information that we collect or you provide as described in this privacy policy:<br><\/p>\n\n\n\n<ul><li>To our subsidiaries and affiliates.<br><\/li><li>To contractors, service providers, and other third parties we use to support our business and who are bound by contractual obligations to keep personal information confidential and use it only for the purposes for which we disclose it to them.<br><\/li><li>To a buyer or other successor in the event of a merger, divestiture, restructuring, reorganization, dissolution or other sale or transfer of some or all of Wave Financial Group&#8217;s assets, whether as a going concern or as part of bankruptcy, liquidation, or similar proceeding, in which personal information held by Wave Financial Group about our Website users is among the assets transferred.<br><\/li><li>To fulfill the purpose for which you provide it.<br><\/li><li>For any other purpose disclosed by us when you provide the information, provided that in some cases we will offer you an opportunity to opt out of the sharing.<br><\/li><li>With your consent.<br><\/li><\/ul>\n\n\n\n<p>We may also disclose your personal information:<br><\/p>\n\n\n\n<ul><li>To comply with any court order, law or legal process, including to respond to any government or regulatory request.<br><\/li><li>To enforce or apply our terms of use <a href=\"https:\/\/wavegp.com\/terms-of-service\/\" class=\"rank-math-link\">wavegp.com\/terms-of-service<\/a> and other agreements, including for billing and collection purposes.<br><\/li><li>If we believe disclosure is necessary or appropriate to protect the rights, property, or safety of Wave Financial Group, our customers, or others. This includes exchanging information with other companies and organizations for the purposes of fraud protection and credit risk reduction.<br><\/li><\/ul>\n\n\n\n<p><strong>Choices About How We Use and Disclose Your Information<\/strong><br><strong>‍<\/strong>We strive to provide you with choices regarding the personal information you provide to us. We have created mechanisms to provide you with the following control over your information:<br><\/p>\n\n\n\n<ul><li>Tracking Technologies. You can set your browser to refuse all or some browser cookies, or to alert you when cookies are being sent. To learn how you can manage your Flash cookie settings, visit the Flash player settings page on Adobe&#8217;s website. If you disable or refuse cookies, please note that some parts of this site may then be inaccessible or not function properly.<br><\/li><li>Promotional Offers from the Company. If you do not wish to have your e-mail address or contact information used by the Company to promote our own or third parties&#8217; products or services, you can opt-out by checking the relevant box located on the form on which we collect your data (the registration form) or at any other time by logging into the Website and adjusting your user preferences in your account profile by checking or unchecking the relevant boxes or by sending us an e-mail stating your request to <a href=\"mailto:support@wavegp.com\">support@wavegp.com<\/a>. If we have sent you a promotional e-mail, you may send us a return e-mail asking to be omitted from future e-mail distributions. This opt out does not apply to information provided to the Company as a result of a service purchase, service experience, or other transactions.<br><\/li><\/ul>\n\n\n\n<p>We do not control third parties&#8217; collection or use of your information to serve interest-based advertising. However, these third parties may provide you with ways to choose not to have your information collected or used in this way. You can opt out of receiving targeted ads from members of the Network Advertising Initiative (&#8220;NAI&#8221;) on the NAI&#8217;s website.<\/p>\n\n\n\n<p>‍<strong>Accessing and Correcting Your Information<\/strong><br><strong>‍<\/strong>In order to register to use and use the Wave Financial Group platform or any Wave Financial Group services in connection with any issuance of a Wave Financial Group customer, you will also be required to accept the terms and conditions of the Wave Financial Group authorized user terms (“Authorized User Agreement”) made available to you at the time of registration. The Authorized User Agreement will govern your access to and use of the Wave Financial Group platform and services. You can review and change your personal information by logging into the your Wave Financial Group account.You may also send us an e-mail at <a href=\"mailto:support@wavegp.com\">support@wavegp.com<\/a> to request access to, correct, or delete any personal information that you have provided to us. We cannot delete your personal information except by also deleting your user account. We may not accommodate a request to change information if we believe the change would violate any law or legal requirement or cause the information to be incorrect.If you delete your User Contributions from the Website, copies of your User Contributions may remain viewable in cached and archived pages, or might have been copied or stored by other Website users. Proper access and use of information provided on the Website, including User Contributions, is governed by our terms of use at <a href=\"https:\/\/wavegp.com\/tos\" class=\"rank-math-link\">https:\/\/wavegp.com\/terms-of-service<\/a>.<\/p>\n\n\n\n<p>‍<strong>Your California Privacy Rights<\/strong><br><strong>‍<\/strong>California Civil Code Section § 1798.83 permits users of our Website that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request, please send an e-mail to <a href=\"mailto:support@wavegp.com\">support@wavegp.com<\/a>.<\/p>\n\n\n\n<p>‍<strong>Data Security<\/strong><br><strong>‍<\/strong>We have implemented measures designed to secure your personal information from accidental loss and from unauthorized access, use, alteration, and disclosure. We store and process your personal and transactional information, including certain payment information, such as your encrypted bank account and\/or routing numbers, on our computers in the United States and elsewhere in the world where Wave Financial Group facilities or our service providers are located, and we protect it by maintaining physical, electronic, and procedural safeguards in compliance with applicable U.S. federal and state regulations. We use computer safeguards such as firewalls and data encryption, enforce physical access controls to our buildings and files, and authorize access to personal information only for those employees who require it to fulfill their job responsibilities.<\/p>\n\n\n\n<p>The safety and security of your information also depends on you. Where we have given you (or where you have chosen) a password for access to certain parts of our Website, you are responsible for keeping this password confidential. We ask you not to share your password with anyone.<\/p>\n\n\n\n<p>Unfortunately, the transmission of information via the internet is not completely secure. Although we do our best to protect your personal information, we cannot guarantee the security of your personal information transmitted to our Website. Any transmission of personal information is at your own risk. We are not responsible for circumvention of any privacy settings or security measures contained on the Website.<\/p>\n\n\n\n<p>We store our customers&#8217; personal information securely throughout the life of the customer&#8217;s Wave Financial Group account. Wave Financial Group will retain your personal information for a minimum of five years or as necessary to comply with our legal obligations or to resolve disputes.<\/p>\n\n\n\n<p>‍<strong>Changes to Our Privacy Policy<\/strong><br><strong>‍<\/strong>It is our policy to post any changes we make to our privacy policy on this page with a notice that the privacy policy has been updated on the Website home page. If we make material changes to how we treat our users&#8217; personal information, we will notify you by e-mail to the primary e-mail address specified in your account or through a notice on the Website home page. The date the privacy policy was last revised is identified at the top of the page. You are responsible for ensuring we have an up-to-date active and deliverable e-mail address for you, and for periodically visiting our Website and this privacy policy to check for any changes.<\/p>\n\n\n\n<p>‍<strong>Contact Information<\/strong><br><strong>‍<\/strong>To ask questions or comment about this privacy policy and our privacy practices, contact us at <a href=\"mailto:support@wavegp.com\">support@wavegp.com<\/a>, or via our toll-free number +1-833-331-9283.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Introduction‍Wave Financial Group (&#8220;Company&#8221; or &#8220;We&#8221;) respects your privacy and is committed to protecting it through our compliance with this policy. This policy describes the types of information we may&#8230;<\/p>\n","protected":false},"author":6,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/pages\/3"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/pages\/3\/revisions"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}