{"id":3408,"date":"2020-11-21T13:34:19","date_gmt":"2020-11-21T13:34:19","guid":{"rendered":"https:\/\/wavegp.com\/?page_id=3408"},"modified":"2020-11-21T15:54:10","modified_gmt":"2020-11-21T15:54:10","slug":"terms-of-service","status":"publish","type":"page","link":"https:\/\/wavegp.com\/terms-of-service\/","title":{"rendered":"Terms of Service"},"content":{"rendered":"\n<p>PLEASE READ THESE TERMS OF SERVICE CAREFULLY. BY ACCESSING OR USING THIS SITE, YOU AGREE TO BE LEGALLY BOUND BY THESE TERMS OF SERVICE AND ALL TERMS INCORPORATED BY REFERENCE.<\/p>\n\n\n\n<p><strong>This is an agreement between you and Wave Financial<\/strong><br>The <a href=\"https:\/\/wavegp.com\/\">www.wavegp.com<\/a> website (the &#8220;Site&#8221;) is comprised of various web pages operated by Wave Financial, LLC (&#8220;Wave Financial&#8221;), and is offered to you conditioned on your acceptance without modification of the terms, conditions, and notices contained herein (the &#8220;Terms&#8221;). Your use of the Site constitutes your agreement to all such Terms. Please read these Terms carefully and keep a copy of them for your reference. In order to register to use or use the Wave Financial platform or any Wave Financial services in connection with any issuance of a Wave Financial customer, you will also be required to accept the terms and conditions of the Wave Financial authorized user terms (“Authorized User Agreement”) made available to you at the time of registration. The Authorized User Agreement, will govern your access to and use of the Wave Financial platform and services.<\/p>\n\n\n\n<p><strong>Eligibility to Use the Site<\/strong>&nbsp;<br>Wave Financial does not knowingly collect, either online or offline, personal information from persons under the age of thirteen. To be eligible to use the Site, you must be at least 18 years old.<\/p>\n\n\n\n<p><strong>Privacy<\/strong><br>Your use of the Site is subject to the Wave Financial Privacy Policy: <a href=\"https:\/\/wavegp.com\/privacy\">www.wavegp.com\/privacy<\/a>. Please review the Privacy Policy, which also governs the Site and informs users of our data collection practices.<\/p>\n\n\n\n<p><strong>Creating a Wave Financial Account<\/strong>&nbsp;<br>In order to use the Wave Financial Services for purposes of requesting information regarding a Company Offering or participating in a Company Offering, you will need to accept the terms of the Authorized User Agreement and register for a Wave Financial account (a &#8220;Wave Financial Account&#8221;). During the registration process, we will ask you for information, including your name and other personal information, to verify your identity. We may, at our sole discretion, refuse to open a Wave Financial Account for you, or limit the number of Wave Financial Accounts that you may hold.<\/p>\n\n\n\n<p><strong>Electronic Communications<\/strong><br>Visiting the Site, any issuer-specific webpage hosted by Wave Financial, or sending emails to Wave Financial constitutes electronic communications. You consent to receive electronic communications and you agree that all agreements, notices, disclosures, and other communications that we provide to you electronically, via email and on the Site, satisfy any legal requirement that such communications be in writing.<\/p>\n\n\n\n<p><strong>Your Account<\/strong><br>If you use this Site, you are responsible for maintaining the confidentiality of your account and password, and for restricting access to your computer, and you agree to accept responsibility for all activities that occur under your account or password. You may not assign or otherwise transfer your account to any other person or entity. You acknowledge that Wave Financial is not responsible for third party access to your account that results from theft or misappropriation of your account. Wave Financial and its associates reserve the right to refuse or cancel service, terminate accounts, or remove or edit content in our sole discretion.<\/p>\n\n\n\n<p><strong>Links to Third Party Sites\/Third Party Services<\/strong><br>The Site may contain links to third party websites (&#8220;Linked Sites&#8221;). The Linked Sites are not under the control of Wave Financial and Wave Financial is not responsible for the contents of any Linked Site, including without limitation any link contained in a Linked Site, or any changes or updates to a Linked Site. Wave Financial is providing these links to you only as a convenience, and the inclusion of any link does not imply endorsement by Wave Financial of the site or any association with its operators.<\/p>\n\n\n\n<p>Certain services made available via the Site may be delivered by third party sites and organizations. By using any third-party product, service or functionality originating from the <a href=\"https:\/\/wavegp.com\/\">www.wavegp.com<\/a> domain, you hereby acknowledge and consent that Wave Financial may share such information and data with any third party with whom Wave Financial has a contractual relationship to provide the requested product, service, or functionality on behalf of Site users and customers.<\/p>\n\n\n\n<p>Wave Financial has no control over, or liability for, the delivery, quality, safety, legality, or any other aspect of any goods or services that you may purchase or sell to or from a third party (including other users of Wave Financial Services). Wave Financial is not responsible for ensuring that a buyer or a seller you may transact with will actually complete the transaction, or is authorized to do so. If you experience a problem with any goods or services purchased from, or sold to, a third party in connection with security tokens transferred using the Wave Financial Services, or if you have a dispute with such third party, you must resolve the dispute directly with that third party. If you believe a third party has behaved in a fraudulent, misleading, or inappropriate manner, or if you cannot adequately resolve a dispute with a third party, you may notify Wave Financial Support at <a href=\"mailto:info@wavegp.com\">info@wavegp.com<\/a> so that we may consider what action to take, if any.<\/p>\n\n\n\n<p><strong>No Unlawful or Prohibited Use\/Intellectual Property&nbsp;<\/strong><br>You are granted a non-exclusive, non-transferable, revocable license to access and use the Site strictly in accordance with these Terms. As a condition of your use of the Site, you warrant to Wave Financial that you will not use the Site for any purpose that is unlawful or otherwise prohibited by these Terms. You may not use the Site in any manner which could damage, disable, overburden, or impair the Site or interfere with any other party&#8217;s use and enjoyment of the Site. You may not obtain or attempt to obtain any materials or information through any means not intentionally made available or provided for through the Site.<\/p>\n\n\n\n<p>All content included as part of the Service, such as text, graphics, logos, images, as well as the compilation thereof, and any software used on the Site, is the property of Wave Financial or its suppliers and protected by copyright and other laws that protect intellectual property and proprietary rights. You agree to observe and abide by all copyright and other proprietary notices, legends, or other restrictions contained in any such content and will not make any changes thereto.<\/p>\n\n\n\n<p>You will not modify, publish, transmit, reverse engineer, participate in the transfer or sale, create derivative works, or in any way exploit any of the content, in whole or in part, found on the Site. Wave Financial content is not for resale. Your use of the Site does not entitle you to make any unauthorized use of any protected content, and in particular you will not delete or alter any proprietary rights or attribution notices in any content. You will use protected content solely for your personal use, and will make no other use of the content without the express written permission of Wave Financial and the copyright owner. You agree that you do not acquire any ownership rights in any protected content. We do not grant you any licenses, express or implied, to the intellectual property of Wave Financial or our licensors except as expressly authorized by these Terms.<\/p>\n\n\n\n<p><strong>Third-Party Accounts<\/strong><br>You may be able to connect your Wave Financial account to third-party accounts. By connecting your Wave Financial account to your third-party account, you acknowledge and agree that you are consenting to the continuous release of information about you to others (in accordance with your privacy settings on those third-party sites). If you do not want information about you to be shared in this manner, do not use this feature.<\/p>\n\n\n\n<p><strong>International Users<\/strong><br>The Site is controlled, operated and administered by Wave Financial from its offices within the USA. If you access the Site from a location outside the USA, you are responsible for compliance with all local laws. You agree that you will not use the content accessed through the Site in any country or in any manner prohibited by any applicable laws, restrictions, or regulations.<\/p>\n\n\n\n<p><strong>Indemnification<\/strong><br>You agree to indemnify, defend, and hold harmless Wave Financial, its officers, directors, employees, agents, and third parties, for any losses, costs, liabilities, and expenses (including reasonable attorney&#8217;s fees) relating to or arising out of your use of or inability to use the Site, any user postings made by you, your violation of any of these Terms, or your violation of any rights of a third party, or your violation of any applicable laws, rules or regulations. Wave Financial reserves the right, at its own cost, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you, in which event you will fully cooperate with Wave Financial in asserting any available defenses.<\/p>\n\n\n\n<p><strong>Arbitration<\/strong><br>In the event the parties are not able to resolve any dispute between them arising out of or concerning these Terms, or any provisions hereof, whether in contract, tort, or otherwise at law or in equity for damages or any other relief, then such dispute shall be resolved only by final and binding arbitration pursuant to the Federal Arbitration Act, conducted by a single neutral arbitrator and administered by the American Arbitration Association, or a similar arbitration service selected by the parties, in a location mutually agreed upon by the parties. The arbitrator&#8217;s award shall be final, and judgment may be entered upon it in any court having jurisdiction. In the event that any legal or equitable action, proceeding, or arbitration arises out of or concerns these Terms, the prevailing party shall be entitled to recover its costs and reasonable attorney&#8217;s fees. The parties agree to arbitrate all disputes and claims in regards to these Terms or any disputes arising as a result of these Terms, whether directly or indirectly, including tort claims that are a result of these Terms. The parties agree that the Federal Arbitration Act governs the interpretation and enforcement of this provision. The entire dispute, including the scope and enforceability of this arbitration provision shall be determined by the Arbitrator. This arbitration provision shall survive the termination of these Terms.<\/p>\n\n\n\n<p><strong>Class Action Waiver<\/strong>&nbsp;<br>Any arbitration under these Terms will take place on an individual basis; class arbitrations and class\/representative\/collective actions are not permitted. THE PARTIES AGREE THAT A PARTY MAY BRING CLAIMS AGAINST THE OTHER ONLY IN EACH&#8217;S INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PUTATIVE CLASS, COLLECTIVE AND\/ OR REPRESENTATIVE PROCEEDING, SUCH AS IN THE FORM OF A PRIVATE ATTORNEY GENERAL ACTION AGAINST THE OTHER. Further, unless both you and Wave Financial agree otherwise, the arbitrator may not consolidate more than one person&#8217;s claims, and may not otherwise preside over any form of a representative or class proceeding.<\/p>\n\n\n\n<p><strong>Liability Disclaimer<\/strong><br>THE INFORMATION INCLUDED IN OR AVAILABLE THROUGH THE SITE MAY INCLUDE INACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN. WAVE FINANCIAL AND\/OR ITS SUPPLIERS MAY MAKE IMPROVEMENTS AND\/OR CHANGES IN THE SITE AT ANY TIME. WAVE FINANCIAL AND\/OR ITS SUPPLIERS MAKE NO REPRESENTATIONS ABOUT THE SUITABILITY, RELIABILITY, AVAILABILITY, TIMELINESS, AND ACCURACY OF THE INFORMATION AND RELATED GRAPHICS CONTAINED ON THE SITE FOR ANY PURPOSE. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, ALL SUCH INFORMATION AND RELATED GRAPHICS ARE PROVIDED &#8220;AS IS&#8221; WITHOUT WARRANTY OR CONDITION OF ANY KIND. WAVE FINANCIAL AND\/OR ITS SUPPLIERS HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH REGARD TO THIS INFORMATION AND RELATED GRAPHICS, INCLUDING ALL IMPLIED WARRANTIES OR CONDITIONS OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, AND NON-INFRINGEMENT. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL WAVE FINANCIAL AND\/OR ITS SUPPLIERS BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF USE, DATA, OR PROFITS, ARISING OUT OF OR IN ANY WAY CONNECTED WITH THE USE OR PERFORMANCE OF THE SITE, WITH THE DELAY OR INABILITY TO USE THE SITE, THE PROVISION OF OR FAILURE TO PROVIDE SERVICES, OR FOR ANY INFORMATION AND RELATED GRAPHICS OBTAINED THROUGH THE SITE, OR OTHERWISE ARISING OUT OF THE USE OF THE SITE, WHETHER BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY OR OTHERWISE, EVEN IF WAVE FINANCIAL OR ANY OF ITS SUPPLIERS HAS BEEN ADVISED OF THE POSSIBILITY OF DAMAGES. BECAUSE SOME STATES\/JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE LIMITATION MAY NOT APPLY TO YOU. IF YOU ARE DISSATISFIED WITH ANY PORTION OF THE SITE, OR WITH ANY OF THESE TERMS OF USE, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE USING THE SITE.<\/p>\n\n\n\n<p><strong>Termination\/Access Restriction<\/strong>&nbsp;<br>Wave Financial reserves the right, in its sole discretion, to terminate your access to the Site or any portion thereof at any time, without notice. To the maximum extent permitted by law, these Terms are governed by the laws of the State of California, and you hereby consent to the exclusive jurisdiction and venue of courts in California in all disputes arising out of or relating to the use of the Site. Use of the Site is unauthorized in any jurisdiction that does not give effect to all provisions of these Terms, including, without limitation, this section.<\/p>\n\n\n\n<p>The information to which this Site gives access does not constitute an offer or an invitation to purchase securities offered through the Wave Financial Services in the United States, Australia, Canada, Japan, South Africa, or the People’s Republic of China, or in any other jurisdiction in which such offer or invitation is not authorized or to any person to whom it is unlawful to make such offer or invitation. Potential users of information obtained from issuers through the Wave Financial Services are requested to inform themselves about and to observe any such restrictions.&nbsp;<\/p>\n\n\n\n<p>Securities cannot be offered or sold in the United States without registration under the United States Securities Act of 1933, as amended, or pursuant to an exemption from such registration.<br>‍<br>You agree that no joint venture, partnership, employment, or agency relationship exists between you and Wave Financial as a result of these Terms or use of the Site. Wave Financial’s performance of these Terms is subject to existing laws and legal process, and nothing contained in these Terms is in derogation of Wave Financial’s right to comply with governmental, court, and law enforcement requests or requirements relating to your use of the Site or information provided to or gathered by Wave Financial with respect to such use. If any part of these Terms is determined to be invalid or unenforceable pursuant to applicable law including, but not limited to, the warranty disclaimers and liability limitations set forth above, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most closely matches the intent of the original provision and the remainder of these Terms shall continue in effect.<\/p>\n\n\n\n<p>Unless otherwise specified herein, these Terms, the Privacy Policy, and the terms of the Authorized User Agreement that you accept comprise the entire understanding and agreement between you and Wave Financial as to the subject matter hereof, and supersedes all prior or contemporaneous communications and proposals, whether electronic, oral, or written, between the you and Wave Financial with respect to the Site. A printed version of these Terms and of any notice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to these Terms to the same extent and subject to the same conditions as other business documents and records originally generated and maintained in printed form. It is the express wish to the parties that these Terms and all related documents be written in English.<\/p>\n\n\n\n<p><strong>Changes to Terms<\/strong><br>Wave Financial reserves the right, in its sole discretion, to change the Terms under which the Site is offered. The most current version of the Terms will supersede all previous versions. Wave Financial encourages you to periodically review the Terms to stay informed of our updates.<\/p>\n\n\n\n<p><strong>Contact Us<\/strong><br>Wave Financial welcomes your questions or comments regarding the Terms:<\/p>\n\n\n\n<p>Mailing Address:<br>Wave Financial, Inc.<br>12400 Wilshire Blvd<br>Los Angeles, CA 90025<\/p>\n\n\n\n<p>Email Address: <a href=\"mailto:info@wavegp.com\">info@wavegp.com<\/a>&nbsp;<\/p>\n\n\n\n<p>Telephone number:<br>+1 833-331-WAVE<\/p>\n\n\n\n<p>Effective as of March 20, 2019<\/p>\n\n\n\n<p><strong>APPENDIX 1: E-SIGN DISCLOSURE AND CONSENT<\/strong><br>This policy describes how Wave Financial delivers communications to you electronically. We may amend this policy at any time by providing a revised version on our website. The revised version will be effective at the time we post it. We will provide you with prior notice of any material changes via our website.<br><strong>Electronic Delivery of Communications<\/strong><br>You agree and consent to receive electronically all communications, agreements, documents, notices, and disclosures (collectively, &#8220;Communications&#8221;) that we provide in connection with your use of this Site:<\/p>\n\n\n\n<ul><li>Terms of use and policies you agree to (e.g., the Wave Financial Privacy Policy), including updates to these agreements or policies;<\/li><li>Account details, history, transaction receipts, confirmations, and any other Account or transaction information;<br><\/li><li>Legal, regulatory, and tax disclosures or statements we may be required to make available to you; and<\/li><li>Responses to claims or customer support inquiries filed in connection with your use of this Site.<br><\/li><\/ul>\n\n\n\n<p>We will provide these Communications to you by posting them on the Wave Financial website, emailing them to you at the primary email address you may provide to Securitize, communicating to you via instant chat, and\/or through other electronic communication such as text message or mobile push notification.<\/p>\n\n\n\n<p><strong>Hardware and Software Requirements<\/strong><br>In order to access and retain electronic Communications, you will need the following computer hardware and software:<\/p>\n\n\n\n<ul><li>A device with an Internet connection;<\/li><li>A current web browser that includes 128-bit encryption (e.g. Internet Explorer version 9.0 and above, Firefox version 3.6 and above, Chrome version 31.0 and above, or Safari 7.0 and above) with cookies enabled;<\/li><li>A valid email address (your primary email address on file with Wave Financial); and<\/li><li>Sufficient storage space to save past Communications or an installed printer to print them.<\/li><\/ul>\n","protected":false},"excerpt":{"rendered":"<p>PLEASE READ THESE TERMS OF SERVICE CAREFULLY. BY ACCESSING OR USING THIS SITE, YOU AGREE TO BE LEGALLY BOUND BY THESE TERMS OF SERVICE AND ALL TERMS INCORPORATED BY REFERENCE&#8230;.<\/p>\n","protected":false},"author":6,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/pages\/3408"}],"collection":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/comments?post=3408"}],"version-history":[{"count":0,"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/pages\/3408\/revisions"}],"wp:attachment":[{"href":"https:\/\/wavegp.com\/wp-json\/wp\/v2\/media?parent=3408"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}